var gvMoon = {  "l": [
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.12.2 재해 복구 시험 및 개선",
        "1.1.1 경영진의 참여",
        "3.4.1 개인정보 파기",
        "2.5.2 사용자 식별",
        "2.7.2 암호키 관리"
      ],
      "D": [
        2
      ],
      "H": "1.1.1 경영진의 참여"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.1 개인정보 수집·이용",
        "2.9.4 로그 및 접속기록 관리",
        "1.1.2 최고책임자의 지정",
        "2.7.1 암호정책 적용",
        "2.7.2 암호키 관리"
      ],
      "D": [
        3
      ],
      "H": "1.1.2 최고책임자의 지정"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.2.1 주요 직무자 지정 및 관리",
        "3.1.6 영상정보처리기기 설치·운영",
        "1.1.3 조직 구성",
        "2.9.2 성능 및 장애관리",
        "1.2.1 정보자산 식별"
      ],
      "D": [
        3
      ],
      "H": "1.1.3 조직 구성"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "3.5.2 정보주체 권리보장",
        "2.5.5 특수 계정 및 권한 관리",
        "1.1.4 범위 설정",
        "2.6.6 원격접근 통제",
        "3.5.1 개인정보 처리방침 공개"
      ],
      "D": [
        3
      ],
      "H": "1.1.4 범위 설정"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.4 민감정보 및 고유식별정보의 처리 제한",
        "1.1.5 정책 수립",
        "3.3.1 개인정보 제 3자 제공",
        "1.1.4 범위 설정",
        "2.9.6 시간 동기화"
      ],
      "D": [
        2
      ],
      "H": "1.1.5 정책 수립"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.6 자원 할당",
        "2.8.1 보안 요구사항 정의",
        "2.11.5 사고 대응 및 복구",
        "2.9.5 로그 및 접속기록 점검",
        "2.10.3 공개서버 보안"
      ],
      "D": [
        1
      ],
      "H": "1.1.6 자원 할당"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.2 개인정보 수집 제한",
        "2.10.6 업무용 단말기기 보안",
        "2.8.6 운영환경 이관",
        "1.2.1 정보자산 식별",
        "3.5.3 정보주체에 대한 통지"
      ],
      "D": [
        4
      ],
      "H": "1.2.1 정보자산 식별"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.4.6 반출입 기기 통제",
        "2.3.2 외부자 계약 시 보안",
        "1.2.2 현황 및 흐름분석",
        "2.10.9 악성코드 통제",
        "3.1.1 개인정보 수집·이용"
      ],
      "D": [
        3
      ],
      "H": "1.2.2 현황 및 흐름분석"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.3.2 외부자 계약 시 보안",
        "1.3.2 보호대책 공유",
        "2.7.2 암호키 관리",
        "1.2.3 위험 평가",
        "2.8.6 운영환경 이관"
      ],
      "D": [
        4
      ],
      "H": "1.2.3 위험 평가"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.6.4 데이터베이스 접근",
        "1.1.1 경영진의 참여",
        "2.12.1 재해·재난 대비 안전조치",
        "1.2.4 보호대책 선정",
        "1.3.1 보호대책 구현"
      ],
      "D": [
        4
      ],
      "H": "1.2.4 보호대책 선정"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.4.1 보호구역 지정",
        "3.2.2 개인정보 품질보장",
        "3.3.1 개인정보 제 3자 제공",
        "2.8.2 보안 요구사항 검토 및 시험",
        "1.3.1 보호대책 구현"
      ],
      "D": [
        5
      ],
      "H": "1.3.1 보호대책 구현"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.10.3 공개서버 보안",
        "2.5.5 특수 계정 및 권한 관리",
        "3.1.6 영상정보처리기기 설치·운영",
        "1.3.2 보호대책 공유",
        "1.3.1 보호대책 구현"
      ],
      "D": [
        4
      ],
      "H": "1.3.2 보호대책 공유"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.5.2 사용자 식별",
        "3.2.5 가명정보 처리",
        "1.3.3 운영현황 관리",
        "2.1.3 정보자산 관리",
        "3.3.1 개인정보 제 3자 제공"
      ],
      "D": [
        3
      ],
      "H": "1.3.3 운영현황 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.4.1 법적 요구사항 준수 검토",
        "3.5.3 정보주체에 대한 통지",
        "2.10.8 패치관리",
        "2.9.3 백업 및 복구관리",
        "2.1.3 정보자산 관리"
      ],
      "D": [
        1
      ],
      "H": "1.4.1 법적 요구사항 준수 검토"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.2.1 정보자산 식별",
        "2.8.2 보안 요구사항 검토 및 시험",
        "2.8.4 시험 데이터 보안",
        "1.2.4 보호대책 선정",
        "1.4.2 관리체계 점검"
      ],
      "D": [
        5
      ],
      "H": "1.4.2 관리체계 점검"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.4.1 개인정보 파기",
        "1.4.3 관리체계 개선",
        "2.3.2 외부자 계약 시 보안",
        "3.2.3 이용자 단말기 접근 보호",
        "3.3.4 개인정보 국외이전"
      ],
      "D": [
        2
      ],
      "H": "1.4.3 관리체계 개선"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.2.1 정보자산 식별",
        "1.3.1 보호대책 구현",
        "2.1.2 조직의 유지관리",
        "2.1.1 정책의 유지관리",
        "3.5.1 개인정보 처리방침 공개"
      ],
      "D": [
        4
      ],
      "H": "2.1.1 정책의 유지관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.4.5 보호구역 내 작업",
        "1.3.2 보호대책 공유",
        "2.2.3 보안 서약",
        "3.3.1 개인정보 제 3자 제공",
        "2.1.2 조직의 유지관리"
      ],
      "D": [
        5
      ],
      "H": "2.1.2 조직의 유지관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.2.4 보호대책 선정",
        "3.1.6 영상정보처리기기 설치·운영",
        "2.1.3 정보자산 관리",
        "2.10.4 전자거래 및 핀테크 보안",
        "2.3.3 외부자 보안 이행 관리"
      ],
      "D": [
        3
      ],
      "H": "2.1.3 정보자산 관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "3.2.1 개인정보 현황관리",
        "2.2.1 주요 직무자 지정 및 관리",
        "2.6.2 정보시스템 접근",
        "2.3.3 외부자 보안 이행 관리",
        "1.2.2 현황 및 흐름분석"
      ],
      "D": [
        2
      ],
      "H": "2.2.1 주요 직무자 지정 및 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.11.3 이상행위 분석 및 모니터링",
        "2.5.5 특수 계정 및 권한 관리",
        "2.6.2 정보시스템 접근",
        "2.2.2 직무 분리",
        "2.4.4 보호설비 운영"
      ],
      "D": [
        4
      ],
      "H": "2.2.2 직무 분리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.1.2 조직의 유지관리",
        "2.4.3 정보시스템 보호",
        "2.2.3 보안 서약",
        "2.11.3 이상행위 분석 및 모니터링",
        "3.1.2 개인정보 수집 제한"
      ],
      "D": [
        3
      ],
      "H": "2.2.3 보안 서약"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.8.3 시험과 운영 환경 분리",
        "2.2.4 인식제고 및 교육훈련",
        "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "2.8.2 보안 요구사항 검토 및 시험",
        "2.10.4 전자거래 및 핀테크 보안"
      ],
      "D": [
        2
      ],
      "H": "2.2.4 인식제고 및 교육훈련"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.2.5 퇴직 및 직무변경 관리",
        "2.11.4 사고 대응 훈련 및 개선",
        "3.5.3 정보주체에 대한 통지",
        "2.7.1 암호정책 적용",
        "3.2.3 이용자 단말기 접근 보호"
      ],
      "D": [
        1
      ],
      "H": "2.2.5 퇴직 및 직무변경 관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "3.5.1 개인정보 처리방침 공개",
        "2.2.6 보안 위반 시 조치",
        "2.6.3 응용프로그램 접근",
        "1.1.1 경영진의 참여",
        "1.2.4 보호대책 선정"
      ],
      "D": [
        2
      ],
      "H": "2.2.6 보안 위반 시 조치"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.2.6 보안 위반 시 조치",
        "2.12.2 재해 복구 시험 및 개선",
        "3.2.3 이용자 단말기 접근 보호",
        "2.1.2 조직의 유지관리",
        "2.3.1 외부자 현황 관리"
      ],
      "D": [
        5
      ],
      "H": "2.3.1 외부자 현황 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.2 최고책임자의 지정",
        "2.6.4 데이터베이스 접근",
        "2.3.2 외부자 계약 시 보안",
        "3.3.4 개인정보 국외이전",
        "2.12.2 재해 복구 시험 및 개선"
      ],
      "D": [
        3
      ],
      "H": "2.3.2 외부자 계약 시 보안"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.11.2 취약점 점검 및 조치",
        "2.9.1 변경관리",
        "2.7.1 암호정책 적용",
        "2.4.1 보호구역 지정",
        "2.3.3 외부자 보안 이행 관리"
      ],
      "D": [
        5
      ],
      "H": "2.3.3 외부자 보안 이행 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.3.3 영업의 양도 등에 따른 개인정보 이전",
        "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "2.6.4 데이터베이스 접근",
        "2.9.1 변경관리",
        "2.8.1 보안 요구사항 정의"
      ],
      "D": [
        2
      ],
      "H": "2.3.4 외부자 계약 변경 및 만료 시 보안"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.9.5 로그 및 접속기록 점검",
        "2.6.1 네트워크 접근",
        "2.10.5 정보전송 보안",
        "2.4.1 보호구역 지정",
        "2.3.2 외부자 계약 시 보안"
      ],
      "D": [
        4
      ],
      "H": "2.4.1 보호구역 지정"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.2.4 인식제고 및 교육훈련",
        "3.3.4 개인정보 국외이전",
        "3.4.2 처리목적 달성 후 보유시 조치",
        "2.8.6 운영환경 이관",
        "2.4.2 출입통제"
      ],
      "D": [
        5
      ],
      "H": "2.4.2 출입통제"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.4.2 관리체계 점검",
        "2.4.3 정보시스템 보호",
        "2.5.3 사용자 인증",
        "3.2.1 개인정보 현황관리",
        "2.8.3 시험과 운영 환경 분리"
      ],
      "D": [
        2
      ],
      "H": "2.4.3 정보시스템 보호"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.4.3 관리체계 개선",
        "2.8.4 시험 데이터 보안",
        "3.2.1 개인정보 현황관리",
        "2.4.4 보호설비 운영",
        "2.10.3 공개서버 보안"
      ],
      "D": [
        4
      ],
      "H": "2.4.4 보호설비 운영"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.7.1 암호정책 적용",
        "3.2.2 개인정보 품질보장",
        "2.8.3 시험과 운영 환경 분리",
        "2.9.3 백업 및 복구관리",
        "2.4.5 보호구역 내 작업"
      ],
      "D": [
        5
      ],
      "H": "2.4.5 보호구역 내 작업"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.6.6 원격접근 통제",
        "2.11.2 취약점 점검 및 조치",
        "1.4.1 법적 요구사항 준수 검토",
        "2.2.3 보안 서약",
        "2.4.6 반출입 기기 통제"
      ],
      "D": [
        5
      ],
      "H": "2.4.6 반출입 기기 통제"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.6 영상정보처리기기 설치·운영",
        "1.2.2 현황 및 흐름분석",
        "2.4.7 업무환경 보안",
        "2.5.6 접근권한 검토",
        "2.5.1 사용자 계정 관리"
      ],
      "D": [
        3
      ],
      "H": "2.4.7 업무환경 보안"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.12.2 재해 복구 시험 및 개선",
        "3.1.2 개인정보 수집 제한",
        "2.2.4 인식제고 및 교육훈련",
        "2.5.1 사용자 계정 관리",
        "2.11.5 사고 대응 및 복구"
      ],
      "D": [
        4
      ],
      "H": "2.5.1 사용자 계정 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.3.3 영업의 양도 등에 따른 개인정보 이전",
        "2.4.2 출입통제",
        "2.5.3 사용자 인증",
        "2.5.2 사용자 식별",
        "3.5.3 정보주체에 대한 통지"
      ],
      "D": [
        4
      ],
      "H": "2.5.2 사용자 식별"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.3.2 외부자 계약 시 보안",
        "2.6.1 네트워크 접근",
        "2.5.3 사용자 인증",
        "2.5.4 비밀번호 관리",
        "2.6.7 인터넷 접속 통제"
      ],
      "D": [
        3
      ],
      "H": "2.5.3 사용자 인증"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.5.4 비밀번호 관리",
        "2.8.1 보안 요구사항 정의",
        "2.3.3 외부자 보안 이행 관리",
        "2.9.1 변경관리",
        "1.4.1 법적 요구사항 준수 검토"
      ],
      "D": [
        1
      ],
      "H": "2.5.4 비밀번호 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.6.4 데이터베이스 접근",
        "1.1.5 정책 수립",
        "2.10.3 공개서버 보안",
        "2.8.5 소스 프로그램 관리",
        "2.5.5 특수 계정 및 권한 관리"
      ],
      "D": [
        5
      ],
      "H": "2.5.5 특수 계정 및 권한 관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.5.6 접근권한 검토",
        "2.3.2 외부자 계약 시 보안",
        "2.5.1 사용자 계정 관리",
        "2.5.2 사용자 식별",
        "2.11.3 이상행위 분석 및 모니터링"
      ],
      "D": [
        1
      ],
      "H": "2.5.6 접근권한 검토"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.4.2 출입통제",
        "2.6.1 네트워크 접근",
        "2.11.4 사고 대응 훈련 및 개선",
        "2.9.2 성능 및 장애관리",
        "3.3.4 개인정보 국외이전"
      ],
      "D": [
        2
      ],
      "H": "2.6.1 네트워크 접근"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.3.2 보호대책 공유",
        "2.11.1 사고 예방 및 대응체계 구축",
        "1.2.2 현황 및 흐름분석",
        "2.6.2 정보시스템 접근",
        "2.4.7 업무환경 보안"
      ],
      "D": [
        4
      ],
      "H": "2.6.2 정보시스템 접근"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.1.6 자원 할당",
        "2.2.4 인식제고 및 교육훈련",
        "3.2.5 가명정보 처리",
        "2.6.3 응용프로그램 접근",
        "3.1.6 영상정보처리기기 설치·운영"
      ],
      "D": [
        4
      ],
      "H": "2.6.3 응용프로그램 접근"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.1 경영진의 참여",
        "2.6.1 네트워크 접근",
        "1.1.2 최고책임자의 지정",
        "2.6.4 데이터베이스 접근",
        "2.4.7 업무환경 보안"
      ],
      "D": [
        4
      ],
      "H": "2.6.4 데이터베이스 접근"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.6.5 무선 네트워크 접근",
        "2.11.3 이상행위 분석 및 모니터링",
        "2.5.1 사용자 계정 관리",
        "1.3.3 운영현황 관리",
        "2.5.5 특수 계정 및 권한 관리"
      ],
      "D": [
        1
      ],
      "H": "2.6.5 무선 네트워크 접근"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.9.4 로그 및 접속기록 관리",
        "2.2.6 보안 위반 시 조치",
        "3.3.2 개인정보 처리 업무 위탁",
        "2.6.6 원격접근 통제",
        "2.3.2 외부자 계약 시 보안"
      ],
      "D": [
        4
      ],
      "H": "2.6.6 원격접근 통제"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.2.5 퇴직 및 직무변경 관리",
        "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "2.6.3 응용프로그램 접근",
        "3.2.2 개인정보 품질보장",
        "2.6.7 인터넷 접속 통제"
      ],
      "D": [
        5
      ],
      "H": "2.6.7 인터넷 접속 통제"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.7.1 암호정책 적용",
        "2.5.1 사용자 계정 관리",
        "3.5.1 개인정보 처리방침 공개",
        "3.2.4 개인정보 목적 외 이용 및 제공",
        "3.1.2 개인정보 수집 제한"
      ],
      "D": [
        1
      ],
      "H": "2.7.1 암호정책 적용"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.7.2 암호키 관리",
        "2.1.3 정보자산 관리",
        "2.9.4 로그 및 접속기록 관리",
        "2.10.2 클라우드 보안",
        "1.2.1 정보자산 식별"
      ],
      "D": [
        1
      ],
      "H": "2.7.2 암호키 관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.8.1 보안 요구사항 정의",
        "2.7.2 암호키 관리",
        "2.11.2 취약점 점검 및 조치",
        "2.5.4 비밀번호 관리",
        "2.10.3 공개서버 보안"
      ],
      "D": [
        1
      ],
      "H": "2.8.1 보안 요구사항 정의"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.8.2 보안 요구사항 검토 및 시험",
        "2.4.5 보호구역 내 작업",
        "2.2.6 보안 위반 시 조치",
        "1.2.2 현황 및 흐름분석",
        "3.3.3 영업의 양도 등에 따른 개인정보 이전"
      ],
      "D": [
        1
      ],
      "H": "2.8.2 보안 요구사항 검토 및 시험"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.8.3 시험과 운영 환경 분리",
        "2.5.3 사용자 인증",
        "2.8.4 시험 데이터 보안",
        "2.9.2 성능 및 장애관리",
        "2.7.1 암호정책 적용"
      ],
      "D": [
        1
      ],
      "H": "2.8.3 시험과 운영 환경 분리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.1.3 정보자산 관리",
        "2.8.6 운영환경 이관",
        "2.8.4 시험 데이터 보안",
        "2.11.1 사고 예방 및 대응체계 구축",
        "2.9.3 백업 및 복구관리"
      ],
      "D": [
        3
      ],
      "H": "2.8.4 시험 데이터 보안"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.8.5 소스 프로그램 관리",
        "2.4.6 반출입 기기 통제",
        "2.4.5 보호구역 내 작업",
        "2.1.2 조직의 유지관리",
        "2.8.2 보안 요구사항 검토 및 시험"
      ],
      "D": [
        1
      ],
      "H": "2.8.5 소스 프로그램 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.8.6 운영환경 이관",
        "2.4.4 보호설비 운영",
        "3.2.4 개인정보 목적 외 이용 및 제공",
        "2.4.3 정보시스템 보호",
        "2.1.2 조직의 유지관리"
      ],
      "D": [
        1
      ],
      "H": "2.8.6 운영환경 이관"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.9.1 변경관리",
        "1.2.1 정보자산 식별",
        "2.4.1 보호구역 지정",
        "2.12.2 재해 복구 시험 및 개선",
        "2.2.4 인식제고 및 교육훈련"
      ],
      "D": [
        1
      ],
      "H": "2.9.1 변경관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.9.2 성능 및 장애관리",
        "2.4.3 정보시스템 보호",
        "3.2.4 개인정보 목적 외 이용 및 제공",
        "2.2.6 보안 위반 시 조치",
        "3.5.2 정보주체 권리보장"
      ],
      "D": [
        1
      ],
      "H": "2.9.2 성능 및 장애관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.6.7 인터넷 접속 통제",
        "3.1.6 영상정보처리기기 설치·운영",
        "2.5.5 특수 계정 및 권한 관리",
        "2.9.3 백업 및 복구관리",
        "1.1.2 최고책임자의 지정"
      ],
      "D": [
        4
      ],
      "H": "2.9.3 백업 및 복구관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.9.4 로그 및 접속기록 관리",
        "2.2.1 주요 직무자 지정 및 관리",
        "3.2.4 개인정보 목적 외 이용 및 제공",
        "1.4.2 관리체계 점검",
        "2.5.6 접근권한 검토"
      ],
      "D": [
        1
      ],
      "H": "2.9.4 로그 및 접속기록 관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.4 민감정보 및 고유식별정보의 처리 제한",
        "2.4.6 반출입 기기 통제",
        "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "3.1.2 개인정보 수집 제한",
        "2.9.5 로그 및 접속기록 점검"
      ],
      "D": [
        5
      ],
      "H": "2.9.5 로그 및 접속기록 점검"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.7 마케팅 목적의 개인정보 수집·운영",
        "1.1.1 경영진의 참여",
        "2.9.6 시간 동기화",
        "2.8.2 보안 요구사항 검토 및 시험",
        "2.10.7 보조저장매체 관리"
      ],
      "D": [
        3
      ],
      "H": "2.9.6 시간 동기화"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.5.1 개인정보 처리방침 공개",
        "3.1.6 영상정보처리기기 설치·운영",
        "2.4.3 정보시스템 보호",
        "2.9.6 시간 동기화",
        "2.9.7 정보자산의 재사용 및 폐기"
      ],
      "D": [
        5
      ],
      "H": "2.9.7 정보자산의 재사용 및 폐기"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.2 최고책임자의 지정",
        "2.10.1 보안시스템 운영",
        "2.6.4 데이터베이스 접근",
        "2.10.4 전자거래 및 핀테크 보안",
        "3.4.2 처리목적 달성 후 보유시 조치"
      ],
      "D": [
        2
      ],
      "H": "2.10.1 보안시스템 운영"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.7.2 암호키 관리",
        "1.2.1 정보자산 식별",
        "2.10.2 클라우드 보안",
        "3.1.4 민감정보 및 고유식별정보의 처리 제한",
        "2.11.2 취약점 점검 및 조치"
      ],
      "D": [
        3
      ],
      "H": "2.10.2 클라우드 보안"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.2.1 정보자산 식별",
        "2.10.3 공개서버 보안",
        "1.3.1 보호대책 구현",
        "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "3.2.4 개인정보 목적 외 이용 및 제공"
      ],
      "D": [
        2
      ],
      "H": "2.10.3 공개서버 보안"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.9.4 로그 및 접속기록 관리",
        "2.8.3 시험과 운영 환경 분리",
        "1.1.4 범위 설정",
        "1.1.3 조직 구성",
        "2.10.4 전자거래 및 핀테크 보안"
      ],
      "D": [
        5
      ],
      "H": "2.10.4 전자거래 및 핀테크 보안"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.2.5 퇴직 및 직무변경 관리",
        "1.4.1 법적 요구사항 준수 검토",
        "2.8.2 보안 요구사항 검토 및 시험",
        "2.3.4 외부자 계약 변경 및 만료 시 보안",
        "2.10.5 정보전송 보안"
      ],
      "D": [
        5
      ],
      "H": "2.10.5 정보전송 보안"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.6.1 네트워크 접근",
        "3.2.2 개인정보 품질보장",
        "2.10.6 업무용 단말기기 보안",
        "3.5.2 정보주체 권리보장",
        "2.8.6 운영환경 이관"
      ],
      "D": [
        3
      ],
      "H": "2.10.6 업무용 단말기기 보안"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.4 범위 설정",
        "2.10.7 보조저장매체 관리",
        "3.1.4 민감정보 및 고유식별정보의 처리 제한",
        "2.12.1 재해·재난 대비 안전조치",
        "2.2.1 주요 직무자 지정 및 관리"
      ],
      "D": [
        2
      ],
      "H": "2.10.7 보조저장매체 관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.10.8 패치관리",
        "2.10.4 전자거래 및 핀테크 보안",
        "2.3.1 외부자 현황 관리",
        "1.4.1 법적 요구사항 준수 검토",
        "2.1.3 정보자산 관리"
      ],
      "D": [
        1
      ],
      "H": "2.10.8 패치관리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.1 경영진의 참여",
        "2.4.7 업무환경 보안",
        "2.7.2 암호키 관리",
        "2.8.2 보안 요구사항 검토 및 시험",
        "2.10.9 악성코드 통제"
      ],
      "D": [
        5
      ],
      "H": "2.10.9 악성코드 통제"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.11.1 사고 예방 및 대응체계 구축",
        "3.3.2 개인정보 처리 업무 위탁",
        "2.9.3 백업 및 복구관리",
        "2.10.6 업무용 단말기기 보안",
        "2.4.6 반출입 기기 통제"
      ],
      "D": [
        1
      ],
      "H": "2.11.1 사고 예방 및 대응체계 구축"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.7.2 암호키 관리",
        "3.2.5 가명정보 처리",
        "2.11.2 취약점 점검 및 조치",
        "2.5.6 접근권한 검토",
        "2.8.2 보안 요구사항 검토 및 시험"
      ],
      "D": [
        3
      ],
      "H": "2.11.2 취약점 점검 및 조치"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.11.3 이상행위 분석 및 모니터링",
        "3.5.3 정보주체에 대한 통지",
        "1.1.2 최고책임자의 지정",
        "2.8.4 시험 데이터 보안",
        "2.4.6 반출입 기기 통제"
      ],
      "D": [
        1
      ],
      "H": "2.11.3 이상행위 분석 및 모니터링"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.2.3 이용자 단말기 접근 보호",
        "2.1.3 정보자산 관리",
        "2.11.4 사고 대응 훈련 및 개선",
        "2.3.3 외부자 보안 이행 관리",
        "1.3.3 운영현황 관리"
      ],
      "D": [
        3
      ],
      "H": "2.11.4 사고 대응 훈련 및 개선"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.4.2 관리체계 점검",
        "2.7.1 암호정책 적용",
        "2.9.6 시간 동기화",
        "1.4.3 관리체계 개선",
        "2.11.5 사고 대응 및 복구"
      ],
      "D": [
        5
      ],
      "H": "2.11.5 사고 대응 및 복구"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "3.2.3 이용자 단말기 접근 보호",
        "3.4.1 개인정보 파기",
        "2.12.1 재해·재난 대비 안전조치",
        "3.3.2 개인정보 처리 업무 위탁",
        "2.9.2 성능 및 장애관리"
      ],
      "D": [
        3
      ],
      "H": "2.12.1 재해·재난 대비 안전조치"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.12.2 재해 복구 시험 및 개선",
        "2.11.2 취약점 점검 및 조치",
        "2.4.6 반출입 기기 통제",
        "1.3.1 보호대책 구현",
        "2.10.9 악성코드 통제"
      ],
      "D": [
        1
      ],
      "H": "2.12.2 재해 복구 시험 및 개선"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.4.6 반출입 기기 통제",
        "3.1.1 개인정보 수집·이용",
        "3.2.3 이용자 단말기 접근 보호",
        "2.11.5 사고 대응 및 복구",
        "3.2.5 가명정보 처리"
      ],
      "D": [
        2
      ],
      "H": "3.1.1 개인정보 수집·이용"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.8.3 시험과 운영 환경 분리",
        "2.8.5 소스 프로그램 관리",
        "3.1.2 개인정보 수집 제한",
        "3.2.1 개인정보 현황관리",
        "3.2.2 개인정보 품질보장"
      ],
      "D": [
        3
      ],
      "H": "3.1.2 개인정보 수집 제한"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.2.1 정보자산 식별",
        "3.1.3 주민등록번호 처리 제한",
        "2.2.6 보안 위반 시 조치",
        "2.11.3 이상행위 분석 및 모니터링",
        "3.4.2 처리목적 달성 후 보유시 조치"
      ],
      "D": [
        2
      ],
      "H": "3.1.3 주민등록번호 처리 제한"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.9.6 시간 동기화",
        "3.5.2 정보주체 권리보장",
        "3.5.3 정보주체에 대한 통지",
        "3.1.4 민감정보 및 고유식별정보의 처리 제한",
        "1.4.3 관리체계 개선"
      ],
      "D": [
        4
      ],
      "H": "3.1.4 민감정보 및 고유식별정보의 처리 제한"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.1.5 개인정보 간접수집",
        "2.4.5 보호구역 내 작업",
        "3.3.4 개인정보 국외이전",
        "2.5.5 특수 계정 및 권한 관리",
        "3.5.2 정보주체 권리보장"
      ],
      "D": [
        1
      ],
      "H": "3.1.5 개인정보 간접수집"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.2.5 퇴직 및 직무변경 관리",
        "2.10.3 공개서버 보안",
        "2.12.2 재해 복구 시험 및 개선",
        "3.1.6 영상정보처리기기 설치·운영",
        "2.9.1 변경관리"
      ],
      "D": [
        4
      ],
      "H": "3.1.6 영상정보처리기기 설치·운영"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.11.1 사고 예방 및 대응체계 구축",
        "3.1.7 마케팅 목적의 개인정보 수집·운영",
        "1.1.1 경영진의 참여",
        "2.10.1 보안시스템 운영",
        "2.2.6 보안 위반 시 조치"
      ],
      "D": [
        2
      ],
      "H": "3.1.7 마케팅 목적의 개인정보 수집·운영"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "3.2.2 개인정보 품질보장",
        "2.10.4 전자거래 및 핀테크 보안",
        "3.3.4 개인정보 국외이전",
        "3.2.1 개인정보 현황관리",
        "2.9.3 백업 및 복구관리"
      ],
      "D": [
        4
      ],
      "H": "3.2.1 개인정보 현황관리"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "1.2.1 정보자산 식별",
        "2.10.6 업무용 단말기기 보안",
        "3.2.2 개인정보 품질보장",
        "3.2.3 이용자 단말기 접근 보호",
        "2.2.5 퇴직 및 직무변경 관리"
      ],
      "D": [
        3
      ],
      "H": "3.2.2 개인정보 품질보장"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.2 최고책임자의 지정",
        "3.4.1 개인정보 파기",
        "2.1.3 정보자산 관리",
        "3.5.1 개인정보 처리방침 공개",
        "3.2.3 이용자 단말기 접근 보호"
      ],
      "D": [
        5
      ],
      "H": "3.2.3 이용자 단말기 접근 보호"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.9.1 변경관리",
        "2.10.5 정보전송 보안",
        "2.4.5 보호구역 내 작업",
        "2.2.5 퇴직 및 직무변경 관리",
        "3.2.4 개인정보 목적 외 이용 및 제공"
      ],
      "D": [
        5
      ],
      "H": "3.2.4 개인정보 목적 외 이용 및 제공"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.2.3 위험 평가",
        "3.2.5 가명정보 처리",
        "2.10.5 정보전송 보안",
        "3.5.1 개인정보 처리방침 공개",
        "2.6.4 데이터베이스 접근"
      ],
      "D": [
        2
      ],
      "H": "3.2.5 가명정보 처리"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.1.2 조직의 유지관리",
        "3.2.5 가명정보 처리",
        "3.3.1 개인정보 제 3자 제공",
        "3.4.2 처리목적 달성 후 보유시 조치",
        "1.3.2 보호대책 공유"
      ],
      "D": [
        3
      ],
      "H": "3.3.1 개인정보 제 3자 제공"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.9.1 변경관리",
        "2.9.2 성능 및 장애관리",
        "3.3.2 개인정보 처리 업무 위탁",
        "2.8.1 보안 요구사항 정의",
        "2.1.2 조직의 유지관리"
      ],
      "D": [
        3
      ],
      "H": "3.3.2 개인정보 처리 업무 위탁"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.8.4 시험 데이터 보안",
        "2.9.1 변경관리",
        "3.3.3 영업의 양도 등에 따른 개인정보 이전",
        "3.4.1 개인정보 파기",
        "2.10.2 클라우드 보안"
      ],
      "D": [
        3
      ],
      "H": "3.3.3 영업의 양도 등에 따른 개인정보 이전"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.5.1 사용자 계정 관리",
        "3.3.4 개인정보 국외이전",
        "2.9.3 백업 및 복구관리",
        "2.1.3 정보자산 관리",
        "2.9.1 변경관리"
      ],
      "D": [
        2
      ],
      "H": "3.3.4 개인정보 국외이전"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "2.6.3 응용프로그램 접근",
        "1.3.1 보호대책 구현",
        "3.4.1 개인정보 파기",
        "2.11.3 이상행위 분석 및 모니터링",
        "3.2.2 개인정보 품질보장"
      ],
      "D": [
        3
      ],
      "H": "3.4.1 개인정보 파기"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "3.4.2 처리목적 달성 후 보유시 조치",
        "1.2.4 보호대책 선정",
        "3.1.6 영상정보처리기기 설치·운영",
        "3.1.7 마케팅 목적의 개인정보 수집·운영",
        "2.11.5 사고 대응 및 복구"
      ],
      "D": [
        1
      ],
      "H": "3.4.2 처리목적 달성 후 보유시 조치"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "2.5.4 비밀번호 관리",
        "3.5.1 개인정보 처리방침 공개",
        "2.1.3 정보자산 관리",
        "2.4.5 보호구역 내 작업",
        "2.8.1 보안 요구사항 정의"
      ],
      "D": [
        2
      ],
      "H": "3.5.1 개인정보 처리방침 공개"
    },
    {
      "m": "* 사례 1: 다른 예시 결함 사례 1\n\n* 사례 2: 다른 예시 결함 사례 2",
      "v": [
        "3.5.1 개인정보 처리방침 공개",
        "2.6.2 정보시스템 접근",
        "2.7.1 암호정책 적용",
        "2.5.5 특수 계정 및 권한 관리",
        "3.5.2 정보주체 권리보장"
      ],
      "D": [
        5
      ],
      "H": "3.5.2 정보주체 권리보장"
    },
    {
      "m": "* 사례 1: 예시 결함 사례 1\n\n* 사례 2: 예시 결함 사례 2",
      "v": [
        "1.1.3 조직 구성",
        "2.10.8 패치관리",
        "2.9.6 시간 동기화",
        "3.5.3 정보주체에 대한 통지",
        "2.8.4 시험 데이터 보안"
      ],
      "D": [
        4
      ],
      "H": "3.5.3 정보주체에 대한 통지"
    }
  ]
}
