var gvMoon = {l:[
    {
      "m": "IBK평생한가족통장의 가장 높은 우대 금리는 연 몇 퍼센트 포인트(p)까지 가능한가요?",
      "v": [
        "연 0.10%p",
        "연 0.20%p",
        "연 0.30%p",
        "연 0.40%p"
      ],
      "d": [4],
      "h": ""
    },
    {
      "m": "이 통장의 우대 금리를 받기 위해 충족해야 하는 조건 중 하나가 아닌 것은 무엇인가요?",
      "v": [
        "월 50만원 이상의 급여이체 실적",
        "주택구입",
        "신용카드 월 30만원 이상 사용",
        "월 10만원 이상 적립식 상품 자동이체 실적"
      ],
      "d": [2],
      "h": ""
    },
    {
      "m": "당행에 실명등록한 날로부터 몇 년이 지난 고객에게 우대 금리의 혜택이 주어집니다?",
      "v": [
        "1년",
        "2년",
        "3년",
        "4년"
      ],
      "d": [3],
      "h": ""
    },
    {
      "m": "IBK평생한가족통장에 가입할 수 있는 최소 월 적립금액은 얼마인가요?",
      "v": [
        "5천원",
        "1만원",
        "5만원",
        "10만원"
      ],
      "d": [2],
      "h": ""
    },
    {
      "m": "다음 중 IBK평생한가족통장의 계약 기간 옵션이 아닌 것은 무엇인가요?",
      "v": [
        "6개월",
        "1년",
        "2년",
        "3년"
      ],
      "d": [1],
      "h": ""
    },
    {
      "m": "IBK평생한가족통장의 만기 후 이자율은 어떻게 적용됩니까?",
      "v": [
        "만기일 당시 계약기간별 고시금리의 100%",
        "만기일 당시 계약기간별 고시금리의 50%",
        "만기일 당시 계약기간별 고시금리의 20%",
        "만기일 당시 계약기간별 고시금리의 10%"
      ],
      "d": [2],
      "h": ""
    }
]}