var gvMoon = {l:[
{
// ㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊㅋㅌㅍㅎ
// ㉠㉡㉢㉣㉤㉥㉦㉧㉨㉩㉪㉫㉬㉭
m : "다음 중 개인정보의 정의에 대한 설명으로 옳지 않은 것은?" ,
v : [ "특정한 개인을 알아볼 수 있는 부호·문자·음성·음향 및 영상 등의 정보이다.",
      "현재 법인으로 등록된 기업 소유자, 내부 직원 및 사망한 개인에 관한 정보이다. 이름, 주민등록번호, 이메일 연락처 등에 해당된다.",
      "해당 정보만으로는 특정 개인을 알아볼 수 없더라도 다른 정보와 쉽게 결합하여 알아볼 수 있는 것을 포함한다.",
      "\"정보 주체\"란 처리되는 정보에 의하여 알아볼 수 있는 사람으로서 그 정보의 주체가 되는 사람을 말한다."],
d : [2],
h : "개인정보란 살아 있는 개인에 관한 정보만을 말하며, 법인 등의 단체 정보는 개인정보에 해당하지 않는다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 정보 유출 시 개인정보라고 판단하기 가장 어려운 것은?\n"
+"* ㉠ 홍길동(이름) + 서울시 서초구 서초대로 130번지 12호(상세 주소)\n"
+"* ㉡ 전우치(이름) + chunwoochi@email.com(이메일)\n"
+"* ㉢ user21000T5959(내부 고객번호) + peterKim(아이디)\n"
+"* ㉣ OID1004-007(주문번호) + mobileNO7(상품코드) + ********(비밀번호)\n"
+"* ㉤ 이순신(이름) + 010-0000-1234(전화번호)",
v : [ "㉠","㉡","㉢","㉣","㉤"],
d : [3],
h : "내부 고객번호는 개인에게 할당된 정보가 아니고, 아이디와 결합하여 개인임을 식별하기 어려우며, 외부에서 고객번호로 개인정보를 조회하지 않도록 하기 때문에 개인정보로 보기 어렵다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 Safe-Harbor 7원칙의 요소로 묶인 것 중 잘못된 것은?",
v : [ "고지, 동의",
      "선택, 이행",
      "제공, 선택",
      "안전성, 제공",
      "무결성, 제공"],
d : [1],
h : "Sale-Harbor의 7원칙에는 고지(Notice), 선택(Choice), 제공 (Orward Transler), 접근(Access), 안전성(Security), 데이터 무결성(Data integration), 이행(Eniorcement)이 있다. 그러므로 동의는 Safe-Harbor의 7원칙에 해당하지 않는다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음의 정보가 서로 연계되었을 때 개인정보로 맞게 연결된 것은?\n"
+ "| | | |\n|---|---|---|\n"
+ "|㉠|소득 정보|급여, 직장 경력, 소득세 신고 정보, 연봉 및 보너스 정보|\n"
+ "|㉡|법적 정보|전과 기록, 결혼 및 이혼 내역|\n"
+ "|㉢|고용 정보|상사 이름, 인사 고과 정보, 근태 기록|\n"
+ "|㉣|신용 정보|보험 계약 정보, 계좌번호, 대출 정보|\n"
+ "|㉤|통신 정보|쿠키 정보, 아이피 정보, 상담 녹취 정보, 로그 파일|",
v : [ "㉠, ㉡, ㉣, ㉤",
      "㉠, ㉡, ㉢, ㉤",
      "㉠, ㉢, ㉣, ㉤",
      "㉠, ㉡, ㉢, ㉣",
      "㉠, ㉡, ㉢, ㉣, ㉤"],
d : [5],
h : "소득 정보, 법적 정보, 고용 정보, 신용 정보, 통신 정보도 개인을 식별할 수 있기 때문에 개인정보에 해당한다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 전문가 패널에 의존하는 질문자와 전문가 사이의 상호 작용에 의한 개인정보 가치산정의 예측 기법은?",
v : [ "델파이 기법",
      "CVM(설문 조사 기법)",
      "Matrix 기법(시나리오별 항목 도출 방법)",
      "산정된 손해 배상액에 대한 위험 평가",
      "회귀 분석 기법(인과 관계 분석)"],
d : [1],
h : "델파이 기법은 전문가의 경험적 지식을 통해 문제 해결이나 미래 예측을 하는 방법으로 전문가 합의법이라고도 한다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음의 개인정보에 대한 유형 중 틀린 것을 고르시오.\n"
+ "* ㉠ 그 가족 구성원의 신상 정보, 공공 개방형 데이터\n"
+ "* ㉡ 법인의 소유자명, 고용 정보\n"
+ "* ㉢ 동문회 정보, 까페 회원 정보\n"
+ "* ㉣ 의료 정보, 신체 정보\n"
+ "* ㉤ 회사 대표 번호, 통계 수치 정보",
v : [ "㉠,㉡",
      "㉠,㉢",
      "㉠,㉤",
      "㉡,㉢",
      "㉡,㉤" ],
d : [5],
h : "법인 소유자 정보는 홈페이지 등에 공개되어 있기 때문에 개인정보로 보기 어려우며, 통계 정보(수치값)는 보통 개인을 식별할 수 없는 값으로 그룹화된 전체 정보(합계, 비율 등)를 나타내므로 개인정보가 아니다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음은 회사의 업종과 이에 가장 우선적으로 적용되는 개인정보보호 또는 정보보호에 관련한 법률을 나열한 것이다. 이중 틀리게 짝지어진 것은? \n"
+"||개인정보보호법|정보통신망법|전자금융거래법|정보통신기반보호법|의료법|\n"
+"|---|:---:|:---:|:---:|:---:|:---:|\n"
+"|㉠ 호텔|O|||||\n"
+"|㉡ 증권사|O||O|||\n"
+"|㉢ 사이버 대학|O|||||\n"
+"|㉣ 인터넷 포털|O|O||||\n"
+"|㉤ 동사무소|O|||||\n"
+"|㉥ 방송통신대학교||O||||\n"
+"|㉦ 학원|O|||||\n"
+"|㉧ 인터넷데이터센터(IDC/ICC)||O||O||\n"
+"|㉨ 온라인 중고용품 거래 장터||O|O|||\n"
+"|㉩ 정형외과|O||||O|",
v : [ "㉠,㉢",
      "㉢,㉦",
      "㉢,㉣",
      "㉥,㉨",
      "㉥,㉩" ],
d : [4],
h : "개인정보를 처리하는 경우, 모든 사업자는 개인정보보호법의 적용을 받는다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 미국에서 제정된 연방법으로 환자 정보를 보호하려는 목적으로 제정된 법률은?",
v : [ "ePiracy Directive",
      "Sarbanes-Oxley Act(SOA)",
      "Safety Phrases",
      "Data Protection Act(DPA)",
      "HIPPA" ],
d : [5],
h : "HIPPA(Heath nguance Porteoity and Accontoy Ad)는 2007년도에 만들어진 미국의 연방법으로 의료 보험의 이동성과 신뢰성에 관한 법률을 통해 환자 정보를 보호하려는 목적으로 법이 제정되었다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보의 침해 유형으로 보기 어려운 것은?\n"
+"* ㉠ A사의 개인정보취급자 Peter는 퇴근 시간 이후 자사의 개인정보처리시스템에 본인 계정으로 접속하여 대량의 고객 정보를 조회하였다.\n"
+"* ㉡ B사는 내부 DB 서버를 해외로 이전하기로 하였으나 고객들에게 별도의 고지나 동의 없이 해외 이전을 진행하였다.\n"
+"* ㉢ C사는 T1 서비스를 위해 수집한 개인정보를 가공하여 T2 서비스를 위한 마케팅 및 광고메일로 활용하고 있다.\n"
+"* ㉣ D사는 회사의 서비스와 관련하여 수집했던 개인정보를 서비스 완료 후 별도의 파기 정책을 수립하지 않고, 10년째 파기 관련 수행 업무를 이행하지 않고 있으며, 관련 자료는 백업 서버에 보관하고  있었다.\n"
+"* ㉤ E사의 총무팀 직원 Mark는 업무상 현업에서 요청한 개인정보를 승인을 통해 추출하고, 이 데이터를 내부 망에서만 볼 수 있도록 하기 위해 현업 담당자의 사내 전용 이메일과 사내 전용 메신저 및 사내 웹 하드 등 다양한 경로를 통해 전달하였다.\n"
+"* ㉥ 소셜 네트워크 업체인 S사는 해당 서비스를 위해 회원 가입 시 이름, 아이디, 비밀번호, 연락처, 가입되어 있는 타사 SNS ID를 수집하고 있다.",
v : [ "㉠,㉢",
      "㉠,㉤",
      "㉡,㉢",
      "㉡,㉣",
      "㉤,㉥" ],
d : [5],
h : "개인정보취급자가 내부 고객 정보를 조회하는 것은 침해 유형이 아니며, 적절한 권한이 부여되고 모니터링 되고 있는지에 쟁점이 있을 수 있다. 또한, 개인정보를 승인한 후 타부서에 전달할 경우 다른 경로로 전송한 것이 문제가 될 수는 없으나 추후 전송 수단에 따른 파기 및 보안 관리에 대한 어려움이 있을 수 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보 유출로 인한 추가 침해 유형으로 보기 어려운 것은?",
v : [ "다음의 Nduoa 앱을 통한 이메일 거래",
      "전화(ARS)를 통한 회원 정보 요청",
      "모바일(앱) 회원 가입",
      "스미싱 문자를 활용한 악성 URL, 유포",
      "인터넷 뱅킹 PC 지정 서비스 해지" ],
d : [5],
h : "해당 내용은 인터넷 뱅킹의 PC 지정 서비스 해지에 관한 것으로 개인정보의 직접적인 유출과는 관계가 적다고 볼 수 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보의 침해 원인으로 보기 가장 어려운 것은?",
v : [ "개인정보에 대한 인식 부족",
      "개인정보의 관리적 기준 미흡",
      "DB 서버에 대한 기술적 보호 조치 미흡",
      "내부 부서의 과도한 개인정보 요청",
      "내부 직원에 대한 교육 미흡" ],
d : [4],
h : "업무상 부서간의 개인정보 요청은 직접적인 침해 원인이 아니다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보의 침해 유형으로 그 성격이 다른 것은?",
v : [ "고객의 동의 없는 무분별한 정보 수집",
      "서비스의 목적을 넘어서는 과도한 정보 수집",
      "불법적인 유통 경로를 통한 개인정보 수집",
      "개인정보의 기술적 보호 조치 미흡으로 인한 정보 유출",
      "목적 외 불필요한 고유 식별 정보(주민번호 등)의 수집" ],
d : [4],
h : "다른 사항은 모두 수집시의 문제로 인한 침해 유형이며, 기술적 보호 조치 미흡으로 인한 경우는 저장 및 이용, 제공 시 발생할 수 있는 보호 조치 미흡으로 발생한 것에 해당한다. 예를 들어 비밀번호를 암호화 처리 없이 저장해 놓은 경우가 될 수 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보를 보호해야 하는 필요성으로 가장 적절하지 않은 것은?",
v : [ "기업 이미지 + 고객 매출",
      "손해배상 + 징벌적 과징금",
      "글로벌 기업회원 + 국가 간 법적 분쟁",
      "회원 정보 분석 + 마케팅 & 정보재활용",
      "경쟁사 관계 + 회원 이탈" ],
d : [4],
h : "회원정보 분석 및 마케팅은 기업의 매출을 올리기 위한 영업 전략 등의 성격에 해당되며, 개인정보보호와 직접적인 관련이 없다. 또한, 정보재활용은 개인정보보호법의 목적 외 수집에 어긋난다고 볼 수 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보보호 책임자로 적합하지 않은 사람은?",
v : [ "최고 경영자(CEO) 또는 CISO",
      "개인정보보호에 소양이 있는 자",
      "정보보호 처리 부서의 장",
      "개인사업자의 대표자",
      "개인정보처리시스템의 계정 발급 담당자"],
d : [5],
h : "개인정보처리시스템의 계정 발급 담당자는 보통 개인정보취급자로 구분되며, 경우에 따라 외주 직원이 담당할 수 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보보호 조직에 대한 설명에서 적절하지 않은 것은?",
v : [ "개인정보보호 담당자는 겸직이 가능하나 전담 조직을 구성하는 것이 바람직하다.",
      "개인정보보호 담당 부서는 개인정보책임자(CPO) 아래 직속 부서로 구성하는 것이 효과적이다.",
      "최고 경영자(CEO)는 개인정보책임자(CPO)와 정보보호 최고책임자(CISO)에게 개인정보보호에 대한 권한을 위임하고 그 책임을 전가할 수 있다.",
      "개인정보보호 부서는 효율적인 관리를 위해 관련 부서별 개인정보취급자를 지정하고, 부서별 분임 개인정보보호 담당자를 지정하여 업무 부하를 줄이면서 보다 효율적인 개인정보보호를 할 수 있다.",
      "개인영상정보보호 책임자는 개인정보보호 책임자가 겸직할 수 있다."],
d : [3],
h : "개인정보의 관리 및 유출에 대한 법적인 최종 책임은 최고 경영자(CEO)에게 귀속된다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 개인정보보호법에 따른 개인정보 책임자의 지정에 관한 설명 중 틀린 것은?",
v : [ "상시 종업원이 5명 미만인 소규모 사업자도 개인정보보호 책임자를 지정하여야 한다.",
      "1인 사업자의 경우에는 대표자가 개인정보보호 책임자가 된다.",
      "법령은 회사의 대표 또는 정보보호 처리 부서의 장 또는 개인정보보호에 소양 있는 자 중에서 개인정보보호 책임자가 되도록 규정하고 있으므로 사업자는 반드시 이러한 요건을 충족하는 자를 개인정보보호 책임자로 지정해야 한다.",
      "개인정보보호 책임자의 성명 및 직통 연락처를 개인정보처리 방침에 기재하되 실무를 맡고 있는 개인정보취급자의 성명 및 연락처를 기재하여도 된다.",
      "회원 가입, 탈퇴 처리, 고충 처리 및 개인정보의 수집·보관·처리·이용·제공·관리·파기 등에 관한 업무를 담당하는 자를 말한다."],
d : [5],
h : "__5__번은 개인정보 취급자에 해당하는 업무를 말한다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음과 같이 특정 다수의 수신자와 참조자가 포함된 이메일 발송을 통하여 PC를 감염시키기 위한 공격 방법으로 가장 적절한 것은?\n"
+"||||\n"
+"|---|---|---|\n"
+"|보낸 사람|000@naver.com|\n"
+"|받는 사람|x01@hotmail.com; x02@hotmail.com; x03@hotmail.com; x04@hotmail.com; x05@hotmail.com; x06@hotmail.com|\n"
+"|참조|yo1@daum.net; yo2@daum.net; yo3@daum.net; y04@daum.net; y05@daum.net|\n"
+"\n"
+"|||\n"
+"|---|---|\n"
+"|제목|2016 IT 첨단 기기 전시회 개최 안내|\n"
+"|첨부 파일|전시회 - 아젠다.pdf.exe(1.5M)<br>부스별 전시 브로셔.pdf(2M)|\n"
+"\n"
+"* 안녕하세요. 담당자님!\n"
+"* 귀사의 일익 번창하심을 진심으로 기원합니다. 이번 코엑스에서의 IT 기기 및 정보화시스템 전시회에 귀 기관의 담당자님을 초대하오니 자리를 빛내주시면 감사하겠습니다.\n"
+"* 올해로 00번째로 맞이하는 전시회는 국내 최대 규모를 자랑하고 있는 전시회로써 귀사에 최적의 솔루션과 IT 인프라 구축에 대한 방향을 제시해 줄 수 있는 소중한 자리가 될 것임을 자부합니다.(중략)\n"
+"* oo 협회장 배상\n",
v : [ "보이스 피싱",
      "스피어 피싱",
      "파밍 공격",
      "스팸 메일 공격",
      "단축 URL 전송"],
d : [2],
h : "스피어 피싱(Spear Phishing)이란 조직 내부에서 신뢰할 만한 발신인으로 위장하여 ID 및 PW 정보를 요구하는 공격 기법이다. 특정 대상을 타깃으로 메일을 보내 가짜 사이트로 유도하여 악성 코드를 설치하게 하거나 ID와 PW를 입력하게 하여 네트워크에 침입할 수 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보취급자에 대한 설명으로 옳지 않은 것은?",
v : [ "개인정보취급자라 함은 이용자의 개인정보를 처리하는 자를 말한다.",
      "회원 가입, 탈퇴 처리, 고충 처리 등과 같이 개인정보보호 업무를 직접 담당하는 직원과 그 외에 업무상 필요에 의해 개인정보를 수집·보관·처리·이용·제공·관리·파기 등의 업무를 하는 자가 모두 포함된다.",
      "아르바이트 등 임시직 직원도 업무상 필요에 의해 개인정보를 열람 및 처리하고 있다면 개인정보취급자에 해당된다.",
      "개인정보의 열람 및 처리 범위를 업무상 필요한 한도 내에서 최소한으로 제한해야 하며, 보안 서약서를 징구하는 등 필요한 관리 조치를 취하여야 한다.",
      "상시 종업원이 5명 미만인 소규모 사업자는 개인정보보호취급자를 별도로 지정하지 않아도 된다."],
d : [5],
h : "상시 종업원이 5명 미만이라 하더라도 개인정보보호 책임자와 취급자를 지정하여야 한다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보 관련 담당자에 대한 설명으로 맞게 연결된 것은?\n"
+"|구분|담당자|정의|\n"
+"|:---:|---|---|\n"
+"|㉠|개인정보처리자|개인정보 파일을 운영하기 위해 스스로 또는 관련 정보를 위탁하여 개인정보를 처리하는 단체|\n"
+"|㉡|개인정보파일관리자|개인정보 파일을 운영하기 위해 스스로 개인정보를 처리하는 사업자(개인은 제외)|\n"
+"|㉢|개인정보보호책임자|개인정보의 처리에 관한 업무를 총괄하는 자|\n"
+"|㉣|개인정보취급자|개인정보처리자의 감독을 받아 개인정보를 처리하는 정직원, 계약 직원, 아르바이트생|\n"
+"|㉤|개인정보처리 위탁사|개인정보 파일을 운영하기 위해 관련 정보를 위탁하여 개인정보를 처리하는 단체|\n"
+"|㉥|개인정보처리 수탁사|개인정보 파일을 운영하기 위해 관련 정보를 위탁받아 개인정보를 처리하는 단체|",
v : [ "㉠,㉡,㉢,㉣,㉤",
      "㉠,㉡,㉢,㉣,",
      "㉠,㉡,㉢,㉣,㉥",
      "㉠,㉢,㉣,㉤,㉥",
      "㉠,㉡,㉢,㉣,㉤,㉥"],
d : [4],
h : "개인정보 파일을 운영하기 위해 스스로 또는 관련 정보를 위탁하여 개인정보를 처리하는 개인 및 사업자를 \"개인정보처리자\" 라고 한다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중 개인정보보호를 위한 기업의 올바른 노력으로 가장 적절하지 않은 것은?",
v : [ "개인정보보호 및 관리에 대한 최종 책임은 기업의 CEO에 있다는 인식 문화를 정립한다.",
      "기업은 개인정보보호의 향상을 위해 가급적 전담 조직을 구성하는 것이 바람직하며, 여건이안 될 경우 TF 형식 또는 겸직 형태의 보안 조직을 구성하여 운영할 수 있는 주관 부서를 만들도록 한다.",
      "개인정보보호위원회의 실질적인 활동을 위하여 외부 전문 위원을 참여시키는 등의 활동을 강화한다.",
      "개인정보보호를 위해 적절히 예산을 분배하고, 지원을 아끼지 않아야 한다.",
      "기업에서 개인정보보호를 담당할 마땅한 부서가 없어 전산팀을 해당 담당 부서로 지정하였다."],
d : [5],
h : "개인정보보호에 대한 담당 부서는 무조건 전산팀에 맡기는 것보다 개인정보에 관한 업무를 총괄하고 있거나 총괄할 수 있는 유관 부서에서 관리하도록 하는 것이 바람직하다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음은 개인정보 유출 및 피해를 야기하는 내용을 설명한 것이다. 틀리게 연결된 것은?\n"
+"|구분|상세 내용|\n"
+"|---|---|\n"
+"|㉠ 스미싱(Smishing)|• 정의 : 문자 메시지(SMS)와 피싱(Phishing)의 합성어로 문자 메시지 내 인터넷 주소를 클릭하면 악성 코드가 설치되어 피해자가 모르는 사이에 소액 결제 등 피해가 발생하거나 개인 및 금융 정보를 탈취하는 수법<br>•예시 : 경품 당첨, 무료 쿠폰 제공, 돌잔치 초대장 등을 내용으로 하는 문자메시지 발송|\n"
+"|㉡ 파밍(Pharming)|• 정의 : 악성 코드에 감염된 PC를 조작해 이용자가 인터넷 즐겨찾기 또는 포털 사이트 검색을 통하여 금융 회사 등의 정상적인 홈페이지 주소로 접속하여 피싱 가짜)사이트로 유도되어 범죄자가 개인 금융 정보 등을 몰래 빼가는 수법<br>•예시 : 계좌 이체 보안 카드의 번호 전체나 인터넷 뱅킹 아이디, 비밀번호, 계좌 비밀번호 등을 로그인이 아닌 별도 입력창에 모두 입력하게 함|\n"
+"|㉢ 피싱(Phishing)|• 정의 : 개인 정보(Private Data)와 남시(Fshing)의 합성어로 금융 기관, 공인된 기관을 사칭해 전화나 이메일로 인터넷 사이트에서 보안 카드 일련번호, 계좌번호, 계좌 비밀번호 등의 정보를 해내는 수법<br>• 예시 : 보이스 피싱을 통한 개인정보 유출|\n"
+"|㉣ 메모리 해킹(Memory Hacking)|• 정의 : 컴퓨터 메모리상에 위치한 고객의 금융 정보(계좌번호, 송금액 등을 변조하거나 보안 카드 비밀번호를 절취한 후 돈을 빼돌리는 수법<br>• 예시 : 정상적인 인터넷 뱅킹 절차를 준수하였을지라도 이체 시 금융 거래 정보 등을 실시간으로 위조하여 가로챔|\n"
+"|㉤ 블랙 마켓(Black Market)|• 정의 : 정상적인 앱(안드로이드, IOS 환경) 스토어에 침투하여 원래의 앱 스토어 클릭 시 위조된 프로그램이 설치되도록 구성되는 변형된 앱 프로그램<br>• 예시 : 애플 앱 스토어에 동일 회사의 앱으로 위장하여 위조된 앱을 등록함 |\n",
v : [ "㉠",
      "㉡",
      "㉢",
      "㉣",
      "㉤"],
d : [5],
h : "블랙 마켓은 공인된 앱 스토어 업체가 아닌 개인이나 알려지지 않은 사실 업체가 운영하는 마켓으로 각 종 유료 어플을 무료로 다운받을 수 있으나 위조되거나 악성 코드가 심어진 가짜 앱들도 검증 없이 올라가 있어 사용을 자제하는 것이 좋다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음은 개인정보 처리를 위한 규제에 대한 관점을 논술한 것이다. 해당 내용 중 옳지 않은 것은?",
v : [ "개인정보를 처리할 경우 OPT-IN 관점이라 함은 개인정보 처리 시 반드시 정보 주체의 동의를 받아야 한다는 의미를 내포한다.",
      "개인정보를 처리할 경우 OPT-OUT 관점이라 함은 개인정보 처리 시 정보 주체의 동의가 없어도 해당 개인정보를 수집 및 활용할 수 있다는 의미를 내포한다.",
      "유럽 연합은 개인정보 처리 시 공공 및 민간 기관에서 OPT-IN 관점을 적용하고 있다.",
      "미국은 개인정보를 활용한 빅 데이터(Big Data) 처리 등의 목적으로 수집 시 민간 기관에 OPT-OUT 관점을 적용하기도 한다.",
      "우리나라는 공공 기관과 민간 기관의 경우 위의 1번 ~ 4번 보기와 같이 유럽 연합과 미국의 정책을 받아들이고 있어 효율적인 개인정보보호 및 관리 관점을 모두 적용하고 있다."],
d : [5],
h : "우리나라는 개인정보보호법과 정보통신망법에 대해 개인정보 수집 시 반드시 정보 주체의 동의를 받도록 하고 있으며, 법률에 규정한 예외 사항을 제외하고 동의 없는 수집에 대해 강력한 규제 및 제재를 기하고 있다. 따라서 우리나라는 OPT-IN 관점에서 개인정보보호의 정책을 수립 및 개정해 나가고 있다.",
k : "1과목. 개인정보보호의 이해" },

{
m : "다음 중에서 현재 유효한 정보보호 관련 법률이 아닌 것은?",
v : [ "정보통신망이용촉진 및 정보보호 등에 관한 법률",
      "공공 기관의 정보보호 등에 관한 법률",
      "개인정보보호법",
      "전자정부법",
      "보안 업무 규정"],
d : [2],
h : "공공 기관의 정보보호 등에 관한 법률은 개인정보보호법으로 변경되었다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법을 우선적으로 적용받는 사업자가 아닌 것은?",
v : [ "공공 기관(시청, 도청, 구청 등)의 민원관리팀",
      "준용 사업자(학원, 제조업, 서비스업 등) 회원관리팀 및 고객센터",
      "정보통신제공자(이동 통신사 등)의 네트워크 설비팀",
      "헌법 기관(국회, 헌법재판소 등) 전산실의 DB관리팀",
      "일반 단체(협회, 조합, 사단법인 등)의 인사관리팀"],
d : [3],
h : "통신사의 정보통신망 구축 관련 사업부는 정보통신망법을 우선적으로 따른다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 법령에 관한 설명 중 틀린 것은?",
v : [ "정보통신서비스(온라인, 통신) 분야와 준용 사업자는 개인정보보호법 제정 이후에도 정보통신망법에 의해 규율된다.",
      "정보통신망법, 신용정보법 등 다른 법률에 특별한 규정이 있는 경우를 제외하고는 개인정보보호법을 따른다.",
      "정보통신망법에 규율되는 사업자라 하더라도 정보통신망법에서 별도로 규정되지 않은 사항에 대해서는 개인정보보호법에 적용된다.",
      "개인정보보호법의 규율 분야는 정보통신서비스 제공자, 신용 정보 회사 등 이외에 공공(법원, 행정 기관 등), 민간의 모든 사업자를 포함한다.",
      "개인정보보호법에 따르면 컴퓨터에 의하여 처리되는 개인정보 외 수기 문서까지 개인정보의 보호 범위에 포함된다."],
d : [1],
h : "정보통신서비스 분야와 기타서비스 업종의 경우에도 개인정보를 처리하는 경우 개인정보보호법의 적용을 받는다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법의 적용 범위에 대한 설명으로 틀린 것은?",
v : [ "50인 이내의 동창회 회원정보(이름, 연락처) 목록도 개인정보라고 할 수 있다.",
      "내부 임직원 정보는 개인정보가 아닌 회사의 대외비 정보이다.",
      "데이터베이스에 저장된 비회원 정보의 테이블이다.",
      "개인정보를 수기로 작성한 문서도 개인정보 파일에 해당한다.",
      "산후 조리원에 입주한 산모와 아기 정보도 포함된다."],
d : [2],
h : "내부 임직원 정보도 개인정보에 해당된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 법률에 규율되는 해당 기관으로 틀린 것은?",
v : [ "공공, 민간 부분 개인정보처리자 : 개인정보보호법",
      "정보통신서비스 제공자 : 정보통신망법, 개인정보보호법",
      "신용 정보 제공자 : 신용정보보호법",
      "준용 사업자 : 정보통신망법",
      "항공 운송업자 : 개인정보보호법"],
d : [4],
h : "준용 사업자(호텔업, 항공 운송업, 여행사, 백화점 등 20개 업종은 정보통신망법이 아니라 개인정보보호법에서 규율하게 된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 개인정보보호법과 다른 법률과의 관계에 대한 설명 중 틀린 것은?",
v : [ "개인정보보호법은 일반법으로서 모든 개인정보처리자와 개인정보 주제의 관게에 적용된다.",
      "신용정보법 규정에 따른 신용정보사업자와 신용정보 주체와의 관계에 있어서 해당 법에 특별한 규정이 있다면 그 규정을 먼저 따른다.",
      "영상 정보 처리 기기, 개인정보 영향 평가 등은 개인정보보호법에만 규정되어 있다.",
      "개인정보보호법과 다른 법률에 중복된 규정이 있는 경우 일반법인 개인정보보호법을 적용한다.",
      "개인정보보호와 관련된 특별법으로는 신용정보보호법, 의료법, 전자금융거래법, 보건의료기본법, 위치 정보의 보호 및 이용 등에 관한 법률 등이 있다."],
d : [4],
h : "개인정보보호법은 다른 개인정보보호에 관한 법률과의 특별법) 관계상 일반법에 해당된다. 또한 개인정보보호법과 다른 법률(특별법)에 같은 내용이 있는 경우 특별법을 따르게 되며, 관련 내용이 없는 경우 일반법인 개인정보보호법을 적용한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법상 정보통신서비스 제공자 등의 개인정보 처리 등에 관한 특례의 주요내용으로 옳지 않은 것은?",
v : [ "지문, 홍채, 음성 등 바이오 정보의 이용을 활성화하기 위하여 현행 일방향 암호화 저장을 하도록 하고 있는 바이오 정보를 주민등록번호나 계좌 정보 등과 같이 암호화 저장을 하도록 변경하고, 사회 및 기술 환경의 변화에 탄력적으로 대응할 수 있도록 암호화 저장을 하여야 하는 정보의 구체적 종류를 방송통신위원회가 정하여 고시할 수 있다.",
      "정보통신서비스 이용자의 개인정보보호를 강화하기 위하여 파기 등의 조치를 하여야 하는 대상을 현행 정보통신서비스를 2년 동안 이용하지 아니하는 이용자의 개인정보에서 앞으로는 1년 동안 이용하지 아니하는 이용자로 확대하였다.",
      "정보통신서비스 이용자는 정보통신서비스 제공자 등이 관리하고 있는 자신의 개인정보가 분실·도난·누출된 경우에는 법정 손해 배상을 청구할 수 있게 되었는바, 그 법정 손해 배상의 청구 기간을 이용자가 개인정보 누출 등의 사실을 안 날부터 3년, 개인정보의 누출 등이 발생한 날부터 10년으로 정하였다.",
      "정보통신시스템 등에 대한 보안 및 정보의 안전한 관리를 위하여 정보보호 최고 책임자를 지정하고 신고하여야 하는 정보통신서비스 제공자의 범위를 상시 종업원 수가 1천명 이상인 자, 내용 선별 소프트웨어를 개발·보급하는 사업자, 정보보호 관리 체계 인증을 받아야 하는 자 등으로 제한하였다.",
      "개인정보취급자에 대한 교육 횟수를 법적으로 제한하지 않되 사업장의 규모에 맞게 적절하게 실시하도록 하였다."],
d : [2],
h : "정보통신망법상 개인정보의 유효 기간에 관한 규정이 3년에서 1년으로 변경되었으며, 이는 정보통신망을 통한 이용자의 정보를 보호하기 위한 강화된 조치로 볼 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 정보통신망법에서 규정하고 있는 정보통신서비스의 제공자가 아닌 것은?",
v : [ "기간 통신 사업자(유무선 통신 사업자)",
     "인터넷 뱅킹 서비스 제공자",
     "부가 통신 사업자",
     "인터넷 기반 서비스 제공자",
     "별정 통신 사업자(알뜰 폰 등 재판매 사업자, 국제 전화 서비스 등)"],
d : [2],
h : "인터넷 뱅킹 서비스 제공자는 금융기관에 해당하며, 금융기관은 전자금융거래법에 따른 사업자자금융거래법에 명시되지 않은 사항은 개인정보보호법을 준용하여 적용한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음은 웹 하드 사업자에 대한 설명이다. 올해 반드시 조치해야 할 정보보호 사안이 아닌 것은?\n"
+"* ○○ 웹 하드 사는 작년 기준 회원이 100만명을 돌파하였다. 그리고 웹 하드 서비스뿐만 아니라 P2P를 통한 공유 서비스를 개시하고 있다. 서비스 관련 장비는 IDC 센터에 위치해 있다.",
v : [ "정보보호관리체계를 구축하고, 관련 인증(ISMS) 심사를 받아야 한다.",
      "정보보호최고책임자(CISO)를 지정하고, 과학기술정보통신부에 등록해야 한다.",
      "년 1회 이상 회원들에게 개인정보의 이용 내역을 통지해야 한다.",
      "내부 망에 대한 망 분리를 실시해야 한다.",
      "정보보호 예산을 정보 기술 부문 예산의 7% 이상이 되도록 배정해야 한다."],
d : [5],
h : "해당 내용은 금융권을 대상으로 하는 '금융 회사 정보 기술(IT) 부문의 보호 업무 모범 규준'에 해당한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법의 적용이 일부 제외되는 사항으로 틀린 것은?",
v : [ "공공 기관이 처리하는 개인정보 중 「통계법」에 따라 수집되는 개인정보",
      "아파트 관리 사무소에서 주민 관리비 수납을 위하여 수집되는 개인정보",
      "공중위생 등 공공의 안전과 안녕을 위하여 긴급히 필요한 경우로서 일시적으로 치리 되는 개인정보",
      "언론, 종교 단체, 정당이 각각 취재, 보도, 선교, 선거 입후보자 추천 등 고유 목적을 달성하기 위하여 수집·이용하는 개인정보",
      "국가 안전보장과 관련된 정보 분석을 목적으로 수집 또는 제공 요청되는 개인정보"],
d : [2],
h : "관리비 납부가 필요한 경우라 하더라도 해당 법률이 적용된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법 및 표준 개인정보보호 지침에 따라 친목 단체에 해당하는 예외 조항이 아닌 것은?",
v : [ "개인정보 처리 방침을 수립 및 공개하지 아니할 수 있다.",
      "개인정보책임자를 지정하지 아니할 수 있다.",
      "개인정보의 수집 및 이용에 관한(개인정보보호법 제15조) 사항을 적용받지 않는다.",
      "정보 주체의 동의를 받지 않고, 개인정보 수집 시 과태료를 부과하지 않는다. ",
      "내부 관리 계획의 수립, 접속 기록 보관 등 안전성 확보에 필요한 조치를 하지 않아도 된다."],
d : [5],
h : "친목 단체일지라도 개인정보를 수집하여 이용한다면 안전성 확보를 위한 기술적·관리적 및 물리적 조치를 하여야 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에서 규정하지 않는 내용은?\n"
+"* ㉠ 개인정보 처리 방침의 수립 및 공개 의무\n"
+"* ㉡ 기술적 보호 조치에 대한 기준 제시\n"
+"* ㉢ 개인정보 유효 기간제\n"
+"* ㉣ 개인정보의 파기\n"
+"* ㉤ 개인정보 이용 내역 통지\n"
+"* ㉥ 주민등록번호 사용 제한\n"
+"* ㉦ 이용자의 권리(동의 철회, 열람 요구, 정정 요구 등)",
v : [ "㉡,㉢",
      "㉡,㉤",
      "㉢,㉤",
      "㉢,㉥",
      "㉤,㉥" ],
d : [3],
h : "개인정보보호법에서는 개인정보의 유효 기간제를 별도로 명시하지 않고 있으나 개인정보의 수집 목적이 완료된 이후에는 파기를 해야 한다. 또한, 개인정보 이용 내역 통지는 정보통신망법에 해당되는 내용이다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 금융권의 개인정보보호와 관련된 사항으로 옳지 않은 것은?",
v : [ "전자금융거래법의 개정에 따라 CISO는 다른 IT 보직과 겸직이 불가능하다.",
      "제3자 제공시 필수와 선택 사항으로 분리하여 정보 주체의 동의 아래 불필요한 정보의 제공을 금지하도록 하였다.",
      "주민등록번호는 최초 거래 시 전자 단말기나 콜 센터 인증 등으로 수집이 가능하나 이후에는 신분증 확인 또는 별도의 인증 시스템으로 확인하도록 하였다.",
      "인터넷 뱅킹 등을 통한 탈퇴 회원이 발생할 경우 5년 이내로 파기해야 한다. ",
      "개인정보의 관리 소홀로 인한 정보 유출 시 최대 100억원의 과징금이 부과될 수 있다."],
d : [5],
h : "금융 회사가 개인정보의 관리 소홀로 인한 정보 유출 시 최대 50억원의 과징금이 부과된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 OECD의 8원칙 항목에 해당하지 않는 것은?",
v : [ "수집 제한의 원칙",
      "목적 명시의 원칙",
      "안전성 확보의 원칙",
      "공개·비공개의 원칙",
      "책임의 원칙" ],
d : [4],
h : "• OECD의 8원칙 : 수집 제한의 원칙, 정보 정확성의 원칙, 목적 명확화의 원칙, 이용 제한의 원칙안전성 보호의 원칙, 공개의 원칙, 개인 참가의 원칙, 책임의 원칙이 있다.<br>• 공개에 대한 원칙(Openness Principle)은 있으나 비공개에 대한 사항은 없으며, 개인정보보호법 제3조는 개인정보보호에 대한 원칙을 기술하고 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에서 명시한 개인정보처리방침에 포함되어야 할 필수 항목이 아닌 것은?",
v : [ "정보 주체의 권리, 의무 및 그 행사 방법에 관한 사항",
      "개인정보처리의 위탁에 관한 사항(해당되는 경우에만 정함)",
      "개인정보처리방침의 변경에 관한 사항",
      "정보보호 및 개인정보보호 관리 체계 인증(ISMS-P)의 획득 및 사후 관리",
      "개인정보의 처리 및 보유 기간"],
d : [4],
h : "정보보호 및 개인정보보호 관리 체계 인증(SMS Pl은 정보통신망법 및 개인정보보호법을 근거로 시행되고 있으며, 개인정보보호에 관한 관리 체계를 기업에 부여하는 인증 제도이다. 주무부처는 과학기술정보통신부와 개인정보보호위원회 2개 기관이며, 인중기관은 한국인터넷 진흥원으로 인증 업무를 총괄하여 관리하고 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 설명에 해당하는 OECD의 개인정보에 관한 원칙은?\n"
+"* 정보 주체가 본인에게 해당되는 개인정보를 열람할 수 있도록 공개하고, 정정 및 삭제의 청구권을 보장한다.",
v : [ "공개의 원칙",
      "이용 제한의 원칙",
      "개인 참가의 원칙",
      "정보 정확성의 원칙",
      "목적 명시의 원칙"],
d : [3],
h : "OECD의 개인정보 8원칙\n* 수집 제한의 원칙 : 목적에 필요한 최소한의 범위 안에서 적법하고, 정당하게 수집한다.\n* 정보 정확성의 원칙 : 처리 목적 범위 안에서 정확성, 완전성, 최선성을 보장한다.\n*  목적 명확화의 원칙 : 처리 목적을 명확하게 한다.\n* 이용 제한의 원칙 : 필요한 목적 범위 안에서 적법하게 처리하고, 목적 이외 활용을 금지한다.\n* 안전성 보호의 원칙 : 정보 주체의 권리 침해 위험성 등을 고려하고, 안정성을 확보한다.\n* 공개의 원칙 : 개인 정보의 처리 사항을 공개한다.\n* 개인 참가의 원칙 : 열람 청구권 등 정보 주체의 권리를 보장한다.\n* 책임의 원칙 : 개인 정보 처리자의 책임 준수, 실천, 신뢰성 확보에 노력한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에 따라 개인정보가 유출되었을 때 해야 할 조치 사항으로 틀린 것은?",
v : [ "개인정보 유출 인지 즉시 정보 주체에게 해당 사항을 통지하여야 한다.",
      "1천명 이상의 개인정보가 유출된 경우 개인정보보호위원회 또는 대통령령으로 정한 전문기관에 지체 없이 신고하여야 한다.",
      "개인정보 유출 시 신고 기관으로 지정된 곳은 한국인터넷진흥원, 한국정보화진흥원, 국가사이버안전센터, 개인정보보호위원회 등이 있다.",
      "개인정보의 유출 확산 방지를 위하여 접속 경로 차단, 유출된 개인정보의 삭제 등 긴급한 대응이 필요한 경우 해당 조치를 취한 후 정보 주체에게 알릴 수 있다.",
      "정보 주체에게 통지할 사항을 긴급 대응 후에도 확인하지 못하는 경우에는 정보 주체에게 유출 사실과 확인된 사항만을 알리고, 추후 확인되는 즉시 추가로 통지한다."],
d : [3],
h : "개인정보보호법에서 개인정보 유출 시 신고가 가능한 전문 기관은 한국인터넷진흥원(KISA)이다. 해당 기관에서는 신고 접수, 피해 확산 방지, 피해 복구 등을 위한 기술을 지원할 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보가 유출되었을 때 해당 업체가 정보 주체(개인)에게 통지해야 할 항목이 아닌 것은?",
v : [ "유출된 개인정보의 항목 및 경위",
      "유출된 사이트의 개인정보보호 처리 방침",
      "개인정보처리자의 대응 조치 및 피해 구제 절차",
      "정보 주체에게 피해가 발생한 경우 신고 등을 접수할 수 있는 담당 부서 및 연락처",
      "유출로 인하여 발생할 수 있는 피해를 최소화하기 위하여 정보 주체가 할 수 있는 방법 등에 관한 정보"],
d : [2],
h : "개인정보보호 처리 방침은 해당 홈페이지에서 사전에 의무적으로 게시하여야 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 개인정보보호법상 개인정보 유출시 통지 및 신고에 대한 설명으로 틀린 것은?",
v : [ "1천명 이상의 정보 주체에 관한 개인정보가 유출된 경우 행자부 또는 전문 기관에 신고해야 한다.",
      "개인정보 유출 이후 7일 이내로 정보 주체에 대한 통지 및 조치 결과를 신고해야 하며, 1천명 이상의 개인정보가 유출된 경우에는 서면 등의 방법과 함께 인터넷 홈페이지에 정보 주체가 알기 쉽도록 5일 이상 통지 내용을 게재해야 한다.",
      "개인정보 유출 신고 시 전자 우편, 팩스, 인터넷 사이트를 통해 유출 사고신고 및 신고서를 제출할 수 있다.",
      "시간적 여유가 없거나 특별한 사정이 있는 경우 전화를 통하여 통지 내용을 신고한 후 유출 신고서를 제출할 수 있다.",
      "인터넷 홈페이지를 운영하지 않는 개인정보처리자의 경우 사업장 등의 보기 쉬운 장소에 통지 내용을 게시해야 한다."],
d : [2],
h : "개인정보 유출 이후 5일 이내로 정보 주체에 대한 통지 및 조치 결과를 신고해야 하며, 1천명 이상의 개인정보가 유출된 경우에는 서면 등의 방법과 함께 인터넷 홈페이지에 정보 주체가 알기 쉽도록 7일 이상 통지 내용을 게재해야 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 정보통신서비스 제공자의 개인정보 유출 시 통지 및 신고 내역으로 틀린 것은?",
v : [ "지체 없이 누출된 개인정보와 발생 시점, 이용자 및 정보통신서비스 제공자의 대응 조치 해당 이용자에게 알려야 한다.",
      "정보 유출 시 방송통신위원회 또는 한국인터넷진흥원에 신고하도록 한다.",
      "신고에 대한 기준은 개인정보가 1만건 이상 유출된 경우에 해당하며, 그렇지 않은 경우에는 정보 주체에게 즉시 알리도록 한다.",
      "정보 유출을 발견하였을 시는 그 사실을 안 때부터 24시간 이내로 신고해야 한다.",
      "신고를 받은 한국인터넷진흥원은 지체 없이 해당 사실을 개인정보보호위원회에 알려야 한다."],
d : [3],
h : "정보통신망법을 기준으로는 개인정보가 1건이라도 발생하게 되면 유출 규모에 상관없이 신고해야 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호의 관련 법 개정에 대한 내용으로 그 성격이 다른 것은?\n"
+"|||\n"
+"|---|---|\n"
+"|㉠|◇ 개정 이유 ◇<br>• 개인정보의 수집·유출·오용·남용으로부터 사생활의 비밀 등을 보호하기 위하여 2011년부터 현행법이 제정·시행되고 있으나 2014년 1월 카드사의 개인정보 유출 사고와 같은 대형 개인정보 유출이 발생하는 등 아직까지는 개인정보보호에 대한 인식 수준이 낮은 상황임<br>• 이에 대통령 소속 개인정보보호위원회의 총괄·조정 기능 강화, 개인정보보호 인증기관 지정 근거 마련 등 현행법의 운영상 미비 사항을 보완하고, 징벌적 손해 배상제·법정 손해 배상제를 도입하여 개인정보 유출에 대한 피해 구제를 강화하는 한편, 개인정보의 불법 유통으로 얻은 범죄 수익을 몰수·추징하고, 부정한 방법으로 개인정보를 취득하여 영리 등의 목적으로 타인에게 제공한 자에 대한 벌칙을 신설하는 등 개인정보 범죄에 대한 제재 수준을 강화하려는 것임.|\n"
+"|㉡|◇ 제정 이유 ◇<br>공공 부문과 민간 부문을 망라한 국가 사회 전반을 규율하는 개인정보보호 원칙과 개인정보 처리 기준 등을 새롭게 마련하는 내용으로 「○○ 보호법」이 제정(법률 제10465호, 2011. 3. 29. 공포, 9. 30. 시행)됨에 따라 개인정보처리자로 하여금 개인정보의 안전성 확보에 필요한 조치를 하도록 하고, 개인정보 침해의 우려가 큰 대규모 개인정보 파일을 운용하려는 공공 기관의 장이 하여야 하는 개인정보 영향 평가의 대상·기준을 설정하는 등 법률에서 위임된 사항과 법률의 시행에 필요한 사항을 정하려는 것임|\n"
+"|㉢|◇ 주요 내용 ◇<br>민감 정보 및 고유 식별 정보의 범위(안 제18조 및 제19조)<br>• 사상 신념, 노동조합 및 정당의 가입 탈퇴에 관한 정보 등 법률에서 정한 민감 정보 외에 유전 정보 및 죄 경력에 관한 정보를 수집하는 등 처리가 제한되는 민감 정보의 범위에 포함함<br>• 주민등록번호, 여권번호, 운전면허번호 및 외국인등록번호를 수집 등 처리가 제한되는 고유 식별 정보로 정함<br>• 사생활 침해의 우려가 큰 유전 정보 등 민감 정보와 개인을 고유하게 구별하기 위하여 부여된 주민등록번호 등 고유 식별 정보가 엄격히 관리되어 정보 주체의 개인정보보호가 강화될 것으로 기대됨|\n"
+"|㉣|◇ 개정 이유 ◇<br>개인정보 유출 등에 대하여 정보 통신 서비스 이용자가 300만원 이하의 범위에서 법정 손해 배상을 청구할 수 있도록 하고, 일정 기준에 해당하는 정보 통신 서비스 제공자는 정보보호 최고 책임자를 지정하여 신고하도록하는 등의 내용으로 이 법률이 개정(2014. 5. 28. 공포, 2014. 11. 29. 시행)됨에 따라 ~ (중략) ~ 개인정보의 암호화 저장에 관한 사항을 개선하고, 개인정보 보유 기간을 조정하는 ~ (중략) ~<br>◇ 주요 내용 ◇<br>개인정보의 암호화 저장을 통한 보안 조치 사항의 개선(제15조 제4항)<br>지문, 홍채, 음성 등 바이오 정보의 이용을 활성화하기 위하여 현행 일방향 암호화 저장을 하도록 하고 있는 바이오 정보를 주민등록번호나 계좌정보 등과 같이 암호화 저장을 하도록 변경하고, 사회 및 기술 환경의 변화에 탄력적으로 대응할 수 있도록 암호화 저장을 하여야 하는 정보의 구체적 종류를 주무부처가 정하여 고시할 수 있도록 함|\n"
+"|㉤|정보보호 최고책임자 지정 신고서|",
v : [ "㉠","㉡","㉢","㉣","㉤"],
d : [1],
h : "㉠,㉡,㉢,㉣은 개인정보보호법이 기준이고, ㉤은 정보통신망법 기준이다.",
k : "2과목. 개인정보보호 제도" },

{
m : "2005년 헌법재판소가 주민등록 지문 날인 제도에 대한 위헌 심사를 하면서 중요하게 대두된 권리로서 개인의 정보를 언제, 누구에게, 어느 범위까지 알리고 또한 이용하도록 할 것인지를 결정하는 권리를 말하는 것은?",
v : [ "잊혀질 권리",
      "개인정보 자기 결정권",
      "개인정보의 열람, 정정, 삭제 요구권",
      "개인정보 수집, 이용, 제공, 파기의 원칙",
      "인터넷 실명제"],
d : [2],
h : "2005년 헌법재판소는 주민등록 지문 날인 제도에 대한 위헌 심사를 진행하면서 개인정보 자기 결정권을 헌법상의 권리로 처음 인정하게 되었다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에 명시된 정보 주체의 권리로 틀린 것은?",
v : [ "개인정보의 처리에 관한 정보를 제공받을 권리",
      "개인정보의 처리에 관한 동의 여부, 동의 범위 등을 선택하고 결정할 권리",
      "개인정보의 처리 여부를 확인하고, 개인정보에 대하여 열람(사본의 발급을 포함)을 요구할 권리",
      "개인정보의 처리 정지, 정정·삭제 및 파기를 요구할 권리",
      "개인정보의 처리로 인하여 발생한 피해를 구제받도록 국선 변호사를 지정받을 권리"],
d : [5],
h : "개인정보의 처리로 인하여 피해 발생 시 신속하고, 공정한 절차에 따라 구제 받을 권리가 맞다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에서 이용자가 정보통신서비스 제공자 등에 열람이나 제공을 요구할 수 있는 사안이 아닌 것은?",
v : [ "정보통신서비스 제공자 등이 가지고 있는 이용자의 개인정보",
      "정보통신서비스 제공자 등이 파기한 이용자 정보의 현황",
      "정보통신서비스 제공자 등이 이용자의 개인정보를 이용한 현황",
      "정보통신서비스 제공자 등이 이용자의 개인정보를 제3자에게 제공한 내역",
      "정보통신서비스 제공자 등에게 개인정보 수집·이용·제공 등의 동의를 한 현황"],
d : [2],
h : "파기 정보의 내역에 대한 열람 요구권은 명시되어 있지 않다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보 유출로 인한 손해 배상에 대한 설명으로 틀린 것은?",
v : [ "정보통신서비스 제공자 등이 정보통신망법의 규정을 위반한 행위로 손해를 입으면 그 정보통신서비스 제공자 등에게 손해 배상을 청구할 수 있다.",
      "정보통신서비스 제공자 등은 손해 배상을 청구 받았을 경우 위반 행위에 대한 고의 또는 과실이 없음을 입증하지 아니하면 책임을 면할 수 없다.",
      "이용자는 정보통신서비스 제공자 등에게 손해 배상을 청구하는 대신 300만원 이하의 범위에서 상당한 금액을 손해액으로 하여 배상을 청구할 수 있다.",
      "개인정보처리자가 개인정보의 안전성 확보 조치'를 충실히 이행했음에도 정보 유출이 발생하여 정보 주체에게 손해를 입혔다면 과실에 대한 입증 여부와 상관없이 개인정보처리자에게 손해 배상을 청구할 수 있다.",
      "개인정보에 대한 불법 접근 차단을 위해 침입 차단 시스템 등 접근 통제 장치를 운영하지 않거나 접속 기록의 위조/변조 방지 조치를 아니한 경우 개인정보의 저장·전송 시 암호화 기술 등을 적용하지 않은 경우와 컴퓨터 바이러스에 의한 침해 방지 미조지 시 과징금을 부과할 수 있다."],
d : [4],
h : "개인정보보호법상 개인정보처리자가 이 법에 따른 의무를 준수하고, 상당한 주의와 감독을 게을리 하지 아니한 경우에는 개인정보의 분실·도난·유출·변조 또는 훼손으로 인한 손해 배상 책임을 감경 받을 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보처리자가 정보 주체에게 그 사유를 알리고, 열람을 제한하거나 거절할 수 있는 사유가 아닌 것을 모두 고르시오.",
v : [ "법률에 따라 열람이 금지되거나 제한되는 경우",
      "다른 사람의 생명, 신체를 해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할 우려가 있는 경우",
      "공공 기관이 다음 각 목의 어느 하나에 해당하는 업무를 수행할 때 중대한 지장을 초래하는 경우",
      "개인정보에 대한 열람을 공공 기관에 요구하고자 할 때에는 대통령령으로 정하는 바에 따라 개인정보보호위원회를 통하여 열람을 요구할 경우",
      "고등교육법에 따른 고등 교육 기관에서 해당 담임교사가 성적 평가를 위해 학생의 정보를열람할 필요가 있는 경우"],
d : [4,5],
h : "정보 주체가 자신의 개인정보에 대한 열람을 공공 기관에 요구하고자 할 때에는 공공 기관에 직접 열람을 요구하거나 대통령령으로 정하는 바에 따라 개인정보보호위원회를 통하여 열람을 요구할 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법상 정보 주체의 처리 정지 요구를 거절할 수 있는 사유가 아닌 것은?\n"
+"* ㉠ 법률에 특별한 규정이 있거나 법령상 의무를 준수하기 위하여 불가피한 경우\n"
+"* ㉡ 개인정보를 제공한 회사에 고객이 제3자 제공에 대한 동의를 철회한 경우\n"
+"* ㉢ 회원 가입한 사이트에 대하여 온라인 탈퇴 처리가 안 되어 고객 센터로 요청한 경우\n"
+"* ㉣ 공공 기관이 개인정보를 처리하지 아니하면 다른 법률에서 정하는 소관 업무를 수행할 수 없는 경우\n"
+"* ㉤ 개인정보를 처리하지 아니하면 정보 주체와 약정한 서비스를 제공하지 못하는 등 계약 이행이 곤란한 경우로서 정보 주체가 그 계약의 해지 의사를 명확하게 밝히지 아니한 경우\n",
v : [ "㉠,㉡"
    , "㉠,㉢"
    , "㉡,㉢"
    , "㉡,㉣"
    , "㉣,㉤" ],
d : [3],
h : "* ㉡ : 고객 가입 시 제3자 제공에 동의하였다고 하더라도 이후에 동의를 취소하고자 한다면 제3자 제공사에 요청하여 수집한 정보를 삭제해야 한다.\n* ㉢ : 개인정보처리자는 정보 주체가 탈퇴를 요청할 경우 지체 없이 해당 개인정보의 파기 등 필요한 조치를 실시해야 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보분쟁위원회에 대한 설명으로 틀린 것은?",
v : [ "2011년 9월 30일부터 개인정보보호법 제40조에 의거하여 개인정보와 관련한 당사자 간의 분쟁 사건을 접수하여 합리적이고, 원만하게 조정하여 해결하는 업무를 담당한다.",
      "분쟁조정위원회 구성은 위원장 1명을 포함한 20인 이내로서 부교수급 이상 교수, 판사, 검사 또는 변호사, 시민 사회 단체 또는 소비자 단체 추천자 및 개인정보처리자로 구성된 사업자 단체 임원 등 다양한 분야의 개인정보보호 전문가로 구성된다.",
      "분쟁 해결 제도란 분쟁이 발생한 경우 제3자가 관여하거나 관여 없이 당사자 쌍방의 자율적 의사 및 합의에 의하여 분쟁을 해결하는 방식으로서 법원의 소송 제도에 의한 분쟁 해결방식을 보완하는 의미가 있다.",
      "법원의 소송 제도의 대안으로서 조정, 화해, 중재 등 제도를 도입하게 되었는데 이 같은 분쟁 해결 제도는 그 처리 시간이 오래 걸리지 않고, 비용도 상당수 절감되는 등의 장점이 있다.",
      "개인정보분쟁조정위원회의 조정 결정에 대해 신청인과 상대방이 이를 수락하여 조정이 성립된 경우에는 조정서를 작성하게 되며, 조정서 내용은 개인정보보호법 제17조 제5항의 규정에 따라 \"재판상 화해\"(민사 소송법상 확정 판결과 동일한 효력)가 부여된다. 이로써 조정 성립 후 당사자가 결정 내용을 이행하지 않을 경우에는 법원으로부터 집행문을 부여받아 강제 집행을 할 수 있는 강력한 효력이 있다."],
d : [4],
h : "조정. 화해, 중재는 비용이 들지 않고 민원으로 접수하여 처리된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에 따른 단체 소송에 관한 설명으로 틀린 것은?",
v : [ "개인정보 단체 소송을 제기할 수 있는 주체는 소비자 단체와 비영리 민간단체이며, 개인 사업자인 경우에도 가능하다.",
      "개인정보 단체 소송을 제기할 수 있는 소비자 단체는 정관에 따라 상시적으로 정보 주체의 권익 증진을 주된 목적으로 하되 정회원수가 1천명 이상이고, 공정거래위원회에 등록 후 3년이 경과해야 가능하다.",
      "법원은 개인정보처리자가 분쟁조정위원회의 조정을 거부하거나 조정 결과를 수락하지 아니할 때 단체 소송을 허가할 수 있다.",
      "단체 소송에 관하여 개인정보보호법에 특별한 규정이 없는 경우에는 민사 소송법을 적용한다.",
      "단체 소송 청구 시 소송 허가 신청서의 기재 사항에 흠결이 없어야 한다."],
d : [1],
h : "단체 소송을 할 수 있는 대상은 다음과 같다.\n* 소비자 기본법 제29조에 따라 공정거래위원회에 등록한 소비자 단체 1천명 이상)\n* 비영리 민간단체 지원법 제2조에 따른 비영리 민간단체(5천명 이상).",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법상 집단 분쟁 조정에 관한 설명으로 옳지 않은 것은?",
v : [ "피해 또는 권리 침해를 입은 정보 주체의 수가 5명 이상인 경우에 해당되며, 사건의 중요쟁점이 사실상 또는 법률상 공통으로 해당되어야 한다.",
      "개인정보처리자가 분쟁조정위원회의 조정을 거부하거나 조정 결과를 수락하지 아니 한 경우에는 단체 소송이 진행될 수 있다.",
      "집단 분쟁 조정의 신청자는 국가 및 지방자치단체, 개인정보보호단체 및 기관, 정보 주체, 개인정보처리자가 될 수 있다.",
      "분쟁조정위원회는 개인정보처리자가 분쟁조정위원회의 집단 분쟁 조정 내용을 수락한 경우에는 집단 분쟁 조정의 당사자가 아닌 자로서 피해를 입은 정보 주체에 대한 보상 계획서를 작성하여 분쟁조정위원회에 제출하도록 권고할 수 있다.",
      "분쟁조정위원회는 분쟁의 성질상 분쟁조정위원회에서 조정하는 것이 적합하지 아니하다고 인정하거나 부정한 목적으로 조정이 신청되었다고 인정하는 경우에 그 조정을 거부할 수 있다."],
d : [1],
h : "피해 또는 권리 침해를 입은 정보 주체의 수가 50명 이상이어야 집단 분쟁 조정을 신청할 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중에서 단체 소송을 제기하는 단체가 소장과 함께 제출해야 할 서류가 아닌 것은?",
v : [ "원고, 피고 및 그 소송 대리인이 포함된 소송 허가 신청서",
      "정보 주체의 침해된 권리 내용이 포함된 소송 허가 신청서",
      "소제기단체가 제51조 각 호의 어느 하나에 해당하는 요건을 갖추고 있음을 소명하는 자료",
      "개인정보처리자가 조정을 거부하였거나 조정 결과를 수락하지 아니하였음을 증명하는 서류",
      "정보 주체의 침해로 인한 추가 유출(2차, 3차 등)의 예상 피해 내역"],
d : [5],
h : "추가 유출의 예상 피해 내역은 가능성은 있으나 정보 주체의 침해된 권리 내용에 반드시 포함되기에는 논란의 여지가 있을 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 정보통신망법에서 규정하고 있는 이용자 권리에 대한 설명으로 적절하지 않은 것은?\n"
+"* ㉠ A사는 회원 가입 시 온라인 홈페이지를 통해 가입하도록 하고 있으며, 탈퇴 시에는 별도의 서류를 구비하여 각 지점을 방문 또는 팩스, 이메일을 통해 탈퇴 요청서를 받아서 처리하도록 하고 있다.\n"
+"* ㉡ B사는 온라인 회원 가입 시 동의한 내용 중 제3자 제공에 대한 동의 철회 시 본인 확인을 위해서 주민등록증 사본을 이메일로 받도록 하고 있다.\n"
+"* ㉢ 개인정보 수정 시 비밀번호는 온라인으로 변경하도록 하고 있으나 배송목적을 위한 주소 정보 수정은 별도로 콜 센터에 ARS를 통해서 변경하도록 하고 있다.\n"
+"* ㉣ 동의 철회, 개인정보 열람 및 정정 방법을 업무 시간 동안 APS를 통해서 확인할 수 있도록 하고 있다.\n"
+"* ㉤ 사업자는 이용자가 개인정보 수집에 관한 동의를 철회하는 경우, 지체 없이 수집된 개인정보를 파기하되 지체 없이에 대한 기준은 업무 특성상 회사 규정에 따라 수립하고, 최대 한 달을 넘지 않도록 한다.",
v : [ "㉠,㉡"
    , "㉠,㉡,㉢"
    , "㉡,㉢,㉣"
    , "㉡,㉢,㉣,㉤"
    , "㉠,㉡,㉢,㉣,㉤" ],
d : [5],
h : "* ㉠ : 회원 가입 시 홈페이지를 통해 온라인으로 가입하였다면 홈 페이지를 통해 온라인으로 취소가 가능하도록 해야 한다.\n"
+"* ㉡ : 동의 철회 시 본인 확인을 위해 주민등록증 사본을 별도 이메일로 받는 것이 반드시 필요한 것은 아니다.\n"
+"* ㉢ : 배송 시의 주소에 대한 수정도 온라인 회원인 경우 홈페이지에서 쉽게 수정할 수 있도록 방법을 제공해야 한다.\n"
+"* ㉣ : 동의 등의 철회 시 업무 시간만이 아닌 비업무 시간에도 이메일이나 홈페이지를 통해 쉽게 정정 및 요구할 수 있도록 해야 한다.\n"
+"* ㉤ : 지체 없이 파기할 경우 지체 없이에 대한 기준은 표준 개인정보 지침에 따르면 5일을 권고하고 있다.\n"
+"* 개인정보보호법(제39조의 7 이용자의 권리 등에 대한 특례에서는 동의 철회, 열람, 제공, 오류 정정을 요구하는 방법을 개인정보의 수집 방법보다 쉽게 하도록 규정하고 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음은 회원 탈퇴 이후 로그인 절차와 회원 탈퇴 메뉴의 레이아웃 구성에 대한 예시로 가장적절하지 않은 것을 모두 고르시오.\n"
+"* ㉠ 로그인 시 왼쪽 상단의 개인정보 수정 메뉴 아래에 회원 탈퇴 메뉴가 위치하도록 디자인 한다.\n"
+"* ㉡ 회원 탈퇴 시 핸드폰을 통해 본인 확인(SMS 인증)을 거치도록 한다.\n"
+"* ㉢ 회원 탈퇴 후 재로그인 할 경우에 기존의 서비스를 이용할 수 있는 \"My Page\" 메뉴로 이동하도록 구성한다.\n"
+"* ㉣ 로그인 시 위쪽 상단의 오른쪽 또는 퀵 바에 탈퇴 메뉴가 위치하도록 구성한다.\n"
+"* ㉤ 탈퇴 요청 후 로그인 하면 다음 화면에 \"탈퇴 하시겠습니까?\"라는 선택창이 뜨도록 프로그래밍처리를 한다.",
v : [ "㉠, ㉡, ㉢",
      "㉠, ㉢, ㉣",
      "㉡, ㉢, ㉤",
      "㉡, ㉢, ㉣, ㉤",
      "㉠, ㉡, ㉢, ㉣, ㉤" ],
d : [3],
h : "* ㉡ : 탈퇴 버튼을 누르면 추가 안내 후 바로 처리되도록 해야 하나 휴대폰 인증 등을 통해서 어렵게 하면 안 된다.\n* ㉢: 탈퇴 처리가 되었다면 기존 서비스가 가능한 페이지로 이동하면 안 된다.\n* ㉤ 탈퇴 처리가 이미 되었는데 다시 탈퇴 절차가 필요한 것은 아니다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법 제39조의 7(이용자의 권리 등에 대한 특례)의 이용자 권리에 대한내용으로 옳지 않은 것은?",
v : [ "정보통신서비스 제공자 등은 이용자가 제1항에 따라 동의를 철회하면 지체 없이 수집된 개인정보를 복구 및 재생할 수 없도록 파기하는 등 필요한 조치를 하여야 한다.",
      "정보통신서비스 제공자 등은 제2항에 따라 열람 또는 제공을 요구받으면 지체 없이 필요한 조치를 하여야 한다.",
      "정보통신서비스 제공자 등은 제2항에 따라 오류의 정정을 요구받으면 지체 없이 그 오류를 정정하거나 정정하지 못하는 사유를 이용자에게 알리는 등 필요한 조치를 하여야 한다.",
      "필요한 조치를 할 때까지는 해당 개인정보를 이용하거나 제공하여서는 아니 된다. 다만, 다른 법률에 따라 개인정보의 제공을 요청받은 경우에는 그 개인정보를 제공하거나 이용할 수 있다.",
      "이용자는 국외 거주 시 정보통신서비스 제공자 등에 대하여 개인정보 수집·이용·제공 등의 동의를 철회할 때 국내로 입국하거나 한국의 근로 기준법상의 업무 시간에 철회 요청을 해야 한다."],
d : [5],
h : "제30조(이용자의 권리 등)에서 이용자는 정보통신서비스 제공자 등에 대하여 언제든지 개인정보 수집·이용·제공 등의 동의를 철회할 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법, 정보통신망법 및 통신비밀보호법에서 말하는 대리인의 권리로 옮은 것을 모두 고르시오.\n"
+"* ㉠ 만 14세 미만의 아동 법정 대리인은 개인정보처리자에게 그 아동의 개인정보 열람 등을 요구할 수 있다.\n"
+"* ㉡ 정보 주체로부터 위임을 받은 자는 개인정보처리자에게 정보 주체의 개인정보 열람 등을 요구할 수 있다.\n"
+"* ㉢ 만 14세 미만의 아동 개인정보에 대한 권리는 정보 주체인 아동이 아닌 법정 대리인이 그 권리를 대신 행사하게 된다.\n"
+"* ㉣ 정보 주체로부터 위임을 받은 자는 정보 주체의 통신 확인 사실 자료의 제공을 요구할 수 있다.",
v : [ "㉠,㉡,㉢",
      "㉠,㉡,㉣",
      "㉡,㉢,㉣",
      "㉠,㉡,㉢,㉣",
      "해당 사항 없음"],
d : [1],
h : "통신비밀보호법에서는 (3조) 당사자 이외 가입자의 전기 통신 일시 등의 통신 사실 확인 자료의 제공이나 공개, 타인간의 대화 녹음 및 청취를 금지하고 있다. 통신 사실 확인 자료는 전기통신사업법 제2조 11호에서 확인할 수 있다. 법정 대리인에 관한 사항은 개인정보보호법 38조 동법 시행령 45조(대리인의 범위 등을 참조하도록 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음은 임직원 및 개인정보취급자에 대한 보안 서약서 징구 및 관리에 대한 절차를 설명한 것이다. 괄호 안에 들어갈 말로 올바르게 연결된 것은?\n"
+"* 개인정보처리자는 개인정보 처리 시 (㉠) 환경 및 중요한 (㉡) 등을 고려하여 보안 서약서 작성 등 개인정보보호를 위하여 필요한 사항을 기술하거나 추가할 수 있다.\n"
+"* 조직에서 임직원들의 대외비 및 기밀 정보 유출 위험을 최소화하고, 임직원에게 개인정보 보호에 대한 책임을 명확히 인식시키기 위해 사내 보안 서약서에 날인하도록 한다.\n"
+"* 보안 서약서의 서명은 개인정보보호를 위한 기본적인 보호 절차 중 하나로 인식되고 수행될 필요가 있다. 이러한 절차는 보통(㉢) 채용 시 총무팀과 같은 인력 관리 부서에 의해 총괄 수행될 수 있다.\n"
+"* 보안 서약서에는 일반적으로 '(㉣),(㉤) 등의 의무'에 관한 내용과 서명 날짜, 서명자 정보 및 서명을 포함하여야 한다.",
v : [ "㉠ 내부 ㉡ 민감 정보 처리 부서 ㉢ 신규 인력 ㉣ 개인정보보호 □ 회사 영업 관련 공시 자료 보호",
      "㉠ 내·외부 ㉡ 민감 정보 처리 ㉢ 퇴직 인력 ㉣ 개인정보보호 ㉤ 회사 영업 관련 공시 자료 보호",
      "㉠ 그 온라인 ㉡ 민감 정보 처리 부서 ㉢ 신규 인력 ㉣ 개인정보보호 및 ㉤ 회사 영업 비밀 보호",
      "㉠ 그 온라인 오프라인 ㉡ 민감 정보 처리 ㉢ 퇴직 인력 ㉣ 개인정보보호 ㉤ 회사 영업 비밀보호",
      "㉠ 온라인·오프라인 ㉡ 민감 정보 처리 ㉢ 신규 인력 ㉣ 개인정보보호 ㉤ 회사 영업 비밀 보호"],
d : [5],
h : "퇴직 시에도 보안 서약서를 받으면 좋으나 입사 시 반드시 받도록 해야 하는데 이는 문제 발생 방지를 위해 퇴직 시보다 입사 시 받는 것이 바람직하다. 입사 시 서약서를 징구할 때 퇴직 시의 준수사항을 명시해 놓았다면 별도로 퇴직 시에 받지 않아도 된다. 또한, 회사의 공시 자료는 대내외에 공표하는 내용으로 대외비에 해당하지 않을 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호에 관한 업무 위탁 시 첨부할 위탁 계약서에 포함될 사항으로 옳은 것을 모두 고르시오.\n"
+"* ㉠ 위탁 업무 수행 목적 외 개인정보의 처리 금지에 관한 사항\n"
+"* ㉡ 개인정보의 기술적·관리적 보호 조치에 관한 사항\n"
+"* ㉢ 위탁 업무의 목적 및 범위\n"
+"* ㉣ 재위탁 제한에 관한 사항\n"
+"* ㉤ 접근 통제 등 안전성 확보 조치에 관한 사항\n"
+"* ㉥ 위탁 업무와 관련하여 보유하고 있는 개인정보의 관리 현황 점검 등 감독에 관한 사항\n"
+"* ㉦ 수탁자가 준수하여야 할 의무를 위반한 경우 손해 배상 등에 관한 사항 등\n"
+"* ㉧ 수탁사와 수탁사 임직원의 징계·포상·면책과 관련한 사항",
v : [ "모두 옳음",
      "㉠,㉡,㉢,㉣,㉤,㉥,㉦",
      "㉠,㉡,㉢,㉣,㉤,㉥",
      "㉡,㉢,㉣,㉤,㉥,㉦",
      "㉡,㉢,㉣,㉤,㉥"],
d : [2],
h : "업무를 위탁받은 수탁사는 개인정보보호법 준수 및 기술적·관리적 보호 조치를 이행했다면 책임을 지지 않을 수 있으나 위탁사가 수탁사 임직원의 징계, 포상 등에 대한 권리를 요구하는 것은 법률 기준에 따라 과도할 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에 따른 개인정보처리자의 징계에 대한 설명으로 옳은 것을 모두 고르시오.\n"
+"* ㉠ 개인정보보호위원회는 개인정보처리자에게 이 법 등 개인정보보호와 관련된 법규 위반에 따른 범죄 혐의가 있다고 인정될 만한 상당한 이유가 있을 때에는 관할 수사 기관에 그 내용을 고발할 수 있다.\n"
+"* ㉡ 개인정보보호위원회는 이 법 등 개인정보보호와 관련된 법규의 위반 행위가 있다고 인정될 만한 상당한 이유가 있을 때에는 책임이 있는 자(대표자 및 책임 있는 임원을 포함한다)를 징계할 것을 해당 개인정보처리자에게 권고할 수 있다. 이 경우 권고를 받은 사람은 이를 존중하여야 하며, 그 결과를 개인정보보호위원회에 통보하여야 한다.\n"
+"* ㉢ 관계 중앙행정기관의 장은 소관 법률에 따라 개인정보처리자에 대하여 동법 65조에 따른 고발을 하거나 소속 기관·단체 등의 장에게 징계 권고를 할 수 있다. 이 경우 권고를 받은 사람은 이를 존중하여야 하며, 그 결과를 관계 중앙행정기관의 장에게 통보하여야 한다.\n"
+"* ㉣ 개인정보보호위원회는 제61조에 따른 개선 권고, 제64조에 따른 시정 조치 명령, 제65조에 따른 고발 또는 징계 권고 및 제75조에 따른 과태료 부과의 내용 및 결과에 대하여 심의·의결을거쳐 공표할 수 있다.\n"
+"* ㉤ 법 제61조 제2항·제3항에 따른 개선 권고 및 법 제65조 제2항·제3항에 따른 징계 권고는 권고 사항, 권고 사유 및 조치 결과 회신 기간 등을 분명하게 밝힌 문서로 하여야 한다.",
v : [ "㉠,㉡,㉢",
      "㉠,㉡,㉢,㉣",
      "㉠,㉡,㉢,㉤",
      "㉡,㉢,㉣,㉤",
      "㉠,㉡,㉢,㉣,㉤"],
d : [5],
h : "개인정보보호법에 따라 개인정보보호위원회는 법률을 위반한 자에 대하여 개인정보 처리자에게 징계를 권고하고 소명 받을 수 있다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법에 따른 주민등록번호의 처리에 관한 법적 준수 사항으로 옳지 않은 것은?",
v : [ "'주민번호 수집 법성 주의'가 신설되었다.",
      "주민번호 처리를 원칙적으로 금지하고, 일부 예외적인 경우를 허용하고 있다.",
      "개인정보보호법 시행 이전에 기 보유한 주민번호는 법 시행 후 2년 이내('16.8.6일까지)에 파기해야 한다.",
      "주민번호 유출에 대한 과징금 제도가 신설되었다.",
      "주민번호 유출 등이 발생한 경우로서 안전성 확보 조치를 하지 않은 경우 최대 3억원 이하의 과징금을 부과할 수 있다."],
d : [5],
h : "개인정보보호법에 따라 주민번호가 유출된 경우 최대 5억원 이하의 과징금이 부과된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음은 주민등록번호 수집 금지에 대한 판단 기준을 도식화 한 내용이다. 빈 칸(네모)에 들어갈 내용으로 옳은 것은?\n![](./moon/cppg/q2-40.png)",
v : [ "주민번호 미수집",
      "법령 근거 마련",
      "해당 정보 파기",
      "대체 수단 도입으로 변경",
      "가이드라인 작성"],
d : [3],
h : "주민등록번호의 수집 및 처리는 원칙적으로 금지되어 있지만 부득이한 경우 법률에 따라 예외 사행을 둘 수 있다(주민등록번호 수집 금지 제도 가이드라인)",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 인쇄 업체 PRINT사는 각 지역별 지점에 비치된 회원 가입 신청서를 통해 오고인 형태로 지역 회원을 모집하고 있으며, 회원에 대해 5%의 할인 혜택을 부여하고 있다 또한, 인쇄 관련 포털 사이트로 대표 홈페이지를 이용하여 국내 및 국외에 서비스를 하고 있으며, 온라인 회원은 10%의 할인 혜택과 배송비를 무료로 제공해 주고 있다. 온라인 홈페이지는 자회사에 위탁하여 운영하고 있으며, 자회사는 부가 통신 사업자로 지정되어다. 그렇다면 위의 인쇄 업체인 PRINT사에게 적용될 수 있는 개인정보 관련 법률은?",
v : [ "개인정보보호법, 인쇄업 관리 조례",
      "정보통신망법, 인쇄업 관리 조례",
      "개인정보보호법",
      "전자금융거래법, 인쇄업 관리 조례",
      "개인정보보호법, 하도급법"],
d : [3],
h : "개정된 데이터 3법에 따라 인쇄 업체가 개인정보를 수집하는 경우에도 개인정보보호법을 통합하여 따른다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보보호법의 시행령에서 추가로 규정하고 있는 민감 정보에 해당되는 것은?\n"
+"* ㉠ 사상 및 신념\n"
+"* ㉡ 노동조합 및 정당의 가입·탈퇴\n"
+"* ㉢ 정치적 견해\n"
+"* ㉣ 건강, 성 생활 등에 관한 정보\n"
+"* ㉤ 유전자 검사 등의 결과로 얻어진 유전 정보\n"
+"* ㉥ 형의 선고, 면제 및 선고 유예 관련 정보",
v : [ "㉠,㉡",
      "㉡,㉢",
      "㉡,㉤",
      "㉢,㉤",
      "㉤,㉥"],
d : [5],
h : "정보 주체의 사생활을 현저히 침해할 우려가 있는 개인정보로서 대통령령으로 정하는 정보(이하 민감 정보라 한다)에서는 유전자 검사 등의 결과로 얻어진 유전 정보, 「형의 실효 등에 관한 법률」 제2조 제5호에 따른 범죄 경력 자료(형의 선고 및 면제, 보호 감호 및 치료 감호, 집행 유예의 취소 등에 해당하는 정보가 포함된다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 개인정보 처리 방침에 포함되는 필수 사항으로 옳지 않은 것은?\n"
+"* ㉠ 처리하는 개인정보의 항목\n"
+"* ㉡ 개인정보의 파기에 관한 사항\n"
+"* ㉢ 개인정보의 안전성 확보 조치에 관한 사항\n"
+"* ㉣ 개인정보의 처리 목적\n"
+"* ㉤ 개인정보의 책임자에 관한 사항\n"
+"* ㉥ 개인정보의 열람 청구 신청 및 접수 기관\n"
+"* ㉦ 개인정보의 처리 및 보유 기간\n"
+"* ㉧ 정보 주체의 권리와 의무 및 그 행사 방법에 관한 사항",
v : [ "㉠",
      "㉠,㉡,㉢,㉣",
      "㉤,㉦,㉧",
      "㉦,㉧",
      "㉥"],
d : [5],
h : "㉥의 개인정보의 열람 청구 신청 및 접수 기관에 대한 사항은 개인정보보호법 시행령 33조(개인정보파일의 등록 사항)에서 개인정보 파일 등록 시의 필수 항목으로 개인정보 처리 방침에 포함될 필수 사항은 아니다. ㉤의 개인정보의 책임자에 관한 사항은 개인정보보호법을 근거로 하는 표준 개인정보 보호 지침에 명시되어 있다. 따라서 ㉥을 제외한 항목은 개인정보처리 방침에 모두 포함되어야 한다.",
k : "2과목. 개인정보보호 제도" },

{
m : "다음 중 법률에 특별한 규정이 있거나 법률 준수를 위해 불가피한 경우 정보 주체에게 알리고 별도 동의를 받아야 하는 민감 정보에 해당되지 않는 것은?",
v : [ "유전자 검사 등의 결과로 얻어진 유전 정보",
      "형의 선고, 보호 관찰, 집행 유예의 취소 등 범죄 경력에 관한 정보",
      "노동조합의 가입에 관한 사항",
      "지지하는 정당에 대한 선호도",
      "국제 협정 이행을 위해 외국 정부 또는 국제기구에 제공하는 정보"],
d : [5],
h : "공공 기관이 범죄 수사 및 국제 협정 이행을 위해 정보 제공이 필요한 경우와 법원의 재판 업무 수행을 위하여 필요한 정보 이용 시는 별도 동의가 필요하지 않다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보 수집 시 동의가 필요한 항목으로 맞는 것은?\n"
+"* ㉠ 성명, 아이디, 비밀번호 등 필수 정보\n"
+"* ㉡ 고유 식별 정보(주민등록번호, 여권번호, 외국인번호, 운전면허번호)\n"
+"* ㉢ 민감 정보(정치적 성향, 노조 가입 여부, 종교 등)\n"
+"* ㉣ 수집 당시의 목적 외 제공\n"
+"* ㉤ 선택적 개인정보 수집(성별, 기혼 여부, 병력, 소득 등)",
v : [ "㉡,㉢",
      "㉡,㉢,㉤",
      "㉡,㉢,㉣",
      "㉠,㉡,㉢,㉣",
      "㉠,㉡,㉢,㉣,㉤" ],
d : [5],
h : "보기의 항목은 개인정보 수집 시에 모두 동의가 필요하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 정보 주체의 동의 없이 개인정보를 수집할 수 있는 이유로 틀린 것은?",
v : [ "정보 주체와 계약의 체결 및 이행을 위하여 불가피하게 필요한 경우",
      "법적 기준에 대한 판단을 할 수 없는 14세 미만의 아동에 대한 정보 수집을 할 경우",
      "법정 대리인이 의사 표시를 할 수 없는 상태이거나 주소 불명으로 사전 동의를 받을 수 없는 경우로 정보 주체가 급박한 생명, 재산의 이익을 위해 필요한 경우",
      "개인정보처리자의 정당한 이익을 달성하기 위하여 필요한 경우로 명백하게 정보 주체의 권리보다 우선하는 경우",
      "개인정보처리자의 정당한 이익과 상당한 관련이 있고 합리적인 범위를 초과하지 않는 경우"],
d : [2],
h : "14세 미만의 아동 정보를 수집하고자 하더라도 반드시 법정 대리인의 동의를 받아야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 보기의 내용이 적절하지 않은 것으로 연결된 것은?\n"
+"* ㉠ 인터넷 쇼핑몰 홈페이지에 온라인으로 회원 가입 시에는 반드시 약관과 개인정보 처리 방침에 동의를 받고 수집해야 한다.\n"
+"* ㉡ 동창회 관리를 위해 회원 정보를 수집할 경우에는 동의 없이 수집이 가능하나 동창회의 개인정보 처리 방침은 반드시 수립하여 공개해야 한다.\n"
+"* ㉢ 회사 내 교육을 위해 외부 강사를 위촉하고 강사료를 지급하는 경우 최초에 수집 동의를 받은 이후 추가 교육이 주기적으로 예정되어 있다. 이때 다음 교육이 완료된 후 강사료 지급 시에는추가로 개인정보의 수집에 관한 동의 없이 기 수집된 정보를 통해 강사료 지급이 가능하다.\n"
+"* ㉣ 방문 판매를 통해 계약자의 정보를 문서로 직접 수집하는 경우에는 상호간에 이미 계약에 합의한 것으로 간주하여 수집 동의를 생략할 수 있다.\n"
+"* ㉤ 공공 기관이 민원을 목적으로 개인정보 수집 후 민원이외 목적으로 사용하는 경우에라도 별도동의를 받고, 추가 수집을 실시해야 한다.",
v : [ "㉠,㉡",
      "㉡,㉢",
      "㉡,㉣",
      "㉢,㉣",
      "㉢,㉤" ],
d : [3],
h : "동창회, 동호회 등 친목 도모를 위한 단체 운영 시 개인정보 수집에 대한 동의 개인정보 처리 방침의 수립 및 공개, 개인정보보호 책임자의 지정에 관한 3개 사항을 이행하지 않아도 된다. 소득 귀속자에 대하여 원천 징수 의무 및 신고 의무 등을 이행하기 위한 개인정보의 수집은 소득세법을 따르며, 이에 따라 강사료 지급시마다 추가로 수집 동의 없이 지급 업무가 가능하다. 그러므로 내부 직원의 경우 급여 등의 소득 관련 비용을 회사가 지불할 경우 계약 시에 개인정보 수집에 관한 동의와 근로 계약을 맺은 이후 별도의 수집 동의를 받지 않는 것이다. 그렇다고 하더라도 외부 강사인 경우 강사료 지급 시 사용되는 신청서 작성 시마다 수집 동의를 받는 것이 바람직하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음의 보기에서 개인정보 수집 절차에 대한 설명 중 옳은 것은?\n"
+"* ㉠ 법정 대리인의 동의를 받기 위한 아동의 최소 나이는 만 14세 미만에 해당한다.\n"
+"* ㉡ 법정 대리인의 동의를 받기 위해 아동을 통해 부모의 성명과 연락처를 수집할 경우 관련된 친인척을 통해 동의를 받아야 한다.\n"
+"* ㉢ 법정 대리인이 그 역할을 수행할 수 없다고 판단되는 경우 법원에서 법정 대리인을 선임할 수 있다.\n"
+"* ㉣ 법정 대리인의 주소 불명으로 사전 동의를 받을 수 없는 경우에 아동의 생명을 위해 필요하다고 판단될 경우 동의 없이 정보를 수집 및 이용할 수 있다.\n"
+"* ㉤ 학교가 법률에 근거한 교육적 목적으로 교내에 재학 중인 14세 미만의 학생 정보를 수집하는 경우 별도의 동의를 받아야 한다.",
v : [ "㉠,㉡,㉢",
      "㉠,㉢,㉣",
      "㉡,㉢,㉣",
      "㉡,㉣,㉤",
      "모두 맞음"],
d : [2],
h : "법정 대리인의 동의를 받기 위해 아동을 통해 법정 대리인의 이름과 연락처를 수집할 경우에는 동의를 받지 않아도 되며, 학교는 해당 재직 중인 학생에 대하여 교육적 목적으로 개인정보를 수집할 경우관련 교육법에 근거하여 동의를 받지 않아도 된다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보 수집 시 동의를 받는 방법으로 적절하지 않은 것은?",
v : [ "개인정보취급자가 정보 주체(고객)에게 동의를 위한 문서를 우편으로 전달하고, 정보 주체가 서명하거나 날인한 동의서를 받는다.",
      "전화를 통해 동의 내용을 정보 주체에게 알린 동의의 의사 표시를 확인받고, 이에 관한사항을 녹취한다.",
      "유선상으로 동의 내용을 알리고 이후 회사 홈페이지를 통해 동의 사항을 확인하도록 한 뒤 전화로 동의를 받고 녹취한다.",
      "동의를 위한 문서를 이메일로 전달한 후 동의에 대한 의사 표시가 기재된 문서를 이메일로 받는다.",
      "개인정보 취급자가 직접 정보 주체를 만나 정보 수집에 대한 동의를 구두로 설명하고 난 뒤에 계약서를 작성한다."],
d : [5],
h : "구두로 동의를 받았다 하더라도 반드시 동의에 대한 내용이 계약서에 명시 되어야 하고, 이에 대한동의를 날인한 내역이 있어야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 회사가 직원 채용 시에 수집하는 정보에 대한 관리로 틀린 내용은?",
v : [ "직원 채용을 위해 서류 접수 시에 고유 식별 정보와 민감 정보를 수집하는 것은 원칙적으로 금지하여 주민등록번호 대신에 생년월일을 받도록 한다.",
      "국가 유공자 및 장애인 관련 우대 사항과 관련된 정보 수집 시에는 법령에서 명시하고 있으므로 별도 동의 없이 수집이 가능하다.",
      "지원서 접수와 채용 완료까지 업무 부하로 인해 단계별 정보의 구분 없이 필요한 범위 내에서 수집하고, 채용 완료 시 불합격자의 정보는 일괄 파기하도록 한다.",
      "회사 목적상 반드시 민감 정보의 수집이 필요한 경우 별도의 동의를 받도록 한다.",
      "합격자 발표 이후 채용 절차가 완료된 이후 모든 입사 지원 단계 시 수집된 정보는 지체 없이(5일 이내) 파기해야 한다."],
d : [3],
h : "개인정보의 수집 원칙상 최소한의 범위 내에서만 수집하도록 되어 있기 때문에 지원 단계와 채용 완료단계를 구분하여 불필요한 정보가 수집되지 않도록 해야 한다. 개인정보보호위원회 표준 개인정보보호지침 (제11조 제1항)의 내용을 참고하여 정당한 사유가 없는 한 5일 이내에 개인정보를 파기해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음은 정보통신제공자로서 무료 컨텐츠를 온라인으로 제공하는 사업을 하고 있는 ABC주식회사와 준용 사업자인 BCD 아카데미의 내부 관리 계획서 현황을 설명한 것이다. 이중서비스를 위해 수집하고 있는 주민등록번호에 대한 설명으로 틀린 것을 모두 고르시오.\n"
+"|(주)ABC 컨텐츠 내부 관리 계획서|\n"
+"|---|\n"
+"|작성자 : 정보보안팀 홍길동<br>작성일 : 2014년 11월 기준|\n"
+"|㉠ 2010년 5월 오픈한 홈페이지를 통해 회원 가입 시 아이디, 비밀번호, 이메일, 주민등록번호를 수집하고 있으며, 주민등록번호는 본인 확인을 위한 용도로만 사용하고 있다.<br>"
+"㉡ 주민등록번호는 2013년부터 보안이 더욱 강화된 양방향 암호화 알고리즘인 AES128을 적용하여 저장하고 있다.<br>"
+"㉢ 개인정보의 파기 계획서를 수립하여 2015년 12월까지 탈퇴 회원 및 가입일로부터 3년이 지난 회원에 대하여 분기별로 4회에 걸쳐 삭제할 계획이다.<br>"
+"㉣상기 관련한 법률 근거는 정보통신망법을 따른다.|\n\n"
+"|(주)BCD 아카데미 내부 관리 계획서|\n"
+"|---|\n"
+"|작성자 : 개인정보보호팀 전우치<br>작성일 : 2014년 12월 기준|\n"
+"|㉤ 2014년 2월 오픈한 홈페이지를 통해 회원 가입 시 아이디, 비밀번호, 이메일, 주민등록번호를 수집하고 있으며, 주민등록번호는 본인 확인을 위한 용도로 사용하고, 오프라인 신청서를 통해서 2009년부터 동일한 항목을 수집하고 있다.<br>"
+"ㅂ 주민등록번호는 외부 접속이 차단된 내부 망에 평문으로 저장하고 있으며, DB 위험도 분석을 실시한 결과 모든 요구 사항을 준수하고 있다.<br>"
+"ㅅ 개인정보의 파기 계획서를 수립하여 2016년 7월까지 수집한 주민등록번호를 삭제할 계획이다.<br>"
+"ㅇ 상기 관련한 법률 근거는 개인정보보호법을 따른다.|",
v : [ "㉠,㉢,㉤"
    , "㉠,㉢,ㅂ"
    , "㉠,㉤,ㅂ"
    , "㉢,㉤,ㅂ"
    , "㉢,ㅂ,ㅅ"],
d : [1],
h : "* 정보통신망법에서는 법률에서 명시한 경우를 제외하고 주민등록번호는 6개월간의 계도 기간을 거쳐 2013년 2월 18일부터 수집이 금지되었으며(2012년 8월 18일 시행), 기 수집한 주민등록번호는2014년 8월 17일까지 파기가 완료 처리 되었어야 한다.\n* 개인정보보호법상 주민등록번호는 2014년 8월 7일부터 수집이 금지되었으며, 2015년 2월 6일자로 계도 기간이 종료되었으며, 회원 가입 유무 확인을 위한 본인 확인은 주민등록번호가 아닌 아이핀(I-Pin) 등의 별도 수단을 제공해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 ○○ 비영리 법인의 업무 운영과 관련하여 법적으로 문제의 소지가 가장 큰 것은?\n"
+"○○법인은 기부금 납부 시 신청인의 성명, 주민등록번호를 신청서에 수집하고 있으며, 이후 기부금 영수증 신청 시에도 성명, 주민등록번호를 신청서를 통해서 수집하고 있다.\n"
+"|기부금 신청서|\n"
+"|:---:|\n"
+"1. 기부자의 성명 :\n"
+"2. 주민등록번호 :\n"
+"3. 기부액\n"
+"   1. 금액 :\n"
+"   2. 입금은행 입금자명 :\n"
+"   * ※ 개인정보보호법에 따라 상기 개인정보의 수집에 동의합니다.\n"
+"신 청 인 (인)\n\n"
+"|기부금 영수증 신청서|\n"
+"|:---:|\n"
+"1. 기부자의 성명 :\n"
+"2. 주민등록번호:\n"
+"3. 기부액\n"
+"   1. 금액 :\n"
+"   2. 입금은행 입금자명 :\n"
+"   * ※ 개인정보보호법에 따라 상기 개인정보의 수집에 동의합니다.\n\n"
+"신 청 인 (인)",
v : [ "기부금 영수증 수령과 관련하여 소득세법에 따라 성명, 주민등록번호, 주소 등의 개인정보를 동의 없이 수집할 수 있다.",
      "기부금 영수증 수령과 관련하여 개인정보 수집 시 주민등록번호를 받더라도 개인정보 수집에 대한 동의 이외에 별도 동의를 받지 않아도 된다.",
      "기부금 납부 시 신청인이 추후 영수증을 신청할 것을 대비하여 사전에 성명과 주민등록번호를 수집하는 것은 적절하다.",
      "기부금 영수증 수령과 관련하여 수집된 개인정보는 기부금 정산에 관한 업무 종료 이후 파기해야 한다.",
      "상기 신청서는 분실 및 도난 방지를 위하여 시건 장치가 있는 곳에 보관해야 한다."],
d : [3],
h : "기부금 납부 시 영수증 수령을 원하지 않는 경우 주민등록번호를 수집하는 것은 과도하기 때문에 상기 기부금 신청서 양식은 적절하지 못하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 XX동호회 활동 중 발생되는 개인정보의 처리에 관한 사항으로 틀린 것은?",
v : [ "동호회에 관련한 개인정보 처리 방침을 수립하고 게시해야 한다.",
      "동호회의 임원 중 개인정보보호 책임자를 반드시 지정할 필요는 없다.",
      "동호회 가입 시 이름과 연락처를 수집하여 PC에 보관하고 있는데 이때 암호화하여 저장하는 것이 바람직하다.",
      "XX동호회의 총무는 XX동호회 명단을 다른 XY동호회가 요청할 경우 별도의 XX동호회원의 동의 없이 제공할 수 없다.",
      "동호회에서 회원이 탈퇴를 하고자 할 경우 관련 정보를 즉시 파기하도록 한다."],
d : [1],
h : "개인정보보호법 제58조에 따라 동호회, 동창회 등 친목 도모를 위한 단체를 운영하기 위하여 개인정보를 처리하는 경우에는 개인정보의 수집 및 이용과 개인정보 처리 방침의 수립 및 공개. 개인정보보호 책임자의 지정에 대한 사항을 적용하지 않지만 개인정보보호법의 다른 규정은 준수해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보의 파기에 관한 설명으로 옳지 않은 것은?",
v : [ "개인정보보호법의 개정에 따라 정보통신서비스 제공자의 이용 기록이 없는 회원 가입 시 개인정보 유효 기간이 5년에서 3년으로 변경되었다.",
      "유효 기간이 지난 개인정보는 즉시 파기 또는 별도의 분리 저장을 해야 한다.",
      "개인정보 유효 기간 변경 시행일은 2015년 8월 18일부터 시행되었다.",
      "유효 기간이 경과한 개인정보는 일별로 확인하는 것이 바람직하며, 최대한 짧은 기간 단위로 주기적으로 검토하여 삭제해야 한다.",
      "온라인 회원 중 서면이나 전자문서 형태로 받은 가입 신청서도 유효 기간이 지난 것은 삭제해야 한다."],
d : [1],
h : "이용 기록이 없는 회원 가입 시 개인정보 유효 기간이 3년에서 1년으로 변경되어 주기적으로 대상 회원에 대한 파기 및 관리가 중요하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음은 개인정보에서 이용 내역의 통지 관련 예시 메일이다. 다음 내용을 참조하되 보기 중 옳지 않은 것은?\n\n"
+"〈○○사 '개인정보 이용 내역 통지' 안내〉\n"
+"안녕하십니까? 저희 ○○사를 항상 이용해 주셔서 감사합니다. 본사에서는 정보통신망법의 제30조의 2(개인정보 이용 내역의 통지)에 따라 회원님의 이용 내역을 다음과 같이 알려드립니다.\n"
+"* ※ 수집·이용 목적 및 수집한 개인정보\n"
+"1. 홈페이지 이용을 위한 회원 정보\n"
+"2. 배송 및 A/S 관리를 위한 회원 정보\n"
+"3. 멤버십 적립 및 공유에 필요한 회원 정보\n"
+"* ※ 개인정보 제3자 제공\n"
+"회원님께서 개인정보 제공에 동의한 내역은 다음과 같이 제휴 업체에 제공되고 있음을 알려드립니다.\n"
+"1. 제공 대상자 : AA사, BB사\n"
+"2. 업무 내용 : 회원 멤버십 적립을 위한 포인트 공유\n"
+"3. 제공 항목 : 고객명, 포인트 정보, 핸드폰 뒷 번호 4자리, 주소(상세 주소 제외)\n"
+"4. 제공 기간 : 고객의 정보 제공 동의 철회 또는 회원 탈퇴 시까지\n"
+"* ※ 개인정보 처리 위탁\n"
+"본사에서는 서비스 운영에 필요한 업무를 위해 회원님의 정보를 아래와 같이 위탁중입니다.\n"
+"|위탁 업체명|보유 기간|제공 정보|\n"
+"|:---:|:---:|:---:|\n"
+"|○○ 전산주식회사|회원 탈퇴 시까지만 보유함|회원 가입 정보|\n"
+"|○○택배사|배송 완료 시까지만 보유함|배송 정보|\n",
v : [ "통지 의무 대상은 전년도 말 기준 직전 5개월간 그 개인정보가 저장·관리되고 있는 이용자수가 일일 평균 100만명 이상이거나 정보통신서비스 부문 전년도(법인인 경우에는 전 사업연도를 말함) 매출액이 100억원 이상인 정보통신서비스 제공자 등이 해당된다.",
      "보기 내용에서 개인정보의 처리 위탁에 대한 내용 중 위탁 업무(홈페이지 운영, A/S 등)에 대한 내용을 알려주어야 한다.",
      "관련 근거는 정보통신망법 제30조의 2(개인정보 이용 내역의 통지)와 시행령 제17조(개인정보 이용 내역의 통지)에 따라 해당 업무를 수행하고 있다.",
      "통지 내역 중 수집하고 있는 개인정보의 항목을 알려주지 않고 있어 이에 대한 상세 내용을 기재해야 한다.",
      "통지 방법은 전자 우편·서면·모사전송·전화 또는 이와 유사한 방법 중 어느 하나의 방법으로 연 1회 이상 하여야 한다."],
d : [1],
h : "통지에 대한 의무 대상자는 전년도 말 기준 직전 3개월간 개인정보 이용자 수가 100만명 이상인 경우이거나 정보통신서비스 부문의 매출액 기준 100억원 이상인 기관에 해당한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 정보통신서비스 제공자가 영업의 양도를 위해 개인정보 관리 차원에서 조치해야할 사항으로 적절하지 않은 것은?",
v : [ "영업의 전부 또는 일부의 양도·합병 등으로 그 이용자의 개인정보를 타인에게 이전하는 경우에는 양도 이후 법에서 정한 사항을 인터넷 홈페이지 게시, 전자 우편 등 대통령 령으로 정하는 방법에 따라 이용자에게 알려야 한다.",
      "영업양수자 등은 개인정보를 이전받으면 지체 없이 그 사실을 인터넷 홈페이지에 게시하거나 전자 우편 등 대통령령으로 정하는 방법에 따라 이용자에게 알려야 한다.",
      "이용자가 개인정보의 이전을 원하지 아니하는 경우 그 동의를 철회할 수 있는 방법과 절차를 사전에 알려주어야 한다.",
      "영업양수자 등은 정보통신서비스 제공자 등이 이용자의 개인정보를 이용하거나 제공할 수 있는 당초 목적의 범위에서만 개인정보를 이용하거나 제공할 수 있으며, 목적 외 이용하려고 할 때에는 추가로 별도 동의를 받아야 한다.",
      "양도 시 이용자에게 알려주어야 할 정보는 개인정보를 이전받는 자(영업양수자)의 성명(법인 명칭), 주소, 전화번호 및 그 밖의 연락처가 될 수 있다."],
d : [1],
h : "영업의 전부 또는 일부의 양도·합병 등으로 그 이용자의 개인정보를 타인에게 이전하는 경우에는 미리 이용자에게 알려야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 병원에서 지켜야 할 개인정보의 준수 사항에 대한 설명으로 틀린 것은?",
v : [ "환자의 개인정보 수집 및 적용 시는 의료법을 적용한다.",
      "환자의 진료 기록부는 법률에 근거하여 10년 동안 보관해야 한다.",
      "의료법에 따라 개인정보를 수집하는 경우(진단서 발급 등)에는 별도 환자의 동의 없이 정보를 수집할 수 있다.",
      "환자가 자신의 개인정보를 삭제할 것을 요청하면 의료 기관은 지체 없이 파기하고, 이 사실을 환자 자신에게 통보하여야 한다.",
      "의료 기관 및 의료인은 전자 의무 기록을 안전하게 관리할 수 있도록 전자 의무 기록의 생성과 전자 서명을 검증할 수 있는 장비를 구축하여야 한다."],
d : [4],
h : "환자가 자신의 개인정보를 파기할 것을 요청하더라도 의료 기관은 법률에 따라 보존 기간이 넘지 않은 자료는 파기를 거부할 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 회사의 개인정보 파기에 대한 행위로 가장 적절하지 않은 것은?",
v : [ "○○사는 개인정보 파기 시 해당 업무를 위탁하고 있으면 이에 대한 보안 요구 사항을 계약서에 명시하고 있다.",
      "파기 업무 수행 시 ○○ 사 담당자는 파기 업무를 위탁 업체 담당자에게 일임하고, 별도의 감독 없이 파기 업무가 완료 후에 확인서를 수령하였다.",
      "○○파기 담당자는 년 1회씩 위탁 업체에 대한 개인정보보호 교육을 실시하고 있다.",
      "○○사 파기 담당자는 분기별로 위탁 업체에 대한 수탁사 개인정보보호 관리 실태 점검을 수행하고 그 내역을 보고하고 있다.",
      "○○ 사는 개인정보와 관련한 파기 담당자를 정/부로 임명하여 지정하고 있으며, 해당 업무에 대하여 주기적으로 감사를 실시하고 있다."],
d : [2],
h : "개인정보 파기에 관한 위탁 계약서를 작성하였다 하더라도 파기 담당자는 주기적으로 관리 및 감독을 수행해야 하며, 가능하면 파기 시 담당자와 대동하는 것이 바람직하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음의 개인정보 처리 방침과 회원 가입 절차에 대한 설명으로 틀린 것은?\n\n"
+"〈○○사 개인정보 처리 방침〉\n\n"
+"○○주식회사는 고객의 개인정보보호를 위하여 최선을 다하고 있으며, 정보통신망법 및 개인정보보호법을 준수하고 있습니다. 본사는 정보통신망법 제27조의2에 의거하여 「개인정보처리방침을 다음과 같이 수립하여 개인정보보호 정책을 운영하고 있습니다.\n"
+"1. 수집하는 개인정보 항목과 방법\n"
+"   * 가. 수집 항목 : (필수) 아이디, 비밀번호, 이름, 핸드폰 번호 / (선택) 직업, 주소, 성별, 환불 계좌\n"
+"   * 나. 개인정보 수집 방법 : 홈페이지, 서면 신청서 작성\n"
+"2. 개인정보의 수집 목적 : 온라인 ○○교육 강좌 이용\n"
+"3. 개인정보의 처리 위탁 및 제3자 개인정보 제공\n"
+"   * 가. 개인정보의 위탁\n"
+"|위탁사|위탁 업무|보유 및 이용 기간|\n"
+"|:---:|:---:|:---:|\n"
+"|○○ 전산주식회사|홈페이지 및 DB 서버 유지 보수|회원 탈퇴 시 또는 위탁 계약 종료 시|\n"
+"|XX인증기관|본인 확인(실명 및 아이핀 인증)|회원 탈퇴 시 또는 위탁 계약 종료 시|\n"
+"   * 나. 개인정보의 제3자 제공\n"
+"|제공 받는 자|이용 목적|제공하는 개인정보|보유 및 이용 기간|\n"
+"|:---:|:---:|:---:|:---:|\n"
+"|○○학원|강의 포인트 제휴|이름, 연락처, 멤버십 포인트|동의 철회 시|\n"
+"\n"
+"4. 개인정보에 대한 고객 및 법정 대리인의 권리 행사 방법\n\n"
+"(중략)\n\n"
+"5. 개인정보의 보유 및 이용 기간\n\n"
+"본사는 관련 법령에 따라 다음과 같이 보존 기간을 정하고 시행하고 있습니다.\n"
+"|||\n|---|---|\n"
+"|• 계약 또는 청약 철회 등에 관한 기록 : 5년<br>"
+"근거 : 전자상거래 등에서의 소비자 보호에 관한 법률<br>"
+"• 대금 결제 및 재화 등의 공급에 관한 기록 : 3년<br>"
+"근거 : 전자상거래 등에서의 소비자 보호에 관한 법률|"
+"* 소비자의 불만 또는 분쟁 처리에 관한 기록 : 5년<br>"
+"근거 : 전자상거래 등에서의 소비자 보호에 관한 법률<br>"
+"* 웹 사이트 방문 기록 : 3개월<br>근거 : 통신비밀보호법|"
+"\n\n"
+"6. 개인정보의 파기 절차 및 방법 (중략)\n"
+"7. 개인정보보호를 위한 기술적, 관리적 대책 (중략)\n"
+"8. 고객 문의\n"
+"|||\n|---|---\n"
+"|개인정보 관리 책임자<br>"
+"• 성명 : 강감찬(경영지원팀 팀장)<br>"
+"• E-mail : privacy1@00.kr<br>"
+"• 전화번호 : 02-119-0001|"
+"개인정보 관리 담당자<br>"
+"• 성명 : 남이수(경영지원팀 대리)<br>"
+"• E-mail : privacy2@00.kr<br>• 전화번호 : 02-119-0002|"
+"\n"
+"* 개인정보 신고 : KISA 개인정보침해신고센터(http://privacy.kisa.or.kr)\n"
+"\n"
+"9. 개인정보 처리 방침의 고지 또는 통지 방법\n\n"
+"개인정보 처리 방침은 매년 1회 이상 검토하며, 변경 시 공지 사항에 게시 7일전부터 고지합니다.\n* 개인정보 처리 방침 변경 일자 : 2013년 5월 3일<br>"
+"이전 개인정보 처리 방침 변경 일자 보러 가기\n\n\n"
+"〈○○사 회원 가입〉\n"
+"|| |\n"
+"|---|---|\n"
+"|이름| |\n"
+"|아이디| 중복 확인|\n"
+"|비밀번호|(영문자, 숫자, 특수 문자 포함 8자리 이상)|\n"
+"|핸드폰 번호||\n|집 전화번호||\n"
+"|직업||\n"
+"|주소|주소 찾기|\n"
+"|성별|남여|\n"
+"|환불 계좌|은행명/계좌|\n"
+"* 정보통신망법에 따라 상기 개인정보 수집에 동의합니다.\n\n"
+"[확인] [취소]\n\n"
+"(※ [확인] 버튼을 누르면 가입이 완료됩니다)\n\n"
+"---\n"
+"〈현황〉\n\n"
+"* 2015년 1월 1일자로 홈페이지 유지 보수 업체가 이미 주식회사로 변경되었다.\n"
+"* ○○ 주식회사는 온라인 강좌 서비스만을 제공하고 있다.",
v : [ "위탁 업체 변경이 있었음에도 개인정보 처리 방침이 개정되지 않았다. ",
      "회원 가입 시 필수 항목과 선택 항목을 구분하지 않았으며, 개인정보 처리 방침과 회원 가입 시의 수집 항목이 다르다.",
      "개인정보의 보유 기간은 관련 개별 법령에 따라 적절히 명시되었다.",
      "개인정보의 위탁 시 별도 동의를 받지 않았다.",
      "○○ 주식회사는 온라인 서비스 제공자로서 관련된 법률은 정보통신망법을 따르고 있으며, 추가적으로 개인정보보호법을 준수하고 있음을 명시하고 있다."],
d : [3],
h : "위탁 업체가 변경되었기 때문에 개인정보 처리 방침을 변경하여 공지하고, 위탁 업체와 제3자 제공에 대하여는 별도 동의를 받아야 하며, 개인정보의 보유 기간으로 소비자 분쟁 관련 기록은 3년, 대금결제에 관한 기록은 5년으로 변경해야 한다. 또한, 선택 항목의 경우 별도로 구분하여 표기하고 별도 동의를 받도록 해야 하며, 반복적으로 발생하는 경우가 아니라면 필요시에만 수집하도록 해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 공공 기관이 개인정보보호위원회에 등록해야 하는 개인정보 파일의 등록 사항으로 옳지 않은 것은?\n"
+"* ㉠ 개인정보 파일의 명칭\n"
+"* ㉡ 개인정보 파일의 운영 근거 및 목적\n"
+"* ㉢ 개인정보 항목\n"
+"* ㉣ 개인정보 처리 방법\n"
+"* ㉤ 개인정보 보유 기간 \n"
+"* ㅂ 개인정보 영향 평가의 대상 유무 여부\n"
+"* ㅅ 개인정보 파일 운용 공공 기관의 명칭\n"
+"* ㅇ 보유하고 있는 정보 주체의 수\n"
+"* ㅈ 개인정보 처리 업무 및 담당 부서\n"
+"* ㅊ 개인정보를 통상적, 반복적으로 제공할 때 제공받는 자\n"
+"* ㅋ CCTV 개인 영상 정보 파일\n"
+"* ㅌ 1회성 행사 수행 목적을 위해 운용하는 파일",
v : [ "㉡,ㅅ,ㅋ",
      "㉣,ㅅ,ㅋ",
      "㉤,ㅅ,ㅌ",
      "ㅂ,ㅋ,ㅌ",
      "ㅊ,ㅋ,ㅌ" ],
d : [4],
h : "개인정보 영향 평가의 대상. CCTV 개인 영상 정보 파일, 1회성 행사 수행 목적을 위해 운용하는 파일은 개인정보 파일의 등록 대상에서 제외된다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 개인정보 파일의 빈 칸에 들어갈 항목으로 옳은 것은?\n"
+"|기관명칭|부서|취급담당자|업무 분야|(㉠)|개인정보 파일의 운영 근거|개인정보 파일의 운영 목적|개인정보 파일에 기록되는 개인정보의 항목 정보 주체 (본인 등)|개인정보 파일에 기록되는 개인정보의 항목 (㉡)|개인정보의 처리 방법|개인정보의 보유기간|\n"
+"|---|---|---|---|---|---|---|---|---|---|---|\n"
+"|BCD공공기관|인사총무팀|이순신|경영지원|온라인교육생파일|표준 개인정보 보호지침|동영상 강의, 유료 회원 관리|웹 ID, 비밀번호, 메일, 성명| 해당없음|대표 홈페이지(온라인 가입)|(㉢)|\n"

+"\n\n|개인정보의 제공 및 위탁 사항|개인정보 처리 부서|열람 제한 사유 및 범위|\n"
+"|---|---|---|\n"

+"\n\n|제공받는 자|근거|개인정보의 범위|(㉣)|범위|공동 사용부서|개인정보 열람요구를 접수, 처리하는 부서|개인정보의 범위||사유|\n"
+"|---|---|---|---|---|---|---|---|---|---|\n"
+"|해당없음|해당없음|해당없음|20,000건|현업 및 전산실관리자|총무팀, 전산실|총무팀, 전산실|총무팀, 전산실|(㉤)|일방향암호화적용|\n",
v : [ "㉠ : 개인정보 파일의 명칭",
      "㉡ : 정보 주체의 생체 정보",
      "㉢ : 2년",
      "㉣ : 다른 개인정보 파일과 연계되는 정보 주체 수",
      "㉤ : 가입자의 이메일"],
d : [1],
h : "* ㉡ : 법정 대리인의 개인정보 등 정보 주체와 별도 항목이 적절하다.\n* ㉢ : 별도로 보관에 대한 기준이 없다면 상담 정보는 3년, 결제 관련 개인정보는 5년을 보관할 수 있다.\n* ㉣ : 개인정보 파일은 개별 개인 정보에만 해당되는 파일의 정보 주체 수를 말한다.\n* ㉤ : 일방향 암호화 대상은 비밀번호에 해당한다.\n* 개인정보보호법 제32조와 동법 시행령 제33조에서는 해당 항목(공공 기관의 명칭, 개인정보의 정보 주체 수, 처리 부서, 열람을 접수 및 처리하는 부서, 제한 사유 등을 명시하고 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보 파일 등록의 예외 사유가 아닌 것은?",
v : [ "국가 안전, 외교 비밀, 기타 국가의 중대한 이익 관련 파일",
      "범죄 수사 등 관련 파일",
      "창조 경제 구현을 위한 개방형 데이터 파일",
      "조세 범칙 행위, 관세 범칙 행위 조사 파일",
      "공공 기관 내부 업무 처리만을 위한 파일"],
d : [3],
h : "개인정보 파일 등록의 예외 사유로는 국가 안전, 외교 비밀, 기타 국가의 중대한 이익 관련 파일, 범죄수사 등 관련 파일, 조세 범칙 행위와 관세 범칙 행위의 조사 파일, 공공 기관 내부 업무 처리만을 위한 파일, CCTV 개인 영상 정보 파일, 1회성 행사 수행 등의 목적을 위해 운용하는 파일 등이 해당된다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 단체 소송을 제기하고자 하는 이유로 그 성격이 가장 관련이 없는 것은?\n"
+"|구분|내용|\n"
+"|---|---|\n"
+"|㉠|A사는 제휴 관계에 있는 B사로부터 받은 고객의 개인정보를 B사와 계약 관계가 없는 B사의 자회사 서버에 무단으로 전송하였다.|\n"
+"|㉡|B사의 직원은 노트북에 보안에 취약한 공개용 프로그램을 설치하였고, 이후 공개용 프로그램이 해킹당하면서 업데이트 시 본인의 노트북도 멀웨어에 감염되었으며, 이를 통해 외부 익명의 집단은 B사의 서버에 접속이 가능하였다.|\n"
+"|㉢|C사는 해커가 해외 서버를 경유하여 대리점의 보조 서버에 침투하여 고객의 정보를 유출하고, 협박을 통해 대가성 금액을 요구하였다.|\n"
+"|㉣|D사의 서버 유지 보수를 맡은 외주 업체 직원이 웹 하드 사이트를 통해 무료로 노트북에 영화를 다운로드한 후 악성 코드에 감염되었고, 이로 인해 범인들은 노트북을 들락거리며 각종 악성 프로그램을 심고 다음 공격 실행 시점까지 장기간 시스템 관리자 비밀번호, 고객 정보 등 대외비를 빼냈고, 서버의 데이터 삭제 및 도청 프로그램 등을 설치하였다.|\n"
+"|㉤|E사의 자회사 직원은 E사의 고객 정보 DB에 접근하여 E사의 개인정보를 자신의 업무용 컴퓨터에 복사한 뒤 DVD를 제작하여 블랙 마켓을 통해 유통하였다.|",
v : ["㉠","㉡","㉢","㉣","㉤"],
h : "단체 소송의 이유 및 쟁점은 다음과 같은 차이점이 존재한다.\n\n* ㉠ : 고객의 동의 없이 자회사에 제공한 점(목적 외 제공 관점)\n* ㉡~㉤ : 개인정보가 외부로 유출된 경위()기술적 보호 조치 적용 유무 및 유출 관점)",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보 처리 방침을 공개 및 게시할 수 있는 것으로 적절하지 않은 것은?",
v : [ "관보",
      "개인정보보호 연차보고서",
      "표준 개인 정보처리위탁 계약서(안)",
      "OO쇼핑몰 사무실",
      "홈페이지"],
d : [2,5],
h : "개인정보 처리 방침은 사업장, 관보(공공 기관 해당), 간행물 같은 제목으로 년 2호 이상 내용을 당야 함), 계약서 등에 포함시킬 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 전화를 통한 개인정보 수집 시 옳은 것은?\n"
+"* ㉠ 전화를 통해 개인정보를 수집하는 경우에는 '법정 고지 사항'을 '일상 대화 속도로 설명한다.\n"
+"* ㉡ 회사의 전화 요금 절감을 위해 법률에서 규제한 대로 1.5배의 속도로 동의에 대한수집 항목, 목적 등의 안내를 고객에게 하도록 한다.\n"
+"* ㉢ 기본 정보의 수집은 전화로 받고, 정보 수정 및 부가 서비스 가입 여부 등의 확인을 위해서는 홈페이지에 별도 회원 가입을 해서 확인하도록 한다.\n"
+"* ㉣ 보기 ㉢에서 동의를 받기 위해 약관 및 취급 방침에 대한 수집 동의를 청취하는 도중 실수로 전화 버튼을 누를 시 바로 동의한 것으로 처리되었다.\n"
+"* ㉤ 약관 및 취급 방침을 전화로 고지한 후 동의 여부를 물은 뒤 10초 이내에 답변이 없을 경우 동의한 것으로 처리되고 있다.\n"
+"* ㅂ 전화로 회원 가입을 하고 가입 여부를 확인하였으나 이후 즉시 탈퇴 의사를 밝혀 탈퇴 처리를 하였다.",
v : [ "㉠,㉡",
      "㉠,㉢",
      "㉠,ㅂ",
      "㉡,㉢",
      "㉡,ㅂ" ],
d : [3],
h : "회원 가입의 경로와 정보 수정, 탈퇴는 정보 주체가 용이하도록 해야 하며, 탈퇴 요청 시 즉시 처리할 수 있는 절차를 마련해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음은 해당 서비스에 따른 필수 동의 항목을 나타낸 것이다. 괄호 안에 내용 중 옳은 것은?\n"
+"|해당 서비스|본질적 기능|필수 동의 항목|\n"
+"|---|---|---|\n"
+"|인터넷 회원제 서비스|•회원에 대한 요금 조회, 상담(전화, 홈페이지 등), 서비스 신청, 서비스 포인트 적립 등<br>• 명의 도용 및 부정 이용 방지 등|아이디, 비밀번호 (㉠ OTP 코드), 성영, 생년월일, 이메일 등|\n"
+"|유료 서비스|구매한 상품 결제|결제수단 별 필요한 개인정보(계좌 번호, 카드번호 등)|\n"
+"|결재 및 배송 서비스|구매한 상품 결재 및 배송|계좌 번호, 카드 번호, 배송 정보 (㉡ 배송 주소지, 수령인 연락처 등)|\n"
+"|이동 통신사 서비스|• 휴대 전화 개통 서비스 제공 이용 요금 정산-고객 민원 상담 등<br>• 가입 의사 확인 및 명의 도용 방지 등 고객 관리|이름, 법정 생년월일, 휴대 전화 번호, (㉢ 단기 저장 데이터), 요금 결제 정보(계좌 번호, 카드 번호 등), 요금 청구지 주소 등|\n"
+"|소셜 네트워크 서비스|• 통신 및 정보 전달<br>• 친구 및 지인 추천 등|이름, 휴대 전화 번호, 주소록 지인) 등|\n"
+"|서비스 제공 과정에서의 법령 상 의무 이행|• 정당한 이용자인지 여부를 확인<br>• 연령에 따른 제한이 있는 경우 연령 확인"
+"|• 정보통신망법 제31조<br>- 만 14세 미만 여부 확인을 목적으로 (㉣ 주민등록 등본 수집)<br>- 법정 대리인 정보<br>• 전기통신사업법 제29조<br>- 요금 감면 대상자 확인을 위한 증명 서류<br>• 청소년보호법 제6조<br>- 유해 매체로부터 청소년 보호를 위한 법정 생년월일 및 본인 여부 확인 정보<br>• 게임 산업 진흥에 관한 법률 제12조의3<br>- 게임 중독 예방 조치 의무 이행을 의한 법정 생년월일 및 본인 여부 확인 정보<br>- (㉤ 제조자 정보)",
v : ["㉠","㉡","㉢","㉣","㉤"],
d : [2],
h : "* ㉠ : OTP 코드는 수집되는 정보가 아니다.\n* ㉢ : 단말기 저장 데이터 → 단말기 정보(기기 정보)\n* ㉣ : 주민등록 등본 법정 생년월일\n* ㉤ : 제조사 정보 법정 대리인 정보",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음은 정보통신 서비스 제공자인 ○○사의 홈페이지에서 회원 가입 단계에 따른 화면 예시이다. 밑줄 내용 중 옳은 것은?\n\n---\n"
+"### ○○ 사 홈페이지 회원 가입\n"
+"(중략)\n"
+"#### ※ 아래 이용 약관에 동의합니다. [ ]\n"
+"##### 제1조 (목적)이 약관은 ○○회사가 제공하는 XX서비스에 관한 이용에 대해 회사 및 회원의 권리와 의무, 책임, 기타 필요한 제반 사항을 규정함을 목적으로 합니다.\n\n(중략)\n"
+"#### ※ ㉠ (필수) 아래 개인정보 수집에 대해 동의합니다. [ ]\n"
+"##### 본사는 개인정보보호법 및 정보통신망법에 따라 다음과 같이 회원 정보를 수집 및 이용하고자 합니다.\n"
+"* ㉡ 수집 항목 : 아이디, 비밀번호, 이름, 핸드폰 번호\n"
+"* ㉢ 개인정보의 위탁 : 해당 개인정보의 처리를 위해 X사에 위탁하여 처리합니다.\n\n(중략)\n"
+"#### ※ (선택) 아래 개인정보 수집에 대해 동의합니다. [ ] \n"
+"㉣ 본 ○○사를 통해 수집한 정보는 광고 및 마케팅을 위해 사용되며 대행업체를 통해 이루어집니다.\n"
+"* 수집 항목 : 이름, 핸드폰 번호\n"
+"* 제공 기관 : MM사\n "
+"* 제공 목적 : 광고\n"
+"#### ※ ㉤ 상기 내용에 대해 모두 동의합니다. [ ]",
v : ["㉠","㉡","㉢","㉣","㉤"],
d : [2],
h : "* ㉠ : 위탁 시 별도의 동의를 받아야 한다.\n* ㉢ : 위탁 시 해당 위탁 업무의 내용도 명시해야 한다.\n* ㉣ : 제공 목적이 광고라고 하였으나 선택 항목 설명 시에는 광고 및 마케팅이 목적인 것으로 설명하고 있다.\n* ㉤ : 필수와 선택 항목에 대해 기본적으로 모두 동의한 것으로 체크되어 있는 것은 정보 주체가 선택하도록 한 취지에 어긋난다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보를 목적 외 이용 및 제공에 대한 설명으로 틀린 것은?",
v : [ "정보 주체로부터 별도의 동의를 받은 경우 기존에 수집한 목적 외 이용할 수 있다.",
      "다른 법률에 특별한 규정이 있는 경우 목적 외 이용할 수 있다.",
      "정보 주체 또는 법정 대리인이 의사 표시를 할 수 없는 상태에 있을 경우 해당된다.",
      "공공 기관이 개인정보를 목적 외 이용한 경우 개인정보의 목적 외 이용 및 제3자 제공 대장에 기록하고 이용한 날부터 15일 이내에 관보 또는 인터넷 홈페이지에 게재해야 한다.",
      "공공 기관이 개인정보를 목적 외 이용한 경우 관보에 게재해야 할 대상은 목적 외 이용을 등을 한 날짜, 법적 근거, 목적, 사용한 개인정보이다."],
d : [4],
h : "이용한 날부터 30일 이내에 관보 또는 페이지에 게재해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },
{
m : "다음 개인정보 처리 위탁에 관한 내용 중 틀린 것은?",
v : [ " 정보통신망법에서 개인정보의 처리 위탁 시 동의 획득에 대한 의무가 있지만 계약 이행이 필요한 때와 이용자의 편의 증진과 관련이 있을 경우 개인정보 처리 방침에 이를 공개하여 처리하면 동의를 받지 않아도 된다.",
      "정보통신망법에서 위탁 사실에 대해서는 공개의 의무가 있다.",
      "개인정보보호법에서는 개인정보 처리 시 법 위반이 발생한 경우 손해 배상 책임에 대하여는 수탁자를 개인정보처리자의 소속 직원으로 보지 않는다.",
      "개인정보보호법에서 개인정보의 업무 위탁 시 반드시 정보 주체의 동의를 받을 필요는 없다.",
      "개인정보보호법에서는 텔레마케팅 업무 위탁 시 위탁 업무의 내용과 수탁자를 정보 주체에게 고지하여야 한다."],
d : [3],
h : "개인정보보호법상 수탁자에 의해 법 위반이 발생한 경우 위탁자인 개인정보 처리 (기관)는 수탁자를 직원으로 보고 그에 대한 책임을 지도록 하고 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보보호법에서 말하는 제3자 제공과 처리 위탁에 대한 설명으로 옳지 않은 것은?",
v : [ "법률은 제3자에 대한 제공 및 제3자에 대한 처리 위탁을 각각 별도로 규정하고 있다.",
      "개인정보에서 제3자 제공이란 개인정보를 제공받는 자(제3자)의 목적을 위해 개인정보를 제3자에게 제공하는 것을 말한다.",
      "개인정보 처리 위탁이란 사업자의 목적을 위해 개인정보의 수집·처리·이용 등의 업무를 제3자에게 위탁하는 것을 말하며, 수탁자를 정보 주체가 쉽게 알 수 있도록 공개해야 한다.",
      "개인정보를 제3자에게 제공하는 경우에는 제공받는 자의 이용 목적을 알리고 동의를 받아야한다.",
      "개인정보의 처리 업무 중 홍보 및 판매를 권유하는 업무를 위탁하는 경우에는 처리 위탁을 하는 업무 내용을 정보 주체에게 알리고, 홈페이지 등에 공개해야 한다."],
d : [5],
h : "개인정보를 마케팅 등과 같은 수집 목적과는 그 취지가 다른 목적으로 수집할(위탁, 제공) 경우에는 반드시 별도 동의를 받아야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음의 설명 중 옳은 것으로 연결된 것을 모두 고르시오.\n"
+"* ㉠ 제3자는 이용자로부터 동의를 받고, 개인정보를 수집한 해당 사업자를 제외한 모든 법인, 단체 등을 의미한다.\n"
+"* ㉡ 같은 그룹 내부의 계열사라 하더라도 별도의 법인에 해당 한다면 제3자 또는 위탁의 대상이 될 수 있다.\n"
+"* ㉢ 그룹 계열사 간이라도 패밀리 사이트라는 명목으로 개인정보를 제공·공유하기 위해서는 제3자 제공에 따른 사항을 알리고 동의를 얻어야 한다.\n"
+"* ㉣ 정보통신 서비스 제공자 등은 정보통신 서비스의 제공에 관한 계약을 이행하기 위한 업무를 위탁할 경우 해당 내역을 홈페이지에 공개하거나 이용자에게 알린 경우 개인정보의 처리 위탁에 따른 고지 절차와 동의 절차를 거치지 않을 수 있다.\n"
+"*   위탁이란 개인정보처리자가 관련 이익을 창출하기 위해 업무를 수탁자에게 위탁하는 것이고, 제3자 제공은 개인정보처리자의 이익이 아닌 제3자의 목적을 위해 개인정보를 제공하는 것이다.",
v : [ "㉠,㉡,㉢",
      "㉡,㉢,㉤",
      "㉠,㉡,㉢,㉤",
      "㉡,㉢,㉣,㉤",
      "㉠,㉡,㉢,㉣,㉤" ],
d : [5],
h : "이용자로부터 동의를 받고, 개인정보를 수집한 해당 사업자를 제외한 모든 법인, 단체 등은 위탁과제3자 제공자가 될 수 있으며, 계열사도 별도 법인인 경우 위탁 또는 제3자 제공의 대상자가 계약에 따라 성립될 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 영상 정보 처리 기기 운영자가 개인 영상 정보를 수집 목적 이외로 이용하거나 제3자에게 제공할 수 있는 경우가 아닌 것은?",
v : [ "정보 주체에게 동의를 얻은 경우",
      "다른 법률에 특별한 규정이 있는 경우",
      "통계 작성 및 학술 연구 등의 목적을 위하여 필요한 경우",
      "법원의 재판 업무 수행을 위하여 필요한 경우",
      "조약, 그 밖의 국제 협정 이행을 위하여 외국 정부 또는 국제기구에 제공하기 위하여 필요한 경우"],
d : [3],
h : "개인정보보호법 제18조(개인정보의 목적 외 이용·제공 제한)에서는 목적 외 제공할 수 있는 예외 사항으로 \"통계 작성 및 학술 연구 등의 목적을 위하여 필요한 경우로서 특정 개인을 알아볼 수 없는 형태로 개인 영상 정보를 제공하는 경우\"라는 단서 조항을 두고 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 표준 개인정보보호 지침에 따른 보유 기간의 책정 기준이 틀린 것은?",
v : [ "영구 : 국민의 지위, 신분, 재산을 증명하기 위해 운용하는 개인정보 파일 중 영구 보존이필요한 개인정보 파일",
      "30년 : 국민의 신분 증명 및 의무 부과, 특정 대상 관리 등을 위하여 행정 기관이 구축하여 운영하는 행정 정보 시스템의 데이터 셋으로 구성된 개인정보 파일",
      "10년 : 관계 법령에 따라 5년 이상 10년 미만의 기간 동안 민·형사상 또는 행정상의 책임 또는 시효가 지속되거나 증명 자료로서의 가치가 지속되는 개인정보 파일",
      "3년 : 각종 증명서 발급과 관련된 개인정보 파일(단, 다른 법령에서 증명서 발급 관련 보유기간이 별도로 규정된 경우 해당 법령에 따름)",
      "1년 : 상급 기관(부서)의 요구에 따라 단순 보고를 위해 생성한 개인정보 파일"],
d : [2],
h : "__2__번에 대한 사안은 준 영구 보관하도록 하고 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보의 위탁 관리에 대한 설명으로 가장 적절하지 않는 것은?",
v : [ "개인정보 관리를 업무상 위탁하는 경우는 반드시 이에 대한 관리·감독을 해야 한다.",
      "개인정보를 위탁한 회사(개인정보처리자)는 수탁 기관으로부터 기술적 보호 조치에 대한확인 문서를 받는 것도 관리·감독의 일환이 될 수 있다.",
      "위탁 기관은 개인정보에 관련된 법적 문제가 발생될 경우 이에 대한 책임을 지되, 수탁 기관의 위반 행위에 대한 구상권을 청구할 수 있다.",
      "개인정보 처리 업무를 위탁받은 수탁 기관도 개인정보를 처리하는 기관으로서 개인정보책임자와 개인정보 취급자를 지정하고, 이에 대한 적절한 권한과 직무를 부여해야 한다.",
      "위탁 기관은 수탁자와 계약 시 재위탁에 관한 금지 항목을 면밀히 검토해야 한다."],
d : [2],
h : "개인정보처리자가 위탁사에 관리·감독에 대한 확인서를 받더라도 직접 주기적인 방문 및 현장 실사를 하는 것이 바람직하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 회사가 내부 직원의 정보를 아웃소싱 업체에 위탁할 경우 준수해야 할 사항으로 옳지 않은 것은?",
v : [ "직원 정보의 처리를 위해 업무 위탁 시 직원에게 개별적인 동의를 받아야 한다.",
      "위탁 계약 시 업무 외 활용 금지, 기술적 보호 조치, 재위탁 제한, 수탁사의 의무 위반 시 손해 배상 등의 내용을 포함해야 한다.",
      "위탁 업무와 수탁사에 관한 사항을 직원들만 접속할 수 있는 그룹웨어 공지나 내부 게시판에 공개해야 한다.",
      "수탁사에 대한 관리·감독을 주기적으로 실시하고, 필요시 현장 방문을 실시하거나 점검결과를 서면으로 받도록 한다.",
      "개인정보보호 교육 시 수탁사의 취급자를 포함하여 교육을 실시한다."],
d : [1],
h : "개인정보보호법상 개인정보의 업무 위탁 시에는 반드시 동의를 받을 필요는 없으나 정보 주체가 쉽게 확인할 수 있도록 공개해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음은 특정 정보통신 서비스 제공자의 홈페이지를 이용 중인 회원 정보의 데이터베이스를 조회한 내역이다. 아래 조회 결과를 보고 조치해야 할 것으로 옳은 것은?\n"
+"* XX회원 정보 테이블 (조회 날짜 : 2015년 8월 18일)\n"
+"* 가입일 최근 접속일 : 2001-01-01은 2001년 1월 1일을 말함\n"
+"|이름|아이디|비밀번호|가입일|최근 접속일|탈퇴 유무|비밀번호 변경일|\n"
+"|---|---|---|---|---|---|---|\n"
+"|홍길동|Hong  |********|2001-09-01|2014-06-08|N|2014-02-01|\n"
+"|전우치|Jun007|********|2005-02-28|2015-05-04|N|2014-10-07|\n"
+"|강감찬|Kangs |********|2010-10-09|2015-04-17|N|2015-02-11|\n"
+"|이순신|Leesi |********|2004-08-01|2014-11-11|N|2013-12-31|\n"
+"|이황  |hwnag |********|2007-11-28|2014-07-30|N|2013-11-30|\n"
+"|이성계|Isg900|********|2012-03-08|2015-03-11|Y|2014-03-17|\n"
+"|최치원|choiPO|********|2008-01-29|2015-01-27|N|2014-04-01|\n"
+"|김홍도|HDO5  |********|2011-12-11|2014-12-30|N|2012-02-12|\n"
+"|안창호|Ahnse |********|2013-05-19|2015-04-01|Y|2013-03-03|",
v : [ "탈퇴자 회원 2명(이성계, 안창호)은 다시 로그인 할 수 없도록 비밀번호를 강제로 변경한다.",
      "회원의 비밀번호를 반드시 6개월 주기로 변경하도록 강제화해야 한다.",
      "최근 접속일이 현재 날짜(DB를 조회한 날짜)를 기준으로 1년이 지난 2명의(홍길동, 이황)회원 정보를 분리하여 보관하거나 파기해야 한다.",
      "식별 정보인 아이디를 비밀번호와 같이 암호화 처리하여 저장해야 한다.",
      "최근 3년 이내로 비밀번호를 변경하지 않은 계정은 휴면 처리를 해야 한다."],
d : [3],
h : "탈퇴 회원은 반드시 지체 없이 파기해야 하며, 1년 이상 장기 미접속 회원은 파기하거나 분리 및 보관하여야 한다. 단, 파기 시 전자상거래법 등 타 법률에서 보관 기관을 별도로 명시한 사항은 해당법률에 따라 보관할 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 법률에서 규정하고 있는 과징금과 과태료의 내용이 잘못된 것은?",
v : [ "개인정보보호법에서는 주민등록번호의 분실, 도난, 유출, 변조, 훼손 시 개인정보처리자에게 5억원 이하의 과징금을 부과할 수 있다.",
      "개인정보보호법에서는 개인정보를 불법으로 수집, 이용, 제공, 도난, 유출, 훼손 등을 발생할 경우 정보통신 서비스 제공자에게 매출액의 1% 내에서 과징금을 부과할 수 있다.",
      "개인정보보호법에서는 개인정보의 파기 위반 시 2천만원 이하의 벌금을 부과할 수 있다. ",
      "개인정보보호법에서는 개인정보의 불법 수집 시 5천만원의 과태료를 부과할 수 있다.",
      "개인정보보호법에서는 개인정보의 유출 발생 시 개인에게 법정 손해 배상금을 300만원 이내에서 배상하도록 하고 있다."],
d : [2],
h : "개인정보 유출시 기업은 매출액의 3%내에서 과징금 처분을 받을 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 법률에서 명시하고 있는 개인정보 보유 기간에 대한 내용으로 옳지 않은 것은?\n"
+"|관련 법률|목적|수집 항목(예시)|보유 기간|\n"
+"|---|---|---|---|\n"
+"|개인정보보호법(정보통신서비스 제공자)|정보통신 서비스의 유효기간제 적용|회원 가입 정보 등|㉠ 1년|\n"
+"|전자상거래법|표시·광고에 관한 기록|표시·광고에 관한 기록|㉡ 6개월|\n"
+"|전자상거래법|소비자 불만, 분쟁 처리|소비자 식별 정보 분쟁 처리 기록|㉢ 5년|\n"
+"|전자상거래법|계약, 청약 철회 등|소비자 식별 정보 계약/청약철회 기록|㉣ 3년|\n"
+"|통신비밀보호법|법원의 영장을 받아 수사 기관의 요청 시 제공|웹 사이트 방문 기록(로그 기록, IP 등)|㉤ 3개월|\n"
+"|통신비밀보호법|법원의 영장을 받아 수사 기관의 요청 시 제공|전기통신 일시, 발신 기지국의 위치 추적 자료 등|ㅅ 12개월|\n"
+"|전자금융거래법|전자금융거래에 관한 기록|전자금융거래에 관한 정보|ㅇ 3년|",
v : [ "㉠,㉡,㉢",
      "㉠,㉡,㉣",
      "㉡,㉢,㉣",
      "㉢,㉣,㉤",
      "㉢,㉣,ㅇ" ],
d : [5],
h : "소비자 식별 정보 분쟁 처리 기록은 3년, 소비자 식별 정보 계약/청약 철회 기록은 5년, 전자금융거래에 관한 기록 정보는 5년을 각각 보관할 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음은 ABC-ALPA 회사가 XYZ사에게 영업의 양도를 위해 고객들에게 개인정보 이전 관련 안내 메일을 보낸 것이다. 잘못된 것은?\n\n"
+"--- \n"
+"#### 〈개인정보 이전 안내〉\n\n"
+"안녕하세요~ 고객님!\n\n"
+"그 동안 저희 ABC회사를 이용해 주셔서 대단히 감사드립니다. 본사에서는 그 동안 고객님께 최선을 다해 서비스를 제공하고자 노력하였으나 내부 사정상사업의 연속성이 어려운 관계로 아래와 같이 ABC-001 서비스 관련 사업을 양도하고자 합니다. 다시 한 번 양해를 부탁드리며, 귀 가정에 무궁한 안녕이 있으시길 기원합니다.\n"
+"##### -아 래 -\n"
+"* ㉠ ABC-001 서비스 종료 및 양도로 개인정보 이전 : 00월 00일까지만 사이트 이용이 가능함\n"
+"* ㉡ 이전할 개인정보 : 온라인 회원 가입 정보, 결제 정보, 상담 이력\n"
+"* ㉢ 개인정보 양수자 : 본사 계열사\n"
+"* ㉣ 이전에 대한 동의 철회 방법 : 홈페이지에 로그인한 후 마이 메뉴) 탈퇴 신청 또는 팝업창(영업 양도 안내 페이지)에 동의 안 함 체크하기\n"
+"#### ABC-ALPHA 주식회사 대표이사 배상",
v : [ "㉠","㉡","㉢","㉣","해당 없음"],
d : [3],
h : "양수자가 양도를 하였다면 해당 개인정보를 양도받은 회사에 대해 명확하게 고지하거나 통지하여한다. 고지 또는 통지해야 할 내용은 세 가지(1 개인정보를 이전하려는 사실, 2. 개인정보를 이전받는 자(이하 \"영업양수자등\"이라 한다)의 성명(법인의 경우에는 법인의 명칭)·주소·전화번호 및 그밖의 연락처, 3. 이용자가 개인정보의 이전을 원하지 아니하는 경우 그 동의를 철회할 수 있는 방법과 절차)이다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 영상 정보의 파기에 관한 설명으로 가장 적절하지 않은 것은?",
v : [ "영상 정보 처리 기기에 의하여 수집된 영상 정보는 보유 기간이 만료된 후 지체 없이 삭제하여야 한다.",
      "해당 사업 등의 특성에 따라 보유 목적의 달성을 위한 최소한의 기간 산정이 곤란한 때에는 보유 기간을 영상 정보의 수집 후 30일 이내로 한다.",
      "영상 정보 처리 기기 운영자가 개인 영상 정보를 파기하는 경우에는 개인 영상 정보 파일명, 파기 일시(자동 삭제 시는 파기 주기 및 자동 삭제 여부에 대한 확인 시기), 영상 정보파기 담당자를 기록하고, 관리하여야 한다.",
      "파기 시 행안부의 표준 개인정보보호 지침의 ''개인 영상 정보 관리 대장'을 활용하여 기록할 수 있다.",
      "영상 정보 처리 기기에 저장 파일은 삭제 전 사후 감사 및 추적을 위해 반드시 백업을 실시해야 한다."],
d : [5],
h : "영상 정보는 회사에서 정하고 공표한 보관 기간에 맞게 보관하는 것이 적절하다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보보호법에서 규정한 개인정보의 국외 이전과 관련하여 옳은 것을 모두 고르시오.\n"
+"* ㉠ 정보통신 서비스 제공자 등은 이용자의 개인정보를 국외로 이전하려면 이용자의 동의를 받아야 한다.\n"
+"* ㉡ 정보통신 서비스 제공자 등은 제2항에 따른 동의를 받으려면 미리 다음 각 호의 사항 모두를 이용자에게 고지하여야 한다.\n"
+"    * 이전되는 개인정보 항목\n"
+"    * 개인정보가 이전되는 국가. 이전 일시 및 이전 방법\n"
+"    * 개인정보를 이전받는 자의 성명(법인인 경우에는 그 명칭 및 정보관리 책임자의 연락처를 말함)\n"
+"    * 개인정보를 이전받는 자의 개인정보 이용 목적 및 보유·이용 기간\n"
+"* ㉢ 개인정보를 국외로 이전하는 경우에 하여야 하는 보호 조치\n"
+"    * 개인정보보호를 위한 기술적·관리적 조치\n"
+"    * 개인정보 침해에 대한 고충 처리 및 분쟁 해결에 관한 사항\n"
+"    * 그 밖에 이용자의 개인정보보호를 위하여 필요한 조치\n"
+"* ㉣ 정보통신 서비스 제공자 등은 제1항 각 호의 사항을 개인정보를 국외에서 이전받는 자와 미리 협의하고, 이를 계약 내용 등에 반영하여야 한다.\n"
+"    * 개인정보보호를 위한 기술적·관리적 조치\n"
+"    * 개인정보 침해에 대한 고충 처리 및 분쟁 해결에 관한 사항\n"
+"    *그 밖에 이용자의 개인정보보호를 위하여 필요한 조치\n",
v : [ "㉠",
      "㉠,㉡",
      "㉠,㉡,㉢",
      "㉠,㉡,㉣",
      "㉠,㉡,㉢,㉣"],
d : [5],
h : "정보통신 서비스 제공자 등 이용자의 개인정보를 국외로 이전 시 동의를 받으려면 미리 다음의 사항을 이용자에게 고지하여야 하며, 제15조에 따라 개인정보보호를 위한 기술적·관리적 조치를 취해야 한다.\n* 이전되는 개인정보 항목\n* 개인정보가 이전되는 국가, 이전 일시 및 이전 방법\n* 개인정보를 이전받는 자의 성명(법인인 경우에는 그 명칭 및 정보관리책임자의 연락지를 말한다.)\n* 개인정보를 이전받는 자의 개인정보 이용 목적 및 보유·이용 기간",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 A사와 B사의 관계에 대한 설명으로 옳지 않은 것은?\n"
+"|계약 관계<br>※ 위탁사 → 수탁사|A사|B사|\n"
+"|---|---|---|\n"
+"|㉠ A → B|'007' 서비스 운영 및 부가 서비스 제공|A사의 '007' 서비스 관련 회원 정보 유효 기간 처리 대행|\n"
+"|㉡ A → B|'007' 서비스 운영 및 부가 서비스 제공|B사의 '220' 서비스를 위한 전화 홍보에 소사개인정보 활용|\n"
+"|㉢ A ↔ B|'337' 서비스 운영 및 '337' 서비스 홈페이지 로그인 후 '338' 서비스에 접속 가능|338' 서비스 운영 및 338' 서비스 홈페이지에 로그인한 후 'SIT 서비스에 접속 가능2|\n"
+"|㉣ A ← B|'사사구' 서비스 주문 회원 택배 배송|'사사구' 서비스 운영|",
v : [ "㉠은 A가 위탁사, B가 수탁사에 해당한다.",
      "㉡은 A가 B에 업무를 위탁 및 제공한 경우에 해당한다.",
      "㉢은 상호 제휴 관계에 있다고 할 수 있으며, 제3자 제공에 해당한다.",
      "㉠은 A의 업무 매출과 직접적인 관련이 있으며, ㉡은 B의 업무 매출과 직접적인 관련이 있다.",
      "㉣은 A가 수탁사, B가 위탁사에 해당한다."],
d : [2],
h : "㉡은 'A가 B에 업무를 위탁 및 제공'한 것이 아니라 'A가 B에 업무를 제3자 제공'한 것으로 검무 위탁과 제3자 제공이 다른 것임을 알아야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 정보통신서비스 제공자의 온라인 회원에 대한 파기 정책으로 올바른 것은?\n"
+ "* ㄱ 법에 의해 1년 또는 이용자가 선택한 기간으로 선택이 가능하다.\n"
+ "* ㄴ 유효 기간이 지난 회원 정보는 삭제 또는 분리·보관한다.\n"
+ "* ㄷ 유효 기간이 만료된 회원 정보가 분리·보관되고 있는 경우 기 회원은 재접속하여 휴면상태를 해제할 수 있다.\n"
+ "* ㄹ 휴면 회원이 상태를 해제하기 위해서 최소한의 인증 정보를 기존 DB 또는 분리 DB에 보관할 수 있다.\n"
+ "* ㅁ 휴면 회원의 DB가 분리된 이후에는 최소한의 업무 담당자(관리자 등)만 접속할 수 있도록 통제해야 한다.",
v : [ "ㄱ,ㄴ,ㄷ"
    , "ㄱ,ㄴ,ㄹ"
    , "ㄴ,ㄷ,ㄹ"
    , "ㄱ,ㄴ,ㄷ,ㅁ"
    , "ㄱ,ㄴ,ㄷ,ㄹ,ㅁ" ],
d : [5],
h : "정보통신망법의 유효 기간제에 대한 설명이며, 모두 맞는 내용으로 해당 순서대로 적용 절차를 적용할 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 정보통신서비스 제공자의 파기에서 기간 산정의 내용으로 틀린 것은?\n"
+ "* ㄱ 가입 후 특별한 법률 및 예외 사항이 없는 경우는 1년 이상 미접속한 경우에 해당한다.\n"
+ "* ㄴ 회원으로 승인된 이후 결제가 발생한 경우와 휴면 처리 시점에 고객 센터를 통해 상담이력이 있는 경우 휴면 해제와 보존 기간 등과 관련한 법률의 적용 이슈가 존재할 수 있다.\n"
+ "* ㄷ 유효 기간이 도래하기 전 휴면 처리 및 파기에 관한 통지 기간은 15일이 기본이며, 정보주체가 요청할 경우 30일로 산정한다.\n"
+ "* ㄹ 신제품에 대한 경품 이벤트에 참여한 회원 및 관련 정보는 3개월로 한다.",
v : [ "ㄱ,ㄴ"
    , "ㄴ"
    , "ㄱ"
    , "ㄷ,ㄹ"
    , "ㄴ,ㄷ,ㄹ" ],
d : [4],
h : "유효 기간은 도래하기 전 30일 이내에 통지해야 하며, 경품 등 이벤트의 경우에는 이벤트 행사 완료 즉시 삭제 처리해야 한다. 유효 기간은 법에 의해 1년 또는 이용자가 선택한 기간으로 설정이 가능하다(정보통신망법 시행령 제16조). 또한, 유효 기간이 도래한 휴면 회원에 대한 통지 방법은 이메일, SMS, 홈페이지의 개인정보 처리 방침에 게시할 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음의 사건 중 그 성격이 다른 하나로 단체 소송 이슈가 가장 크게 발생할 수 있는 것은?",
v : [ "2003년 1월 25일 인터넷 망이 마비된 사건으로 M사에서 SQL 서버의 허점을 이용하는 슬래머 웜이 그 주범으로 밝혀졌다. 본 사건은 슬래머 월에 감염된 PC'들이 대량의 데이터를 생성해 ○○ 전화국에 있는 DNS 서버에 인터넷 트래픽을 집중시키면서 시작되었다. ○○전화국이 공격에 의해 마비되자 인터넷 트래픽이 다른 백본망을 우회하기 시작하며, 다른DNS 서버도 순차적으로 마비되어 갔다.",
      "2009년 7월 7일을 기점으로 대한민국과 미국의 주요 정부 기관, 포털 사이트, 은행 사이트 등이 분산 서비스 거부 공격을 받아 서비스가 일시적으로 마비된 사건이다. 공격은 수단게를 거쳐 변형적으로 발생하였다. 처음에는 미국 사이트들을 대상으로 발생되었으나 이후대한민국에 발생하였다. 공격에 사용된 웜 중 일부에서 하드 디스크를 파괴하는 코드가 발견되었으며, 피해가 발생한 PC는 하드 디스크의 마스터 부트 레코드가 손상되어 부팅이 불가능하게 될 수도 있었다.",
      "2011년 3월 3일을 기점으로 대한민국의 주요 정부 기관, 포털 사이트, 은행 사이트 등을 분산 서비스 거부 공격(DDOS)을 통해 일시적으로 두 차례 마비시킨 사건이다. 이는 2009년에 일어난 7.7 분산 서비스 거부 공격보다 진화된 형태이다. 악성 코드는 개인 대 개인(P2P) 파일 공유 사이트에 올라온 일부 파일에 삽입되어 유포되었고, 하드 디스크가 파괴되도록 프로그래밍이 되어 있었다.",
      "2013년 3월 20일 대한민국의 주요 언론과 기업의 전산망이 마비되고, 다수의 컴퓨터가 악성 코드에 감염되어 피해를 입은 사건이다. 마스터 부트 레코드와 볼륨 부트 레코드가 파괴되어 컴퓨터가 부팅되지 않았다. 주요 언론사 PC도 피해를 입었다. 또한, K사는 이 날 전산망 복구를 위해 홈페이지를 전면 차단하여 외부와 격리시켰다. 은행과 은행의 전산망이 장애를 일으켰고, N은행도 일부 PC에서 문제를 일으켜 유선 케이블을 분리하였다.",
      "2013년 6월 경 ○○ 신용평가사 직원 한 명이 카드사로 파견을 나가 주요 카드사의 고객인 정보를 유출시켜 대출 광고업자와 대출 모집인에게 정보를 넘겼다. 하지만 가드사는 개월 동안 인지를 못하였다가 2014년 1월에 검찰의 발표로 알려지게 되었다. 그리고 ○○ 신용평가사 직원과 정보를 구입한 대출 광고업자를 검찰에 구속 기소하고, 정보를 구입한 대출 모집인을 불구속 기소하였다."],
d : [5],
h : "카드 3사의 사상 초유의 대량 개인정보 유출과 관련하여 고객의 소송 이슈가 발생할 수 있었던 사연이며, 다른 보기의 내용은 서비스 장애 및 악성 코드 감영으로 인한 PC의 장에 및 삭제와 관리자적으로 있다고 할 수 있다.",
k : "3과목. 개인정보 라이프 사이클 관리" },


{
m : "다음 중 정보통신망법에서 명시하고 있는 벌칙, 과징금, 과태료의 정의 및 관계에 대한 설명으로 옳지 않은 것은?",
v : [ "벌칙이란 법률상의 의무 위반자에 대하여 일정한 형벌 또는 과태료에 처하게 됨을 예고함으로써 심리적인 압박을 가하여 법률상의 의무 위반을 예방하고, 아울러 의무 위반이 있는 경우에는 예정된 형벌 또는 과태료를 부과하는 근거가 되는 규정이다.",
      "과징금이란 행정법상의 의무를 위반한 자에게 경제적 이익이 발생한 경우 그 이익을 박탈하여 경제적 불이익을 부과하는 제도이다.",
      "형사 처벌이 아닌 행정 제재가 가능한 경우 과태료 부과 등을 할 수 있다.",
      "정보통신망법에 따라 과학기술정보통신부는 전기통신사업자를 대상으로 과징금을 부과할 수 있는 권한을 규정하고 있다.",
      "과태료 부과만으로는 대량의 개인정보가 침해된 행위에 대하여 실효적으로 대응하기 어려워 불법 개인정보의 오남용에 대한 제재 수준을 높이기 위해 과징금 제도가 도입되었다."],
d : [4],
h : "정보통신망법에 따라 전기통신사업자를 대상으로 과징금을 부과할 수 있는 권한을 가지고 있는 기관은 \"과학기술정보통신부\"가 아니라 \"방송통신위원회\"이다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 법률에 따라 과징금이 부과되는 경우가 아닌 것은?\n"
+" * ㄱ 이용자 동의 없는 개인정보, 민감 정보 수집\n"
+" * ㄴ 개인정보 처리 위탁 사실 미공개\n"
+" * ㄷ 이용자에게 동의 받은 목적 외로 개인정보 이용\n"
+" * ㄹ 이용자 동의 없는 제3자 제공\n"
+" * ㅁ 계약 이행을 위해 반드시 필요하지 않은 개인정보 처리 업무 위탁\n"
+" * ㅂ 기술적, 관리적 보호 조치 미이행\n"
+" * ㅅ 기술적, 관리적 보호 조치 미비로 개인정보가 분실, 도난, 누출, 변조, 훼손된 경우\n"
+" * ㅇ 법정 대리인의 동의 없이 아동의 개인정보를 수집하는 경우",
v : [ "ㄱ,ㄴ",
      "ㄱ,ㅂ",
      "ㄴ,ㅁ",
      "ㄴ,ㅂ",
      "ㅂ,ㅇ" ] ,
d : [4],
h : "* 보기의 항목에서 ㄴ과 ㅂ은 과태료에 해당되며, 과징금은 금전적 제재 수단이라는 점에서 벌금이나 과태료와 유사하다.\n* 과태료 : 행정 기관에 대한 협조 의무 위반에 대하여 부과하거나 경미한 형사 사범에 대한 비범죄화 차원에서 부과하는 것이다.\n* 과징금 : 일반적으로 법규 위반으로 얻어진 경제적 이익을 환수하거나 영업 정지 처분을 갈음하여 금전적 제재를 부과하는 것이다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 법률에 따라 과태료가 부과되는 경우가 아닌 것은?\n"
+"* ㄱ 개인정보 처리 위탁 사실 미공개\n"
+"* ㄴ 영업 양도 등 미통지\n"
+"* ㄷ 개인정보 관리 책임자 미지정\n"
+"* ㄹ개인정보 처리 방침 미공개\n"
+"* ㅁ 최소한의 개인정보 이외 정보의 미제공으로 서비스 제공을 거부한 경우\n"
+"* ㅂ 기술적, 관리적 보호 조치 미이행\n"
+"* ㅅ 목적 달성 후 수집한 개인정보의 미파기\n"
+"* ㅇ 이용자의 동의 철회, 열람 및 정정 요구 미조치\n"
+"* ㅈ 이용자의 동의 철회, 열람 및 정정 요구를 수집 방법보다 어렵게 한 경우\n"
+"* ㅊ  과징금 대상으로써 방송통신위원회가 행위 중지 요구 시 미이행한 경우",
v : [ "ㄱ,ㄴ",
      "ㄴ,ㅁ",
      "ㅁ,ㅅ",
      "ㅅ,ㅊ",
      "ㅊ"],
d : [4],
h : "ㅅ : 과징금에 대한 사항으로 정보통신망법에서는 개인정보 미파기 시 2년 이하의 징역 2천만원 이하의 벌금형에 처해질 수 있다(정보통신망법 제73조).\nㅊ : 과징금 대상으로써 방송통신위원회가 행위 중지 요구 시 미이행한 경우에도 과징금이 부과된다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 괄호 안에 들어갈 용어로 적절한 것은?\n"
+"* ㄱ : 이메일 발송 + 회신(필수 사항)\n"
+"* ㄴ : 이메일 발송 + 회신(필수 아님)\n"
+"* ㄷ :  홈페이지(개인정보 처리 방침) + 이메일 발송(필수 아님) + 회신(필수 아님)\n",
v : [ "ㄱ 통지 ㄴ 동의 ㄷ 게시",
      "ㄱ 동의 ㄴ 공개 ㄷ 게시",
      "ㄱ 동의 ㄴ 통지 ㄷ 게시",
      "ㄱ 통지 ㄴ 공개 ㄷ 게시",
      "ㄱ 게시 ㄴ 동의 ㄷ 통지"],
d : [3],
h : "* 동의 : 개별적으로 연락을 하고 이용자에게 회신을 받아야 한다.\n* 통지 : 개별적으로 연락을 해야 하지만 회신을 받을 필요는 없다.\n* 공개/게시 : 개별적인 연락을 할 필요가 없고 회신 또한 필요가 없다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보의 안전성 확보 조치 기준에서 주민등록번호를 이용해 정보 주체를 확인할 경우 추가적인 인증 정보로 활용할 수 있는 것은?\n"
+"* ㄱ I-PIN\n"
+"* ㄴ 공인인증서\n"
+"* ㄷ 휴대 전화\n"
+"* ㄹ 주민등록증 발급 일자\n"
+"* ㅁ 전자 우편\n"
+"* ㅂ OTP 패스워드(안드로이드 앱, IOS 앱)\n"
+"* ㅅ 2차 패스워드(웹)",
v : [ "ㄱ,ㄴ,ㄷ,ㅁ,ㅂ,ㅅ",
"ㄱ,ㄴ,ㄷ,ㄹ,ㅂ,ㅅ",
"ㄱ,ㄴ,ㄷ,ㄹ,ㅁ,ㅂ",
"ㄴ,ㄷ,ㄹ,ㅁ,ㅂ,ㅅ",
"ㄱ,ㄴ,ㄷ,ㄹ,ㅁ,ㅂ,ㅅ"],
d : [5],
h : "해당 보기는 주민등록번호를 수집하여 이용할 때 반드시 본인에 대한 추가 확인 절차에 대해서 인증 수단을 설명한 것으로 본인 확인을 위해 모두 사용 가능한 수단이다.",
k : "3과목. 개인정보 라이프 사이클 관리" },


{
m : "다음 중 정보통신망법의 벌칙, 과징금, 과태료의 기준으로 틀린 것은?\n"
+"* ㄱ 제73조(벌칙) 제64조(과징금)와 더불어 양벌 규정으로 적용함\n"
+"* ㄴ 제73조(벌칙) 동법 제28조 1항 2호~5호에 따른 기술적, 관리적 조치 미이행으로 개인정보가 분실, 유출, 훼손된 경우 2년 이하 징역 또는 2천만원 이하의 벌금을 부여함\n"
+"* ㄷ 제64조 3(과징금 부과) 제73조와 동일한 사유로 매출액의 1%~3% 이하로 추징이 가능함(방송통신위원회가 인정하는 정보보호 인증 취득 등과 같은 특수 사항을 제외한 일반적인 경우)\n"
+"* ㄱ 제76조(과태료) 3천만원 이하의 과태료를 부과하도록 함\n"
+"* ㄱ 제76조(과태료) 제73조와 동일한 사유로 1년 이하 징역에 처하도록 함",
v : [ "ㄱ,ㄷ",
"ㄴ,ㄷ",
"ㄷ,ㄹ",
"ㄷ,ㅁ",
"ㄹ,ㅁ"
],
d : [4],
h : "정보통신망법에서 개인정보 유출로 인한 문제 발생 시 기업 매출액의 1%에서 3%로 과징금을 상향 조정하였고, 과태료에는 벌칙과 관련한 양벌 규정이 없다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 정보통신망법에 따른 영리 목적의 광고성 정보 전송 제한에 관한 내용으로 옳지 않은 것은?",
v : [ "누구든지 전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하려면 그 수신자의 명시적인 사전 동의를 받아야 한다. 다만, 재화 등의 거래 관계를 통하여 수신자로부터직접 연락처를 수집한 자가 자신이 취급하고 수신자와 거래한 것과 동종의 재화 등에 대한영리 목적의 광고성 정보를 전송하려는 경우는 예외로 한다.",
      "전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하려는 자는 동의를 받았다. 할지라도 불구하고 수신자가 수신 거부 의사를 표시하거나 사전 동의를 철회한 경우에는영리 목적의 광고성 정보를 전송하여서는 아니 된다.",
      "오후 9시부터 그 다음 날 오전 8시까지의 시간에 전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하려는 자는 법률 500조 제1항에도 불구하고 그 수신자로부터 별도의 사전 동의를 받아야 한다.",
      "전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하는 자는 대통령령으로 정하는 바에 따라 전송자의 명칭' 및 연락처', '수신의 거부 또는 수신 동의의 철회 의사 표시를 쉽게 할 수 있는 조치 및 방법에 관한 사항' 등을 광고성 정보에 구체적으로 밝혀야 한다.",
      "전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하는 자는 수신자가 수신 거부나 수신 동의의 철회를 할 때 발생하는 전화 요금 등의 금전적 비용을 수신자가 경우에 따라서는 부담할 수 있다."],
d : [5],
h : "전자적 전송 매체를 이용하여 영리 목적의 광고성 정보를 전송하는 자는 수신자가 수신 거부나 수신동의의 철회를 할 때 발생하는 전화 요금 등의 금전적 비용을 수신자가 부담하지 아니하도록 대통령령으로 정하는 바에 따라 필요한 조치를 하여야 하며, 광고성 메일은 거래 종료 시 6개월까지만 전송이 가능하며, 광고 표기 의무화, 광고 수신 동의 의사를 2년 주기로 확인해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 개인정보 수집에 대한 내용으로 그 성격이 다른 것은?\n"
+"* ㄱ 서비스 게시를 위해 필요한 개인정보에 한정하여 수집·이용 동의를 받아야 하고, 서비스 게시 이후 추가 서비스 제공 시점에 동의를 받는 경우\n"
+"* ㄴ 온라인 회원제 서비스의 경우 최초 가입 시 ID, PASSWORD 등 최소 정보에 대한 동의를 요구하고, 이후 서비스 이용 단계에서 필요한 정보는 해당 시점에 동의를 요구하는 경우\n"
+"* ㄷ 반복적인 서비스의 경우로서 최초 서비스 이용 시점에 선택 동의 항목으로 분류하여 동의를 받은 경우\n"
+"* ㄹ 비정기적인 이벤트를 통해 당첨자 발생 시 배송을 위해 이벤트 응모 단계에서 주소 정보를 수집 받는 경우\n"
+"* ㅁ 이용자에게 제공하는 서비스와 무관하게 홈페이지를 회원제로 운영하고, 그 과정에서불필요한 개인정보를 수집하는 경우",
v : [ "ㄱ,ㄴ",
"ㄱ,ㄷ",
"ㄴ,ㄹ",
"ㄴ,ㅁ",
"ㄷ,ㅁ"],
d : [5],
h : "보기의 항목에서 ㄷ,ㅁ은 개인정보의 최소 수집 원칙 이외의 사항이다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음의 내용 중 개인정보 처리 방침에 대한 그림 설명으로 옳은 것은?\n![](./moon/cppg/q3-51.png)",
v : ["","","","",""],
d : [5],
h : "처리 방침과 변경 내용은 그 내용을 쉽게 알 수 있도록 공지해야 한다.\n* __1__ : 개인정보처리방침이 기관소개, 이용약관보다 작은 글씨로 작성되었다.\n* __2__ : 공공기관의 개인정보보호에 관한 법률은 폐지되어 개인정보보호법으로 수정해야 한다.\n* __3__ : 개인정보보호법 제정 이후 2012년 1월 이후 개정 검토가 안 되었다.\n* __4__ : 개인정보취급방침'을 '개인정보처리방침으로 변경해야 한다.",
k : "3과목. 개인정보 라이프 사이클 관리" },

{
m : "다음 중 정보통신서비스 제공자의 기술적 보호 조치 기준과 관련한 정의에서 가장 적절하지 않은 것은?",
v : [ "\"개인정보처리시스템\"이라 함은 개인정보를 처리할 수 있도록 체계적으로 구성한 데이터베이스 시스템을 말한다(내부 직원의 개인정보만을 보유한 중소 사업자의 시스템도 포함),",
      "\"개인정보취급자\"란 정보통신서비스 제공자의 지휘 및 감독을 받아 개인정보를 처리하는 임직원, 파견 근로자, 시간제 근로자 등을 말한다.",
      "\"바이오 정보\"라 함은 지문, 얼굴, 홍채, 정맥, 음성, 필적 등 개인을 식별할 수 있는 신체적 또는 행동적 특징에 관한 정보로서 그로부터 가공되거나 생성된 정보를 포함한다.",
      "\"정보 주체\"란 처리되는 정보에 의하여 알아볼 수 있는 사람으로서 그 정보의 주체가 되는 사람을 말한다.",
      "\"개인정보 파일\"이란 개인정보를 쉽게 검색할 수 있도록 일정한 규칙에 따라 체계적으로 배열하거나 구성한 개인정보의 집합물(集合物)을 말한다."],
d : [1],
h : "개인정보처리시스템에서 내부 직원의 정보만 소유한 중소 사업자의 경우는 제외된다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보보호에 관한 내부 관리 계획에 대한 설명으로 옳지 않은 것은?",
v : [ "내부 관리 계획이란 사업자가 이용자의 개인정보를 보호하기 위해 마련하여야 하는 내부규정 및 지침을 의미한다.",
      "사업자는 이용자의 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성을 확보하기 위하여 조직 내부의 개인정보 관리 계획을 수립하여야 하며, 경영진으로부터 승인을 받은 후 이를 모든 임직원과 직원에게 공지하여 준수할 수 있도록 해야 한다.",
      "내부 관리 계획에는 개인정보관리책임자의 의무 및 책임에 관한 사항, 개인정보 처리 단계별 기술적·관리적 보호 조치에 관한 사항, 정기적 자체 감사에 관한 사항, 개인정보취급자에 대한 교육 등 개인정보보호를 위해 필요한 사항은 반드시 포함되어야 한다.",
      "내부 관리 계획은 해당 사업자의 의사 결정자(CEO, CPO 등)에 대한 보고 및 승인·결재를 거쳐 시행하여야 한다.",
      "내부 관리 계획은 개인정보보호 관련 법·제도의 변경 사항, 기업의 개인정보 관련 사업 내용 변경 사항 등을 1년 이내로 반영하여야 하며, 해당 사업자의 전 직원 및 수탁·용역 업체도 교육 ·열람되어야 한다."],
d : [5],
h : "내부 관리 계획의 변경 사항은 즉시 반영하여야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 정보통신서비스 제공자를 대상으로 하는 개인정보의 보호 조치에서 올바르게 기술된 내용은?",
v : [ "「개인정보보호법」(이하 \"법\"이라 한다) 제29조 및 같은 법 시행령 제48조의 2 제3항에 따라 정보통신서비스 제공자 등이 이용자의 개인정보를 취급함에 있어서 개인정보가 분실, 도난, 유출, 변조, 훼손 등이 되지 아니하도록 안전성을 확보하기 위하여 취하여야 하는 개인정보에대한 기술적, 환경적 보호 조치의 구체적인 기준을 정하는 것을 목적으로 한다.",
      "「개인정보보호법」(이하 \"법\"이라 한다) 제29조 및 같은 법 시행령 제48조의 2 제3항에 따라 정보통신서비스 제공자 등이 이용자의 개인정보를 취급함에 있어서 개인정보가 분실, 도난, 유출, 변조, 훼손 등이 되지 아니하도록 안전성을 확보하기 위하여 취하여야 하는기술적, 관리적 보호 조치의 구체적인 기준을 정하는 것을 목적으로 한다.",
      "「개인정보보호법」(이하 \"법\"이라 한다) 제29조 및 같은 법 시행령 제48조의 2 제3항에 따라 정보통신서비스 제공자 등이 이용자의 개인정보를 취급함에 있어서 개인정보가 분실, 도난, 유출, 변조, 훼손 등이 되지 아니하도록 안전성을 확보하기 위하여 취하여야 하는개인정보에 대한 기술적, 법적 보호 조치의 구체적인 기준을 정하는 것을 목적으로 한다.",
      "「개인정보보호법」(이하 \"법\"이라 한다) 제29조 및 같은 법 시행령 제48조의 2 제3항에 따라 정보통신서비스 제공자 등이 이용자의 개인정보를 취급함에 있어서 개인정보가 분실, 도난, 유출, 변조, 훼손 등이 되지 아니하도록 안전성을 확보하기 위하여 취하여야 하는 개인정보에대한 기술적, 물리적 보호 조치의 구체적인 기준을 정하는 것을 목적으로 한다.",
      "「개인정보보호법」(이하 \"법\"이라 한다) 제29조 및 같은 법 시행령 제48조의 2 제3항에 따라 정보통신서비스 제공자 등이 이용자의 개인정보를 취급함에 있어서 개인정보가 분실. 도난, 유출, 변조, 훼손 등이 되지 아니하도록 안전성을 확보하기 위하여 취하여야 하는개인정보에 대한 기술적 보호 조치의 구체적인 기준을 정하는 것을 목적으로 한다."],
d : [2],
h : "* __1__ : 기술적, 환경적 보호 조치 → 기술적·관리적 보호 조치\n* __3__ : 기술적, 법적 보호 조치 → 기술적·관리적 보호 조치\n* __4__: 기술적, 물리적 보호 조치 → 기술적·관리적 보호 조치\n* __5__ 기술적 보호 조치 → 기술적·관리적 보호 조치\n* 개인정보의 기술적·관리적 보호 조치의 기준 제1조(목적)에 대한 내용이다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음은 고시에서 분류한 정보통신망법의 적용 대상자 도식이다. 아래 별표(*)가 표시된 항목 중 그 내용이 맞는 것은?\n![](./moon/cppg/q4-04.png)",
v : ["","","","",""],
d : [3],
h : "* __1__  : 전기통신 서비스 제공자 등 정보통신 서비스 제공자\n* __2__ : 제휴 통신 사업자 → 부가 통신 사업자\n* __4__ : 라디오 방송 사업자 → 방송 사업자\n* __5__ : 위탁자 수탁사",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보 관련 법률과 고시와의 관계가 잘못 연결된 것은?\n"
+"|법률|시행령|시행 규칙|규칙/고시|\n"
+"|---|---|---|---|\n"
+"|개인정보보호법|동법 시행령|동법 시행 규칙|ㄱ 개인정보의 기술적·관리적 보호 조치 기준|\n"
+"|정보통신망법|동법 시행령|동법 시행령|ㄴ 개인정보의 안전성 확보 조치 기준|\n"
+"|전자금융거래법|동법 시행령|-|ㄷ 전자금융 감독 규정|\n"
+"|신용정보법|동법 시행령|동법 시행령|ㄹ 신용정보업 감독 규정|\n"
+"|의료법|동법 시행령|동법 시행령|ㅁ 의료 기관의 종류별 표준 업무 규정|",
v : [ "ㄱ,ㄴ",
"ㄱ,ㄷ",
"ㄴ,ㄷ",
"ㄴ,ㄹ",
"ㄹ,ㅁ"],
d : [1],
h : "* ㄱ : 개인정보의 기술적·관리적 보호 조치 기준 → 개인정보의 안전성 확보 조치 기준\n* ㄴ: 개인정보의 안전성 확보 조치 기준 → 개인정보의 기술적·관리적 보호 조치 기준",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 법률 위반 시 부과 내역에 대한 설명으로 틀린 것은?\n"
+"|법률|위반 사항|부과 내역|\n"
+"|---|---|---|\n"
+"|개인정보보호법|민감 정보(사상, 신념, 병력 정보 등)의 수집 시 별도동의를 받지 않는 등의 처리 기준 위반|ㄱ 5년 이하의 징역 또는 5천만원 이하의 벌금|\n"
+"|개인정보보호법|개인정보 미파기 시|ㄴ 5천만원 이하의 과태료|\n"
+"|정보통신망법|대통령령으로 정하는 기준에 해당하는 정보통신 서비스 제공자가 미래부에 CISO를 신고하지 않은 경우|ㄷ 3천만원 이하의 과태료|\n"
+"|개인정보보호법|개인정보의 분실, 도난, 누출 사실을 알고 24시간 이후 신고하였으나 24시간 이후에 신고한 정당한 사유를 입증하지 못한 경우|ㄹ 3천만원 이하의 과태료|",
v : [ "ㄱ",
"ㄴ",
"ㄷ",
"ㄹ",
"ㅁ"],
d : [2],
h : "개인정보 미파기 시에는 2년 이하의 징역 또는 2천만원 이하의 벌금형에 처하도록 규정하고 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음의 개인정보보호법에서 규정하고 있는 암호화 대상 중 그 성격이 다른 것은?",
v : [ "주민등록번호",
      "계좌번호",
      "신용카드번호",
      "운전면허번호",
      "계좌 비밀번호" ],
d : [5],
h : "* 비밀번호는 복호화 되지 않는 일방향 암호화 알고리즘을 적용해야 한다.\n * 일방향 암호화 대상 : 비밀번호\n * 양방향 암호화 대상 : 고유 식별 번호(주민등록번호, 여권번호, 외국인번호, 운전면허번호), 신용카드번호, 계좌번호",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 전자금융거래법에서 직접적으로 명시하고 있는 암호화 대상은?",
v : [ "주민등록번호",
      "계좌번호",
      "신용카드번호",
      "바이오 정보",
      "비밀번호" ],
d : [5],
h : "전자금융거래법에서는 암호화 대상을 비밀번호에 한정해 규정하고 있으나 신용정보업감독 구정에서는 비밀번호, 바이오 정보 등 본인임을 인증하는 정보는 암호화하여 저장할 것을 규정하고 있다. 또한, 개인정보보호법에서는 고유 식별 정보와 신용카드정보, 계좌 대하여 암호화를 별도로 영시하고 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보보호법상 개인정보처리시스템의 접속 기록 관리에 대한 설명으로 적절하지 않는 것은?",
v : [ "사업자는 개인정보 취급자(직원 등)가 개인정보처리시스템에 접속한 기록을 최소 1년 이상보존 및 관리해야 한다.",
      "사업자는 개인정보처리시스템의 접속 기록을 월 1회 이상 정기적으로 확인 및 감독하여야한다.",
      "접속 기록의 항목에는 개인정보 취급자의 식별 정보, 이용자(고객)의 식별 정보(ID 등), 접속일시, 접속지(IP), 업무 내용(개인정보 입력, 수정, 삭제) 등이 포함되어야 한다.",
      "공공기관 개인정보취급자의 권한 생성, 변경 및 말소에 관한 로그는 5년 이상 보관한다.",
      "와스 서버 및 고객 정보가 저장되어 있는 ERP 시스템에 개인정보취급자가 접속 시 해당 접속기록을 반드시 남겨야 한다."],
d : [4],
h : "개인정보보호법에서는 개인정보처리자의 권한 변경 등에 관한 기록은 3년 이상 보관하도록 하고 있으며, 정보통신서비스 제공자에 대해서는 5년 이상으로 명시하고 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보보호법의 안전성 확보 조치 기준(암호화)으로 잘못된 것은?\n"
+"* ㄱ 비밀번호는 MD5, SHA-1, SHA-256 등의 암호화 알고리즘을 적용하도록 한다.\n"
+"* ㄴ 암호화할 개인정보란 주민번호, 외국인등록번호, 여권번호, 비밀번호, 바이오 정보를 말한다.\n"
+"* ㄷ 개인정보처리자는 고유 식별 정보, 비밀번호, 바이오 정보를 정보통신망을 통하여 송신하거나 보조 저장 매체 등을 통하여 전달하는 경우에는 이를 암호화하여야 한다.\n"
+"* ㄹ 개인정보처리자는 비밀번호 및 바이오 정보를 일방향 암호화하여 저장한다.\n"
+"* ㅁ 폐쇄된 내부 망에 존재하는 시스템의 비밀번호는 암호화 대상이 아니다.",
v : [ "ㄱ,ㄴ,ㄷ",
"ㄱ,ㄷ,ㅁ",
"ㄱ,ㄹ,ㅁ",
"ㄴ,ㄷ,ㄹ",
"ㄴ,ㄷ,ㅁ"],
d : [3],
h : "비밀번호는 SHA-256 이상을 적용해야 하며, 바이오 정보는 양방향 암호화하여 저장하도록 한, 내부 망에 존재하는 시스템의 비밀번호도 암호화해야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 영상 정보 처리 기기를 운영할 때 지켜야 할 방침으로 틀린 것은?",
v : [ "영상 정보 처리 기기의 설치 대수, 위치, 촬영 범위",
      "영상 정보의 보호를 위한 관리적, 기술적, 제도적 보호 조치",
      "안내판의 크기 및 부착 장소",
      "관리 책임자, 담당 부서 및 영상 정보에 대한 접근 권한을 부여 받은 업무 담당자",
      "정보 주체의 영상 정보 열람 등 요구에 대한 조치"],
d : [2],
h : "영상 정보의 보호를 위한 관리적, 기술적, 제도적 보호 조치가 아니라 관리적, 기술적, 물리적 보호 조치가 맞는 표현이다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보보호법에 대한 준수 사항을 설명한 것으로 틀린 것을 모두 고르시오.",
v : [ "보안 프로그램 업데이트를 자동 또는 일 1회 이상 업데이트를 실시한다.",
      "개인정보보호 책임자 및 취급자를 대상으로 년 2회 이상 정기적으로 교육을 실시하여야 한다고 명시하고 있다.",
      "정보통신서비스 제공자 등의 접근 권한 부여에 대한 변경 기록은 정보통신망법은 5년 동안 보관한다.",
      "개인정보처리자가(공공기관 등) 외부에서 개인정보처리시스템에 접속 시 안전한 인증 수단과 안전한 접속 수단을 모두 구축해야 한다.",
      "개인정보보호법상 암호화하여 저장하여야 하는 대상은 비밀번호, 바이오 정보, 고유 식별번호(주민등록번호, 여권번호, 외국인번호, 운전면허번호), 신용카드 정보가 된다."],
d : [2,4],
h : "* __2__ : 개인정보에 대한 교육을 기존에는 횟수로 지정하였으나 개정된 법에서는 사업체의 규모에 따라 적절하게 판단하여 정기적으로 하도록 하였으며, 횟수에 대한 기준은 폐지하였다.\n* __4__ : 외부에서 개인정보처리자가 개인정보처리시스템 접속 시 안전한 인증 수단이나 안전한 접속수단을 선택적으로 적용할 수 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 영상 정보 처리 기기의 설치 및 운영에 관한 설명으로 틀린 것은?",
v : [ "기존에는 공공 기관만 적용하였으나 민간에서도 공개된 장소에 특정 목적으로만 설치, 운영이 가능하다.",
      "목욕실, 화장실, 탈의실 등 사생활 침해 지역은 설치 및 운영을 금지한다.",
      "교정 시설, 정신 의료 기관에는 설치 및 운영을 허용한다.",
      "설치와 다른 목적으로 영상 처리 기기를 임의 조작, 다른 곳을 비추는 행위 및 녹음은 금지된다.",
      "개인정보보호법에서 말하는 영상 정보 처리 기기는 폐쇄 회로 텔레비전(CCTV), 네트워크 카메라, 캠코더 등에 해당한다."],
d : [5],
h : "캠코더, 핸드폰은 기준 범위의 해당 기기에 해당되지 아니한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보처리시스템에 대한 설명으로 옳지 않은 것은?",
v : [ "개인정보를 처리할 수 있도록 체계적으로 구성한 데이터베이스 시스템을 말한다.",
      "50인 미만의 내부 직원 정보만을 보유한 소기업은 해당 사항이 안 된다.",
      "개인정보의 체계적인 처리를 위한 별도의 DBMS 어플리케이션을 말한다.",
      "엑셀, PC에 문서로 저장된 다량의 자료는 개인정보처리시스템이 아니다.",
      "개인정보처리자는 개인정보처리시스템 대신 업무용 컴퓨터만을 이용하여 개인정보를 처리해서는 안 된다."],
d : [5],
h : "보기 __5__번의 경우에는 업무용 컴퓨터의 운영 체제(OS)나 보안 프로그램 등에서 제공하는 접근 통제기능을 이용해서 처리할 수 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보의 기술적 보호 조치 및 안전성 확보 조치의 내용으로 틀린 것은?",
v : [ "개인정보처리자는 개인정보가 분실·훼손되지 아니하도록 내부 관리 계획을 수립, 접속기록 보관 등 대통령령으로 정하는 바에 따라 안전성 확보에 필요한 기술적·관리적 및 물리적 조치를 하여야 한다.",
      "정부는 정보통신서비스 제공자 동의 개인정보의 기술적인 보호와 관련하여 '개인정보의 기술적·관리적 보호 조치 기준'을 개인정보처리자에 대해서는 개인정보의 안전성 확보조치 기준'을 가이드라인으로 제시하고 있다.",
      "개인정보보호법에서 기술적 보호 조치 미이행으로 인한 유출시 2년 이하의 징역에 처한다.",
      "개인정보보호법에서 기술적 보호 조치 미이행 시 3천만원 이하의 과태료를 지불해야한다.",
      "개인정보보호법에서 기술적 보호 조치 미이행으로 인한 유출 시 2천만원 이하의 벌금을 내야 한다."],
d : [4],
h : "개인정보보호법에서 기술적 보호 조치 미이행 시 5천만원 이하의 과태료를 지불해야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 외부에서 내부 망의 개인정보처리시스템에 접속 시 준수해야 할 기술적 보호 조치가 아닌 것은?",
v : [ "사용자 인증 시 아이디, 패스워드를 포함하여 추가의 인증 절차를 마련해야 한다.",
      "사용자 인증 시 추가 인증 절차로는 공인인증서, OTP, 보안 토큰 등이 될 수 있다.",
      "사용자 인증 및 개인정보 전송 시 보안 서버를 통하여 암호화하거나 전용선을 통해 전송해야 한다.",
      "외부에서 접속 시에는 SSL VPN 등을 통하여 접속 구간에 대한 보안을 강화해야 한다.",
      "개인정보처리시스템이 구글에 노출되지 않도록 검색 엔진에 차단 등록을 하게 되면 인증시 2-Factor를 적용하지 않아도 된다."],
d : [5],
h : "구글에 URL이 등록되지 않더라도 IP 대역 스캔과 관련 도메인의 유추를 통해 해당 주소가 노출될 수 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 비밀번호의 생성 규칙 및 변경 주기로 옳지 않은 것은?\n"
+"* ㄱ 비밀번호는 영문자, 숫자, 특수 문자 중 3가지로 조합하고, 12자리 이상으로 설정하는 것을 지침으로 한다.\n"
+"* ㄴ 일반적으로 개인정보처리시스템의 비밀번호 변경 주기는 6개월로 수립해야 한다.\n"
+"* ㄷ 정부 및 공공 기관은 서버의 비밀번호를 6개월마다 변경해야 한다.\n"
+"* ㄹ 집적 정보 통신 시설의 시스템 관련 비밀번호는 1개월마다 변경해야 한다.\n"
+"* ㅁ 100만명 이상의 고객 정보를 보유한 대기업인 경우 개인정보처리시스템의 비밀번호를 3개월마다 변경해야 한다.",
v : [ "ㄱ,ㄴ",
"ㄱ,ㄷ",
"ㄱ,ㅁ",
"ㄷ,ㄹ",
"ㄷ,ㅁ"],
d : [5],
h : "공공 기관은 국가 정보보안 기본 지침에 따라 비밀번호를 3개월 단위로 변경해야 하며, 민간 기관인 경우는 6개월마다 변경해야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 가장 적절한 비밀번호에 해당하는 것은?\n"
+"* ㄱ ABC0099, Superman\n"
+"* ㄴ Superman. Tu7Sai9#\n"
+"* ㄷ Tu7Sai9#, veryStrongPwd3!8@\n"
+"* ㄹ ABC0099. admin1234\n"
+"* ㅁ admin1234. koreakorea1\n",
v : [ "ㄴ",
"ㄴ,ㄷ",
"ㄷ",
"ㄷ,ㅁ",
"해당 없음"],
d : [3],
h : "연속되는 알파벳이나 숫자 조합, 추측하기 쉬운 비밀번호는 사용하지 않도록 하고 영문자, 숫자, 수 문자를 3가지로 조합할 경우 8자리 이상, 2가지로 조합할 경우 10자리 이상으로 설정해야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 망 분리 의무화 대상 기관이 아닌 것은?",
v : [ "전년도 직전 3개월 동안 이용 중인 회원수가 100만명 이상인 기관",
      "정보통신 서비스 부문 전년도 매출액이 100억 이상인 기관",
      "정보보호 관리 체계 인증 의무 대상자",
      "정보통신 기반 시설로 지정된 기관",
      "언론사 등 사회 및 일반 개인에 지대한 영향을 미칠 수 있는 기관"],
d : [5],
h : "사회에 지대한 영향을 미칠 수 있는 기관은 의무 대상은 아니다. 주요 정보통신 기반 시설로는 유무선 통신망, 인터넷 뱅킹, 금융 사이버 트레이딩, 지자체 교통 신호 체계, 철도 운영 관제, 원자력 제어 시스템, 대형 병원 시설 등 200 여개에 달한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 망 분리에 대한 올바른 운영 현황으로 틀린 것은?",
v : [ "망 분리는 물리적인 망 분리뿐만 아니라 논리적인 망 분리도 네트워크가 분리된 것으로 간주할 수 있다.",
      "망 분리된 PC에서는 인터넷 접속이 반드시 차단되어야 한다.",
      "망 분리된 환경에서는 파일 전송이 원칙적으로 차단되어야 하지만 내부 기관의 특성상 최소한의 범위 내에서 승인 절차에 따라 통제 및 보호 조치가 이행된다면 가능하다.",
      "망 분리로 내부의 폐쇄 망에 위치하고 있는 PC 및 서버는 별도의 백신이 설치되어 있지 않더라도 안전하게 보호될 수 있는 것은 아니다.",
      "망 분리 의무 대상자는 시스템 구축에 따른 비용 부담이 발생할 때 장단기 계획을 수립하고, 민감 정보를 보유하고 있는 DBMS 장비가 위치한 네트워크를 우선적으로 분리한다."],
d : [5],
h : "망 분리 의무 대상자의 구축에 대한 유예 기간은 2013년 2월 18일부터 종료되었기 때문에 반드시 내부 망 시스템은 우선순위와 관계없이 분리해야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 망 분리에 대한 설명으로 옳지 않은 것은?\n![](./moon/cppg/q4-21.png)",
v : [ "","","","","" ],
d : [3],
h : "망 분리는 폐쇄 망 환경에서 인터넷이 되어서는 안 되나 __3__에서는 이러한 조건을 만족하면서도 외부 메일이 허용되어 있어 내부 자료가 외부로 갈 수 있는 구조이기 때문에 양 문리에 대한구조라고 할 수 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 영상 정보 처리 기기에 대한 운영 지침으로 옳지 않은 것은?",
v : [ "영상 정보 처리 기기에 대한 안전성 확보 조치에 대해서는 「표준 개인정보보호 지침」 중에서 영상 정보 처리 기기 설치 및 운영 기준이 정하는 바에 따른다.",
      "영상 정보 처리 기기 운영자는 정보 주체가 영상 정보 처리 기기가 설치 및 운영 중임을 쉽게 알아볼 수 있도록 설치 목적/장소', '촬영 범위/시간', '관리 책임자의 성명 또는 책/연락처', '영상 정보 처리 기기 설치 및 운영에 관한 사무를 위탁하는 경우 수탁자의 명칭 및 연락처 정보를 안내판에 기재하여야 한다.",
      "영상 정보 처리 기기 운영자가 그 사정에 따라 보유 목적의 달성을 위한 최소한의 기간을 산정하기 곤란한 때에는 보관 기간을 개인 영상 정보 수집 후 60일 이내로 한다.",
      "영상 정보 처리 기기 운영 및 관리 방침을 수립하거나 변경하는 경우에는 정보 주체가 쉽게 확인할 수 있도록 공개하여야 한다.",
      "영상 정보 처리 기기 운영자는 개인 영상 정보의 처리에 관한 업무를 총괄해서 책임질 개인 영상 정보보호 책임자를 지정하여야 한다."],
d : [3],
h : "영상 정보 처리 기기 운영자가 사정에 따라 보유 목적의 달성을 위한 최소한의 기간을 산정하기 곤란한 때는 보관 기간을 개인 영상 정보 수집 후 30일 이내로 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 안전한 암호화 알고리즘이 아닌 것은?\n"
+"* ㄱ SEED\n"
+"* ㄴ AES-128, AES-256\n"
+"* ㄷ MD5, SHA-1\n"
+"* ㄹ ARIA-256\n"
+"* ㅁ SHA-512",
v : [ "ㄱ,ㄴ","ㄴ,ㄷ","ㄷ","ㄹ,ㅁ","해당 없음" ],
d : [3],
h : "MD5(Message Digested algorithm 5)는 해시 함수에 SHA-1은 양방향 암호화 함수에 사용되는 암호화 알고리즘이나 최근 취약성이 발견되고 있어 국내에서도 사용을 권고하고 있지 않다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 PC에 대한 기술적 보호 조치의 설명으로 가장 적절하지 않은 것은?\n"
+"* ㄱ 비밀번호는 적어도 6개월에 1번 이상 변경하고, 10자리 이상으로 설정한다.\n"
+"* ㄴ 백신 소프트웨어를 설치한 후 최소 일 단위로 업데이트하고 자동 검사 주기를 설정해 놓도록 하며, USB를 연결할 경우 자동 검사 유무를 확인하여 자동 검사가 안 될 경우 업무 완료 후에 수동으로 USB를 검사한다.\n"
+"* ㄷ PC의 경우 백신이 설치되어 있다면 윈도우 방화벽 기능은 업무에 필요한 프로그램과의 충돌을 대비하여 꺼두도록 한다.\n"
+"* ㄹ 회원의 개인정보가 들어있는 파일은 안전한 암호 SW를 이용해 암호화하여 저장하고, 업무에 필요한 최소한의 범위 내에서만 보관 후 삭제하도록 한다.\n"
+"* ㅁ PC 화면 보호기를 10분 이내로 설정하고, 부재 시 잠기도록 한다.\n"
+"* ㅂ 윈도우의 보안 업데이트는 주기적으로 패치하고, PC의 기본 공유 폴더(C$.D$ 등)는 제거하도록 한다.",
v : [ "ㄱ,ㄴ","ㄱ,ㄹ","ㄴ,ㄷ","ㄴ,ㄹ","ㄷ,ㅁ"],
d : [3],
h : "USB를 PC에 연결할 경우 반드시 자동 검사가 되도록 하는 것이 좋으며, PC가 원도우 환경인 경우 윈도우 방화벽 설정을 기본적으로 적용하는 것이 좋다.",
k : "4과목. 개인정보의 보호 조치" },



/]}/*
99pages

{
m : "다음은 온라인으로 ○○서비스를 제공하는 인터넷 기업의 암호화에 대한 기술적 보호 조치를 설명한 내용이다. 해당 내용으로 틀린 것은?

* 회원 DB에는 고객번호, 아이디, 비밀번호 등이 저장되어 있으며 비밀번호는 SHA-256의 해시 함수를 적용하여 암호화하고 있다.
C 결제 DB에는 고객번호, 계좌번호, 포인트 카드번호, 포인트 카드 비밀번호 등이 저장되어 있으며, 계좌번호는 AES 128비트의 암호화 알고리즘을 포인트 카드 비밀번호는 SEED 알고리즘을 적용하여 암호화하고 있다.

* 서버실 도어 락에 지문 인식을 적용하여 입출입에 대한 인증을 실시하고 있으며, 5층 서버실의 지문 정보는 ARIA 알고리즘을 6층 서버실의 지문 정보는 AES 128을 적용하고 있다.",
      "팩스 서버에는 오프라인으로 받은 주민등록번호, 계좌 정보가 있는 고객 정보가 포함된 신청서를 PDF 파일로 스캔하여 보관하고 있으며, 관리자가 해당 서버에 접속 시 아이디, 비밀번호, OTP 인증을 통해서만 접속할 수 있다.

* 고객과의 소통이 빈번한 영업/마케팅 부서에서는 업무상 필요한 고객의 개인정보 파일을 엑셀로 관리하고 있으며, 이 경우 엑셀 파일이 암호화되어 있지는 않으나 비밀번호를 10자리 이상으로 설정하여 보관하고 있다.
1 ㉠, ㉡)
2 5. a
4 L
5 2. 미
과목 개인정보드 보호 조 ·
3
243 254
99
"],
d : [],
h : "포인트 카드 비밀번호에 사용되는 SEED 알고리즘은 복호화가 가능한 양방항으로 비밀번호는 복호화가 불가능한 일방향 암호화 알고리즘을 적용해야 한다. 암호화 대상의 개인정보가 포함된 신청서를 스캔하여 저장할 경우 문서 자체를 암호화하거나 암호를 설정하여 보관해야 한다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보보호법에서 명시한 위험도 분석에 대한 설명으로 틀린 것은?

* 위험도 분석이란 개인정보처리시스템에서 적용되고 있는 개인정보보호를 위한 수단과 유출시 정보 주체의 권리를 해할 가능성과 그 위험의 정도를 분석하는 행위를 말한다.",
      "관련 근거로 개인정보보호법 제 29조의 개인정보의 안전성 확보 조치 기준에 따라 개인정
보 처리자가 내부 망에 고유 식별 정보를 저장할 경우 위험도 분석 기준에 따라 암호화의적용 여부를 정하여 수행할 수 있다.
③ 위험도 분석 기준은 현황 조사, 위험도 분석 점검 항목, 위험도 분석 결과 보고서로 구성되어 있다.",
      "위험도 분석 점검 항목은 기관 기준 점검 항목 11개(정책 기반/네트워크 기반), 개인정보처리시스템 기준 점검 항목 15개(DB 및 Application 기반, 웹 기반)로 총 26개로 구성되어 있다.",
      "위험도 분석 결과 26개 항목 중 20개 이상을 충족한 경우 주민등록번호를 암호화하지 않아도 된다."],
d : [],
h : "위험도 분석의 한 항목이라도 충족되지 않을 경우 고유 식별 정보를 암호화해야 하며, 2016년부터는위험도 분석과 관계없이 정보 시스템에 저장되는 주민등록번호는 암호화해야 한다.",
k : "4과목. 개인정보의 보호 조치" },
{
m : "다음 중 개인정보의 위험도 분석 기준에 대한 내용으로 옳은 것은?
고 위험도 분석 기준에 해당 사항이 없는 경우 해당 없음 항목에 체크하고, '해당 없음' 체크항목도 '예'로 적용한다.",
      "개인정보 처리자는 위험도 분석 기준을 허위로 작성해서는 안 되며, 위험도 분석 결과 보고서는 반드시 개인정보보호 책임자의 결재를 득한 후 보관한다.
3 위험도 분석은 개인정보 용량 단위로 분석하고, 결과 보고서를 작성해야 한다.(1) 위험도 분석 결과 예산이 필요한 경우 정부에 관련 지원을 요청할 수 있다.
5 위험도 분석은 최초 분석 이후에도 개인정보처리시스템을 증설하거나 내외부망과 연계하여 기타 운영 환경이 변경된 경우에는 변경 시점의 최소 3년 이내에 지속적으로 실시하여야 한다.",
k : "4과목. 개인정보의 보호 조치" },

정답 26 5 27 1
100
"],
d : [],
h : "",
      ": 위험도 분석 결과 보고서는 개인정보보호 책임자 또는 해당 부서장의 결제를 받도록 하고 있다.③ : 위험도 분석 기준은 개인정보 파일 단위이다.· ",
      ": 위험도 분석 결과 예산이 필요하다고 해서 정부에 예산을 요청할 수 있는 사항은 법률에 규정되어 있지 않다.· ",
      ": 개인정보처리시스템 변경 시 재수행해야 할 기간은 지정되어 있지 않으나 최소한 화른 시일내에 하는 것이 좋다.
{
m : "다음 중 시스템 구성도에서 개인정보처리시스템에 속하는 것은?
〈시스템 설명)
다음은 ○○사의 시스템 구성도이다. ○○사는 공개된 DMZ망에 홈페이지 서버와 파일 서버를두고 있으며, 파일 서버에는 홈페이지에 사용되는 이미지 파일이 대부분이고 추가로 회사 소개동영상 파일이 올라가 있다. 내부 망에는 회원 정보와 연동되는 와스 서버가 있으며, 외부 서비스와는 별도로 내부 업무용 기간계 서비스인 ERP 시스템이 구축되어 있다. ERP 서버는 HR 관리팀에서 운영하며, 직원 인사 DB와 연동되어 있다.
〈시스템 구성도)방화벽내부망홈페이지WAS서버)SAP(ERP)파일서버회원DB화이원 B인사DB공개망
(1) 홈페이지 서버, WAS 서버, 회원 DB 서버, 인사 DB홈페이지 서버, 회원 DB 서버, ERP 서버, 인사 DB(3) WAS 서버, 회원 DB 서버, ERP 서버, 인사 DB4 WAS 서버, 회원 DB 서버, 파일 서버, 인사 DB",
      "홈페이지 서버, WAS 서버, 회원 DB 서버, ERP 서버, 인사 DB"],
d : [],
h : "개인정보처리시스템의 범위 : 개인정보가 저장된 , 개인정보처가 처리되는 플리케이션, 개인정보 DB와 연동되는 와스(WAS) 서버나 ERP 서버도 해당될 수 있다.",
k : "4과목. 개인정보의 보호 조치" },

28
고 개인정보의 보호 조치 ·
101
{
m : "다음 중 CCTV 설치에 따른 안내판 부착으로 옳지 않은 것은?
1 장소적 특성으로 인하여 안내판을 설치하는 것이 불가능한 산불 감시용 CCTV",
      "군사 기지 및 군사 시설 보호법에 따른 군사 시설③ 통합방위법에 제2조 제13호에 따른 국가 중요 시설(4 보안 업무 규정상 제36조에 따른 보안 목표 시설 ",
      "화장실, 목욕탕 등의 시설"],
d : [],
h : "화장실, 목욕탕 등 불특정 다수가 이용하는 시설물에는 CCTV 설치가 제한되며, 장소적 특성으로 인하여 안내판을 설치하는 것이 불가능한 산불 감시용 CCTV 등의 경우에는 홈페이지에 안내판을 대신하여 그 내용을 게재할 수 있다.",
k : "4과목. 개인정보의 보호 조치" },

{
m : "다음 중 개인정보보호법에서 말하는 고유 식별 정보의 범위에 해당되지 않는 것은?
(1) 운전면허번호 (3) 외국인등록번호(5) 주민등록번호",
      "여권번호 ",
      "아이 핀(I-Pin) 번호 해설 아이 핀은 본인 확인을 위한 주민번호의 대체 수단을 말하며, 고유 식별 정보란 법령에 따라 개인을 고유하게 구별하기 위하여 부여된 식별 정보로서 대상은 다음과 같다.·「주민등록법」에 따른 주민등록번호·「여권법」에 따른 여권번호「도로교통법」에 따른 운전면허번호, ·「출입국관리법」에 따른 외국인등록번호
{
m : "다음 중 개인정보보호법상 과태료의 기준이 아닌 것은?
1 개인정보 유출 사실 미통지2 개인정보 미파기③ 개인정보 처리 방침 미공개(4 개인정보의 수집 기준 위반 5 개인정보의 고유 식별 정보 처리 기준 위반 해설 개인정보의 고유 식별 정보 처리 기준 위반 시에는 5년 이하 징역 또는 5천만원 이하의 벌금형에 처해지며 개인정보보호법 제75조 제1항부터 제3항까지의 규정에 따라 부과 기준이 정해진다(개인정보호법 시행령 [별표 2] 과태료의 부과 기준(제163조 관련)). 저 대 29 530431 5
102
32
다음 중 예시된 ○ ○ 공공 기관의 CCTV 설치 안내판에 대한 설명으로 옳지 않은 것은?
CCTV 설치 안내목 적고객 안전 및 범죄 예방 촬영 범위 건물 출입구, 층별 승강기 책임자시설관리 실장연락처 070-000-000024시간 CCTV 감시중 목적 : 범죄 및 시설 안전범 위: 놀이 시설 책임자 : 시설지원 실장 070-0000-0000CCTV녹화중 CCTV 녹화중본 기관은 주민의 안전과 방법 등을 목적으로 CCTV를 설치 및 운영하고 있으며, 시설물 현관과 주차장 내 24시간 촬영 중임을 알려드립니다. 문의 : 관리사무소 소장(02-000-0000)",
      "㉢, ㉣"],
d : [],
h : "㉠은 촬영 시간을 표기하지 않았고, ㉡은 목적, 범위, 책임자 및 연락처 등을 기재하지 않았다.",
k : "4과목. 개인정보의 보호 조치" },


다음 중 개인정보보호법에서 정의한 개인정보처리시스템에 해당하지 않는 것은?
33
㉢ 회사명 : 제일 좋은 약국보유 시스템 : 처방전 관리 시스템 직원수 : 1명 온라인 회원 : 500명 해설㉤ 회사명 : 기운 나는 건강 보조 회사 보유 시스템 : PC(회원 엑셀 파일 보유)직원수 : 1명 오프라인 회원 : 1,500명㉠ 회사명 : ABC 물류주식회사 ㉡ 회사명: 할리우드스타 비디오 대여점보유 시스템 : ERP(인사 DB 시스템)보유 시스템 : 대여 관리 시스템 직원 수: 45명 직원수 : 5명 온라인 회원 : 없음 온라인 회원 : 1,000명(4) ㉡",
      "회사명 : XYZ 온라인 샵보유 시스템 : 내부 ERP, 주문 관리 시스템 직원수 : 30명 온라인 회원 : 20,000명",
      "0.0소상공인 또는 중소 사업자가 고객의 개인정보를 보유하지 않고 내부 직원의 개인정보만을 보유한 시스템과 PC 및 노트북과 같은 업무용 컴퓨터는 개인정보처리시스템에서 제외된다.
32 i
4·
과목 개인정보의 보호 조치
33 3
103
{
m : "다음 중 주민등록번호의 암호화에 대한 설명으로 옳은 것은?
정부 및 지차제, 공공 기관은 영향 평가 결과에 따라 내부망의 서버에 저장된 주민등록번호의 암호화를 결정한다.
㉡ 일반 기업체의 경우 위험도 분석 결과에 따라 내부 망의 서버에 저장된 주민등록번호의암호화를 결정한다.
㉢ 내부 망에 주민등록번호를 저장할 때는 영향 평가나 위험도 분석 결과에 상관없이 암호화 하여야 한다.",
      "금융 기관은 전자금융거래법에 따라 비밀번호를 암화화 하는 것 이외에 업무 영향 분석을 통해 주민등록번호 암호화 여부를 결정하도록 한다.
㉤ 내부 망의 주민등록번호를 암호화 조치 시 적용 대상 및 대상별 적용 시기 등에 관하여필요한 사항은 개인정보의 처리 규모와 유출 시 영향을 고려하여 대통령령으로 정한다."],
d : [],
h : "2016년 1월 1일부터 모든 기관의 주민등록번호는 암호화하여 적용하여야 하며, 적용 대상 및 대상별 적용 시기 등에 관하여 필요한 사항은 개인정보의 처리 규모와 유출 시 영향을 고려하여 대통령령으로 정한다.",
k : "4과목. 개인정보의 보호 조치" },


{
m : "다음 중 개인정보의 파기에 관한 설명으로 옳지 않은 것은?

* 개인정보 처리자가 개인정보를 파기하는 경우 복구 또는 재생되지 아니하도록 개인정보가저장된 종이 문서, 하드 디스크나 자기 테이프를 파쇄기로 파기하거나 용해 또는 소각장,소각로에서 태워서 파기한다.",
      "디가우저(Degausser)를 이용해 하드 디스크에 저장된 개인정보를 삭제하도록 한다.
③ 개인정보 처리자는 개인정보를 파기하는 경우 데이터가 복원되지 않도록 초기화 또는 덮어쓰기를 수행할 수 있으며, 하드 디스크의 경우 빠른 포맷을 통해 삭제할 수 있다.",
      "개인정보 처리자가 개인정보의 일부만을 파기하는 경우 전자적 파일 형태인 경우 개인정보를 삭제한 후 복구 및 재생되지 않도록 관리 및 감독한다.",
      "개인정보 처리자가 개인정보의 일부만을 파기하는 경우 기록물, 인쇄물, 서면 그 밖의 기록매체인 경우 해당 부분을 마스킹 처리하거나 천공 등의 방법으로 삭제하도록 한다."],
d : [],
h : "빠른 포맷을 하면 추후 데이터가 복구될 수 있으므로 개인정보가 저장된 하드 디스크는 완전 포맷(3회 이상 권고), 데이터 영역에 무작위 값, 0, 1등으로 덮어쓰기(3회 이상 권고), 해당 드라이브를 안전한 알고리즘 및 키 길이로 암호화하여 저장한 후 삭제하고, 암호화에 사용된 키는 완전 폐기 및 무작위 값 덮어쓰기 등의 방법을 사용할 것을 권고한다.",
k : "4과목. 개인정보의 보호 조치" },


34 5 35 3
104·개인정보관리사 CPPG
2127 ㉧㉥
{
m : "다음은 ○○ 약국의 개인정보관리에 대한 사항을 기술한 것이다. 이중 적절하지 않은 것은?

* 수납 업무를 공동으로 담당하는 계약 직원 5명과 아르바이트생 1명 모두 개인정보 취급자로 지정하여 관리·감독을 철저히 한다.",
      "PC에 대한 개인정보의 안정성 확보 조치를 실시하고 주기적으로 점검한다.
PC에 환자의 주민등록번호가 있는 파일을 보관할 경우 상용 S/W를 사용하여 암호화해야 한다.",
      "인터넷을 통한 개인정보의 유출을 막기 위해 최소한 P2P나 웹 하드 등 유해 사이트를 차단할 수 있어야 한다.
약 제조를 위해 수집한 처방전은 3년 동안 보관하고, 이후에 파기해야
한다."],
d : [],
h : "의료법 시행 규칙에 따르면 수집한 처방전의 보관 기관은 2년이다.",
k : "4과목. 개인정보의 보호 조치" },


{
m : "다음 중 개인정보보호법에 따른 영상 정보 처리 기기의 대상이 아닌 것은?

* 대학 병원 출입구 및 승강기 내부의 CCTV
승용차 외부 촬영용 블랙 박스(카메라)
㉢ 도서관 입구의 CCTV
순환버스 내부의 촬영 CCTV
㉤ SUV 차량(개인 소유) 내부의 촬영 CCTV
③9.0"],
d : [],
h : "공개된 장소에서의 영상 정보 처리 기기 설치는 원칙적으로 금지되고, 개인정보보호법에 예외로 규정한 경우는 가능하다. 또한, 불특정 다수가 이용하는 공개된 장소라도 현저히 사생활 침해 우려가 있는 장소는 영상 정보 처리 기기의 설치 및 운영이 금지된다.",
k : "4과목. 개인정보의 보호 조치" },


36 5
4과목 개인정보의 보호 조치·105
4
37 5
{
m : "다음 중 올바른 CCTV의 관리 현황이라고 보기 어려운 것은?
은행 출입구에 방범을 목적으로 설치된 CCTV는 입·출입자에 감시를 목적으로 하고 있으며, 24시간 동안 360로 회전이 가능하여 은행에 출입한 강도가 근처 주택이나 도로 앞에 도주하는 것을 탐지할 수 있게 하였다.
㉡ 마을 시장의 4거리에 위치한 CCTV는 도난 방지 및 시장 상인 보호를 위해 24시간 촬영되고 있으며, 추후 범죄 발생 시 추적 강화를 위해 음성 녹음 기능을 더하고 있다.
㉢ 국립공원 내에 산행로 구간마다 산불 보호를 위해 사람을 식별하기 어려울 정도의 감도를 유지한 CCTV 카메라를 설치하여 운영하고 있다.",
      "어린이집 내부에 아이의 신변 보호를 위해 다양한 각도에서 CCTV를 설치하여 운영하고 있다.
마을 버스에 CCTV를 설치하여 운행 시간대에 촬영하고 있으며, 기사 보호를 위해서 운전석에 가깝게 설치해 운영하고 있다.
4"],
d : [],
h : "은행에 설치된 목적 외 주변의 다른 장소에서 개인을 촬영하도록 설정해서는 안 되며, 아울러 개인사생활 보호를 위해 CCTV에 녹음 기능을 추가해서는 안 된다.
{
m : "다음 중 누구든지 불특정 다수가 이용함으로써 개인의 사생활을 현저히 침해할 우려가 있는 장소로 CCTV 설치에 대하여 제약이 있는 장소에 해당하지 않는 것은?
목욕탕 내부㉢ 발한실㉧ 교도소 화장실 ",
      "탈의실정신 요양 시설 해설교도소, 정신보건(요양) 시설 등 법령에 근거하여 사람을 구금하거나 보호하는 시설로서 대통령령으로 정한 시설에 대해서는 내부에 CCTV 설치가 가능하다. ㉥
전단 38 1 39 5
106·개인정보관리사 CPPG
3
1
{
m : "다음 중 법령 고시에서 설명하는 접근 통제의 방법으로 틀린 것은?
번호(1)23(4)(5)구분 개인정보처리 시스템 제한망분리 외부 통제 모니터링 솔루션 구축 개인정보처리자 IP 주소 등으로 제한 ISMS 대상 기관의 개인정보처리시스템에서 개인정보를 다운로드, 파기, 권한 부여할 수 있는 직원의 컴퓨터 등은 물리적 또는 논리적으로 분리 개인정보가 홈페이지, P2P, 공유 설정 등으로 공개되는 것을 금지정보통신서비스 제공자 등 공인인증서 등 안전한 수단을 적용 ISMS 대상 기관의 개인정보처리시스템에 개인정보를 다운로드, 파기, 권한 부여서할 수 있는 직원의 컴퓨터 등은 물리적 또는 논리적으로 분리개인정보처리시스템에 접속한 IP(Intermet Protocol) 주소 등을 분석하여 불법적인 개인정보 유출 시도를 탐지개인정보처리시스템에 접속한 IP 주소 등 개인정보처리시스템에 접속한 IP 주소 등을 분석하여 불법적인 유출을 탐지 을 재분석하여 불법적인 유출 시도를 탐지 F/W, IPS, IDS 구축(※ 별도의 서버가 아닌 개인정보가 PC에만 있는 경우 PC용 방화 F/W, IPS, IDS 구축벽이나 백신 등 설치)"],
d : [],
h : "개인정보보호법에서는 개인정보처리자의 망 분리에 대한 대상자를 언급하지 않고 있다. 단, 개별법을 근거로 하여 정부, 지자체, 공공 기관 및 전자금융 기반 시설, 정보통신 기반 시설은 각 규정된 대상에 대해 망 분리를 해야 한다.",
k : "4과목. 개인정보의 보호 조치" },


40 2
4과목 개인정보의 보호 조치 ·
107
{
m : "다음 중 ○○사의 개인정보 유출 사건으로 본 정보통신망법상 개인정보의 기술적 보호 조치와 관련된 내용으로 가장 적절하지 않은 것은?
3500만명 개인정보 유출 개요도해킹·업데이트서버 변조(악성파일로 바꿔치기)2 해킹·악성코드 게시유출근거지(중국일대)알집 업데이트 서버666회원정보 전송좀비 PC접속, 원격제어P업체 서버(악성코드 유포자)E업체 서버(DB유출 경유지)사내망(좀비 PC)악성코드감염.DB서버(서버)TDB서버 접속⑥6 회원정보 유출자료: 경찰청
[출처:http://sports.donga.com/3/all/20110812/39481777/3]

* DB 서버에 접속한 관리자의 접속 기록을 월 1회 이상 모니터링하고 분석한다.",
      "퇴근 시 직원의 PC를 자동 또는 수동으로 전원을 끄도록 한다.③ PC에 백신 및 윈도우 방화벽을 설치하고, 저장된 개인정보에는 암호 설정을 하여
며, 기업 내부에서는 항상 정품 S/W를 사용하도록 한다.",
      "DB 서버는 외부와의 통신이 되지 않도록 차단한다.",
      "관리자 PC에 접속한 기록을 월 1회 이상 모니터링하여 내부 감사 시 반영한다."],
d : [],
h : "관리자 PC에 대한 접속 기록은 의무 사항은 아니며, PC의 접속 기록을 모니터링하고, 감사하는 것은현실적으로 어렵다고 볼 수 있다.",
k : "4과목. 개인정보의 보호 조치" },


저다 41 5
저장하
108
다음 중 PC에 대한 보안 설정으로 옳지 않은 것은?
화면 보호기 설정화면보호기)are utAPIN22 aBLMENT→화면 보기 (5)비눗방출대기(Aura veOAube Desig디제전원 관리디스플레이 밝기 및 기타 전원 설정을 조정하여 에너지를 약하거나성능을 최대화합니다.DE HER22012 2510PC 실시간 검사설정(T).- 다시 시작할 때 로그온 화면[화면 보호기 설정]실시간 없어7 기판 전단지& BOOK B사진 검사확인PEDR43410검사 대상 및 성공 개기록겁다SHEN히소대상과 그림입니다감사미리보기입니다[백신 설정]작품(A)3MA(2리 네트워크 유형의 설정을 사용자 지정합니다.8488362008 2004039품없는 개인 정원의 국가 담장FTP- 3-93일반7549 *** 200→ spressent 등의 사용안함 경장하지 않을작업2593-A444 22 493 팩 사용 관장하지 않4299238739FTAs-Out 45프로그램 및 서비스(24
* 0 의한 구로 할 수 없습니다.이름(N)[윈도우 방화벽 설정]SY90Dormatoo[윈도우 방화벽 설정(고급)]
날 사이트
Vai
2496328"],
d : [],
h : "보호기가 작동하더라도 화면 잠금 기능은 적용되지 않는다.",
k : "4과목. 개인정보의 보호 조치" },


42 €
KEM
& 494
[IIS 웹 서버 및 FTP 설정]
화면 보호기 설정 시 '다시 시작할 때 로그온 화면 표시'의 체크 박스가 해제되어 있는 경우에는 화면
TO
4과목 개인정보의 보호 조치
0
부
F
20
42
· 109
{
m : "다음 중 개인정보의 안전성 확보 조치 기준 고시에 따른 개인정보처리시스템에 대한 접속기록의 예시로 틀린 것은?
13구분 0㉢L 필수 기록 항목 ID 또는 개인 식별 정보 (고객번호 등)날짜(YYYY)접속자 IP Address(고정 IP. 사설 IP 등)개인정보처리 수행 업무다운로드한 고객 파일 정보 L C)해설상세 설명 개인정보취급자 식별 정보접속 일시 접속자 정보조회, 수정, 삭제, 인쇄 등 다운로드 파일명, 다운로드 파일 복사본(로그 서버 저장)㉤
접속 일시는 날짜와 시간이 포함되어야 하며, 다운로드한 개인정보 파일은 로그에 파일로 저장할 경우 파기, 열람 등의 이슈가 발생할 수 있다.
44
다음 중 개인정보가 포함된 보조 저장 매체의 반·출입 통제로 틀린 것은?

* 개인정보 처리자는 사무실 등 개인정보를 처리하는 업무 공간에서 개인정보가 저장된 USB 메모리, CD, 이동형 하드 디스크 등의 보조 저장 매체 반·출입에 의해 개인정보가 유출되지 않도록 반·출입 통제를 위한 보안 대책을 마련하여야 한다.",
      "보조 저장 매체 반·출입 통제를 위한 보안 대책 마련 시 보조 저장 매체의 보유 현황 파악 및 반·출입 관리 계획이 포함되도록 검토해야 한다.
보조 저장 매체의 반 출입 통제를 위한 보안 대책은 전사적으로 수립되어 운영되도록 할 필요가 있다.",
      "보조 저장 매체 반·출입 통제를 위한 보안 대책 마련 시 개인정보취급자(임직원, 파견 근로자, 시간제 근로자 등) 및 용역 업체의 직원 등에 의한 비인가된 보조 저장 매체 반 출입에 대한 대응 절차가 있는지를 검토해야 한다.
별도의 개인정보처리시스템을 운영하지 아니하고 업무용 컴퓨터 또는 모바일 기기를 이용하여 개인정보를 처리하는 경우에도 반드시 개인정보 처리자는 개인정보가 포함된 보조 저장 매체의 반·출입 통제를 위한 보안 대책을 마련하여야 한다.
43 4 44 5
정답
110
"],
d : [],
h : "개인정보의 안전성 확보 조치 기준에 "개인정보 처리자는 개인정보가 포함된 보조 저장 매체의 반출입 통제를 위한 보안 대책을 마련하되 별도의 개인정보처리시스템을 운영하지 아니하고 업무용 컴퓨터 또는 모바일 기기를 이용하여 개인정보를 처리하는 경우에는 이를 적용하지 아니할 수 있다"고명시하고 있다. 그러나 가급적 보안 대책을 마련하는 것이 좋다.",
k : "4과목. 개인정보의 보호 조치" },


{
m : "다음 중 개인정보의 안전성 확보 조치 기준에서 말하는 취약점 진단 기준 및 예시 문에 대한 설명으로 틀린 것은?
인터넷 홈페이지를 통해 고유 식별 정보(주민등록번호, 운전면허번호, 외국인등록번호, 여권번호)를처리하는 경우 개인정보 처리자는 고유 식별 정보가 유출·변조 훼손되지 않도록 해당 인터넷 홈페이지에 대해 연 1회 이상 취약점을 점검하여야 하며, 문제점이 발견된 경우 취약점을 제거하거나보완할 수 있는 보호 대책을 마련하고 계획에 따른 이행 조치를 하여야 한다.
고유 식별 정보를 처리하는 인터넷 홈페이지의 웹 취약점 점검 시에는 OWASP TOP 10 등과 같이잘 알려진 웹 취약점 항목들이 포함되도록 하며, 서버에 취약점을 파악하기 위해 개인정보를 필터링하고 감지할 수 있는 공개된 다양한 종류의 웹 셀을 설치하여 점검해야 한다.
웹 취약점 점검과 함께 시큐어 코딩을 적용하고, 정기적으로 관리자 페이지 노출 및 웹 쉘 등을 점검하고 조치하는 경우 인터넷 홈페이지를 통한 고유 식별 정보의 유출 변조 훼손의 위험을 더욱 줄일 수 있다.
인터넷 홈페이지의 취약점 점검 시에는 기록을 남겨 책임 추적성 확보 및 향후 개선 조치 등에 활용할 수 있도록 하고, 인터넷 홈페이지의 취약점 점검은 개인정보 처리자의 내부 인력, 외부 보안 전문 업체 등을 활용할 수 있으며, 취약점 점검은 상용 툴 공개용 툴, 자체 개발한 프로그램 등을 사용할 수 있다.고유 식별 정보를 처리하지 않더라도 비밀번호와 민감 정보(가족, 건강, 노조 가입 등)를 수집하는 경우에는 반드시 인터넷 홈페이지에 연 1회 이상 취약점 점검을 실시해야 한다.
4 ㉤"],
d : [],
h : "웹 셀은 취약점을 진단하고 예방하는 툴이 아니라 서버에 침투할 수 있는 악성 프로그램이 될 수 있으며, 개인정보의 안전성 확보 조치 기준에는 웹 취약점 진단의 기준이 홈페이지를 통해서 고유 식별 정보를 처리하는 경우에만 필수로 명시하고 있으나 그렇지 않은 경우에도 주기적인 진단을 실시할 것을 권장한다. 또한, 홈페이지에 대한 취약점 점검 대상은 고유 식별 정보를 처리하는 경우에만 필수 사항이다.",
k : "4과목. 개인정보의 보호 조치" },


45 4
4과목 개인정보의 보호 조치
·
111
{
m : "다음 중 개인정보처리스템에 대한 접속 기록의 보호 조치 및 관리에 대한 설명으로 틀린것은?

* A사는 개인정보처리시스템에 대한 접속 기록을 외장 하드에 저장하고, 시건 장치가 있는캐비넷을 제한 구역인 문서 보관실에 보관하고 있다.
B사는 DB 서버의 접근 로그가 쌓이는 스토리지에 시스템 관리자만 접속할 수 있도록 하고있으며 해당 폴더는 사용자 계정으로 쓰기 권한을 제한하고 있다.
C사는 업무 시스템의 성격상 로그 서버에 현업 관리자들이 접속하도록 하고 있으며, 쓰기권한을 제한하기 어려워 해당 로그별로 HMAC값을 생성하여 위변조에 대한 대책을 마련하고 있다.",
      "D사는 고객 정보 관리 시스템에 대한 접속 로그를 웜 디스크에 저장하고, 영구보관을 통해로그 손상을 막도록 조치하고 있으며, 해당 웜 디스크에 대한 장애 및 점검 이력을 주기적으로 감사하고 있다.",
      "E사는 콜 센터의 상담 이력, 콜 센터 관리자의 접속 이력을 별도의 통합 서버에 수집한 뒤분기별로 공인인증 기관을 통해 공증 받거나 외부 계약을 통해 전자문서 보관소에 로그를보관하고 있다."],
d : [],
h : "로그의 위변조를 위해 웜 디스크를 사용하는 것은 좋으나 개인정보보호법이나 정보통신망법에서 규정하고 있는 정보의 보존 기간을 넘어 파기되지 않는 문제가 존재할 수 있다. 따라서 보존 기간을 설정하여 보존 기간 내에서만 삭제가 불가한 솔루션이나 방법을 마련해야 한다.",
k : "4과목. 개인정보의 보호 조치" },


46 4
저다
112
47다음 중 개인정보의 안전성 확보 조치 기준 고시에서 정보 주체의 본인 확인을 위해 성명,주민번호를 사용할 수 있는 경우 정보 주체의 추가적인 정보를 확인하는 방법으로 적절하지 않은 것은?
13아이콘의 달인Cine함보주*즈감자La아이핀 ID/비밀번호찾기신념웹 비냉번호 찾기모자입력아이진기WANCARAN DAT MERETIRO 20하여번호PREHO EDR아이디비밀번호이용약관 개인정보급방침 $400937605로그인 상태 유지원면 최소확인 취소데스423C고객센터 9기IPO OFF일회용 로그인회원가입 아이디/로그인
SPONS
D
MUNE VO FE93
일간경기
GT40 234
18
88212
MY S
비밀번호찾기
https/나이스입지역주관반지명수n2차 비밀번호 입력2차비밀번호를 입력해 주십시오2차 일반 입력인 청소추기경PEN나이스메인화원 - 2차 더 연습SUP022256g사진의방등 BAND 1935
1895 ya
아이디 가장 아이디/비밀번호찾기
고객님의 정보보호를 위해 보안문자를 입력해주세요
64460
로그인"],
d : [],
h : "IP 보안이 OFF 되어 있어 ID, 비밀번호만으로 인증을 처리하고 있다.",
k : "4과목. 개인정보의 보호 조치" },


47 3
4과목 개인정보의 보호 조치·113
M
{
m : "다음 저장 중인 개인정보에서 보유 기간이 경과한 일부 개인정보를 파기하는 경우에 해당되는 것은?
운영 중인 개인정보가 포함된 여러 파일 중 특정 파일을 파기하는 경우 개인정보가 저장된 백업용 디스크나 테이프에서 보유 기간이 만료된 특정 파일이나 특정정보 주체의 개인정보만 파기하는 경우 ㉢ 운영 중인 데이터베이스에서 탈퇴한 특정 회원의 개인정보를 파기하는 경우 ",
      "회원 가입 신청서의 종이 문서에 기록된 정보 중 특정 필드의 정보를 파기하는 경우 ㉤ 운영 중인 데이터베이스에서 유효 기간이 지난 특정 회원의 개인정보를 파기하는 경우"],
d : [],
h : "해당 보기 모두 일부 개인정보를 파기하는 경우에 해당되며, 전체 삭제인 경우 DB를 인스턴스 단위나 물리적인 HDD 단위로 파기하는 경우에 해당한다.",
k : "4과목. 개인정보의 보호 조치" },


{
m : "다음 중 반드시 암호화해야 할 바이오 정보의 대상으로 적절하지 않은 것은?

* 인증 시 사용되는 원본 바이오 정보",
      "개인의 식별을 목적으로 가공되거나 생성된 특징적인 바이오 정보식별 및 인증 등의 고유 기능에 사용되는 바이오 정보",
      "콜 센터 등 일반 민원 상담 시 저장되는 녹취 기록이나 일반 사진 정보",
      "전산실 입출입시 사용되는 홍채 정보"],
d : [],
h : "콜 센터 등 일반 민원 상담 시 저장되는 음성 기록이나 일반 사진 정보는 반드시 암호화 대상이 될 수는 없다고 고시에서(개인정보의 안전성 확보 조치 기준) 명시하고 있다.",
k : "4과목. 개인정보의 보호 조치" },


저다 성남 48 5 49 4
114·개인정보관리사 CPPG
㉤
{
m : "다음의 개인정보 안전성 확보 조치 기준에서 설명하는 내용 중 괄호 안에 들어갈 용어는무엇인가?
중요한 개인정보를 처리하는 모바일 기기는 ( ) 등 모바일 단말 관리 프로그램을 설치하여 원격 잠금, 원격 데이터 삭제, 접속 통제 등의 조치를 취할 수 있다.
CDM
3 MDM",
      "UTM
③ HMC
TDM"],
d : [],
h : "MDM(MobileDevice Management)은 무선망을 이용해 원격으로 스마트 폰, 태블릿 PC 등의 모바일기기를 제어하는 솔루션으로 분실된 모바일 기기의 위치를 추적, 원격 잠금 설정, 원격 정보 삭제 특정 사이트 접속 제한, 카메라 등의 기능 제어와 앱 설치 통제의 기능을 제공한다.
다음 중 개인정보의 안전성 확보 조치 기준에서 설명하는 모바일 보안에 대한 내용으로 옳은
51
것은?

* 개인정보 처리자는 업무용 모바일 기기의 분실, 도난 등으로 개인정보가 유출 되지 않도록모바일 기기에 비밀번호 설정 등의 보호 조치를 해야 한다.
㉡ 업무용 모바일 기기는 성능이 높아 대량의 개인정보를 저장 및 전송할 수 있으나 휴대와이동이 편리하여 기기 분실·도난 시 해당 기기에 저장된 또는 해당 기기의 개인정보처리시스템 접속 등을 통한 개인정보 유출의 위험성이 높다. 따라서 스마트 폰, 태블릿 PC와같이 업무에 사용되는 모바일 기기는 분실·도난으로 개인정보가 유출되지 않도록 개인정보 처리자의 기기 운영 환경 및 처리되는 개인정보의 중요도 등을 고려하여 적절한 보안조치를 고려해야 한다.
㉢ 모바일 기기에 비밀번호, 패턴, PIN 등을 사용하여 화면에 잠금 설정을 한다.",
      "제조사별로 지원하는 '킬 스위치(Kill Switch)' 서비스나 이동 통신사의 '잠금 앱' 서비스를
이용한다.
3(C)",
      "모두 맞음
㉢, ㉣"],
d : [],
h : "해당 내용은 모두 개인정보보호법 기준에서 모바일 기기의 보안에 관한 내용을 설명하고 있다. 개인정보의 안전성 확보 조치 기준 고시에서는 위 보기와 같이 모바일 기기 보안에 대하여 상세하게 가이드를 하고 있다.",
k : "4과목. 개인정보의 보호 조치" },


50 3
과목 개인정보의 보호 조치
4·
51 $
115
{
m : "다음 중 개인정보보호법 고시에서 권고하는 홈페이지의 취약 점검에 대한 기술 문서로 옳
은 것은?
㉠ H/W S/W 개발 보안 가이드
시큐어 코딩 가이드(C, Java)
㉢ Web2.0 정보보호 실무 가이드",
      "홈페이지 취약점 진단 및 제거 가이드
⑥ CMMI(Capability Maturity Model Integration) 표준 문서"],
d : [],
h : "㉠ : H/W S/W 개발 보안 가이드 → 소프트웨어 개발 보안 가이드 행정안전부에서 배포하고 있으며, 개발 단계에서 구현할 때 발생할 수 있는 소프트웨어의 보안 취약점을 예방하는 차원으로 씨큐어 코딩 방법을 안내한다..㉡ : 행정안전부에서 배포하고 있으며, 소프트웨어를 개발할 때 참조할 수 있는 시큐어 코딩(SW 개발 보안) 언어별 가이드이다. ·㉢ : 행정안전부에서 배포하고 있으며, ICT 신기술 관련 정보보호 실무 가이드(정보 신기술 도입의 보안 관리 실무 가이드, RFID/USN 정보보호 실무 가이드, WEB 20 정보보호 실무 가이드) 중의 하나이다. ",
      ": 한국인터넷진흥원에서 배포하고 있으며, 취약점 항목의 경우 '홈페이지 소프트웨어(웹) 개발 보안 가이드'와 '주요 정보통신 기반 시설 취약점 분석 및 평가 기준' 항목을 바탕으로 구성된 가이드이다.· CMMI는 소프트웨어 개발 방법론에 관한 성숙도 모델이다..",
      k : "4과목. 개인정보의 보호 조치" },


다음 중 개인정보에 대한 파기의 내용으로 가장 적절하지 않은 것은
53 ?

* 개인정보 파기 시 파기를 전문으로 수행하는 업체를 활용할 수 있다. ",
      "개인정보 처리자의 회사 내부에서 개인정보보호 담당자의 입회하에 파기하되 계약을 맺은 외주 업체가 수행한다.
③ 파기 업무를 위해 계약된 외주 업체에 파기 장비를 배송하여 외주 업체의 회사에서 파기를 진행한다.
52 3 53 4
저다
116
",
      "외주 업체를 통해 파기를 수행한 후 파기 확인서를 받고, 이때 확인서의 상세 내용을 작성하도록 하기 위해 사전에 파기할 개인정보 파일에 대한 파일명과 각 파일명에 포함되어 있는 개인정보의 내용을 제공한다.",
      "개인정보 파기 시행 결과 확인은 개인정보보호 책임자의 책임 하에 수행하고, 해당 사항을 기록 및 관리한다."],
d : [],
h : "외주 업체에 파기 업무를 대행하도록 하더라도 제공하는 개인정보에 대한 파일명과 포함된 개인정보의 상세 내용을 알려주는 것은 바람직하지 않다.",
k : "4과목. 개인정보의 보호 조치" },


다음 중 무선망을 통하여 개인정보를 처리하는 경우 보안 조치에 대한 설명으로 적절하지 않은 것은?
54

* 개인정보 처리자는 공개된 무선망을 이용하여 개인정보를 처리하는 경우 취급중인 개인정보가 신뢰되지 않은 무선 전송 구간 및 무선망의 취약점 등에 의해 열람 권한이 없는 자에게 공개되거나 유출되지 않도록 보안 조치를 취해야 한다.",
      "모바일 기기, 노트북에서 개인정보처리시스템에 개인정보 전송 시 전송 암호화 기능이 탑재된 별도의 앱(App)이나 프로그램을 설치하고, 이를 이용하여 전송하도록 한다. ③ 노트북 등의 모바일 기기에 업무상 목적으로 개인정보를 저장할 경우 해당 파일에 암호를 설정하거나 파일 암호화 프로그램을 적용한 후 저장하도록 한다.",
      "모바일 기기, 노트북에서 무선 AP에 암호화 프로토콜을 설정 시 WPA2(Wi-Fi Protected Access 2) 방식을 사용한다.",
      "업무 성격에 따라 사내의 모든 개인정보취급자에게 노트북을 이용한 무선 랜을 사용하게 할 경우 무선 랜 대역에 대한 접근 통제를 방화벽으로 구현하고, 이때 보안 관리자의 업무부하를 줄이기 위해 개인정보취급자의 무선 IP는 고정 할당 또는 자동 할당 방식을 사용할 수 있다."],
d : [],
h : "개인정보취급자에게 무선 IP가 유동 IP로 계속 변경될 경우에는 방화벽을 통한 특정 개인정보취급자에 대한 접근 통제가 우회될 소지가 있다.",
k : "4과목. 개인정보의 보호 조치" },


54 5
과목 개인정보의 보호 조치
4· 117
{
m : "다음의 개인정보보호법에서 말하고 있는 접근 통제의 내용 중 괄호 안에 들어갈 내용으로가장 적절한 것은?
침입 차단 시스템 및 침입 탐지 시스템을 설치 및 운영하거나 침입 차단 시스템과 침입 탐지 시스템이 동시에 구현된 침입 방지 시스템(㉠), 웹 방화벽 또는 보안 운영 체제(㉡) 등을 도입할 수 있다. 또한, 스위치 등의 네트워크 장비에서 제공하는 (㉢)기능을 이용하여 IP 주소 등을 제한함으로써 침입 차단 기능을 구현할 수 있다. 인터넷 데이터 센터, 클라우드 서비스, 보안 업체 등에서 제공하는 보안 관제 서비스를 활용함으로써 초기 투자 비용 등을 줄일 수 있다. 공개용 무료 소프트웨어를 사용하거나 운영 체제에서 제공하는 기능을 활용하여 해당 기능을 포함한 시스템을 설치 및 운영할 수 있다. 다만, 공개용 무료 소프트웨어를 사용하는 경우에는 적절한 보안이 이루어지는지를 사전에 점검하여야 한다. 불법적인 접근 및 침해 사고 방지를 위해서는 침입 차단 및 침입 탐지 기능을 갖는 장비 설치와더불어 적절한 침입 차단 및 침입 탐지 정책 설정, 로그 분석 및 이상 행위 대응, 로그 훼손방지 등 적절한 운영 및 관리가 필요하다.
:IPS, ㉡:Secure OS, ㉢ : ACL
(2) ㉠:IPS, ㉡:Secure OS, ㉢ : Community String
(3) ㉠:IDS, ㉡: Vaccine, ㉢:ACL",
      "㉠ : IDS, ㉡ : Vaccine, ㉢ : Community String
(5 ㉠:IPS, ㉡:Vaccine, ㉢ : ACL"],
d : [],
h : "• 백신은 서버 보안 솔루션(Secure OS)과는 그 성격이 약간 다르며, 네트워크 장비의 CommmunityString값 설정은 IP 통제와는 관련이 없다.·IPS : Intrusion Protect System의 약자로 특정 패턴의 불법적인 접근을 탐지 및 차단할 수 있으며,최근에는 방화벽 기능도 제공하고 있다.Secure OS : 서버에 설치하는 OS(운영 체제) 기반의 보안 솔루션으로 특정 서버에 대한 접근 차단, 인가되지 않은 명령어 통제 등이 가능하다.· ACL : 접근 통제 리스트(Access Control List)의 약자로 방화벽의 보안 정책 룰셋 목록과 동일한개념으로 접속할 단말기의 IP와 포트를 Line별로 등록하여 통제가 가능하다.",
k : "4과목. 개인정보의 보호 조치" },


저다 ㉧㉥ 55 1
118
{
m : "다음 중 개인정보보호법에 따른 개인정보 책임자와 개인정보 취급자에 대한 권한 및 계정관리에 대한 설명으로 가장 적절하지 않은 것은?

* 개인정보 처리자는 개인정보처리시스템에 대한 접근 권한을 업무 수행에 필요한 최소한의 범위로 업무 담당자에 따라 차등 부여하여야 한다.",
      "개인정보 처리자는 전보 또는 퇴직 등 인사 이동이 발생하여 개인정보 취급자가 변경되었을 경우 지체 없이 개인정보처리시스템의 접근 권한을 변경 또는 말소하여야 한다.
③ 개인정보 처리자는 개인정보처리시스템의 권한 부여, 변경 또는 말소에 대한 내역을 기록하고, 그 기록을 최소 3년간 보관하여야 한다.",
      "개인정보 처리자는 개인정보처리시스템에 접속할 수 있는 사용자 계정을 발급하는 경우 개인정보 취급자 별로 사용자 계정을 발급하여야 하며, 다른 개인정보 취급자와 공유되지 않도록 하여야 한다.",
      "개인정보 처리자는 개인정보 취급자 또는 정보 주체가 안전한 비밀번호를 설정하여 이행할 수 있도록 비밀번호 작성 규칙을 수립하여 적용하며, 개인정보처리시스템의 관리자 계정 비밀번호와 홈페이지의 정보 주체 계정은 비밀번호가 6개월 주기로 반드시 변경되도록 강제화해야 한다."],
d : [],
h : "개인정보보호법에 따른 비밀번호의 강제화는 개인정보처리시스템에 국한되며, 정보 주체의 홈페이지는 의무 대상이 아니다.",
k : "4과목. 개인정보의 보호 조치" },


56 5
4과목 개인정보의 보호 조치·119
다음 중 개인정보 처리 시의 계정 관리에 대한 예시로 괄호 안의 용어가 적절한 것은?
· 개인정보보호 책임자에게는 전체 권한(㉠)을 부여하고, 개인정보 취급자에게는 기본적으로 일부 권한(㉡)만 부여하는 등 접근 권한에 차등을 두어야 하며, 필요 시 내부 승인을 통해 조회 이외의 권한을 부여할 수 있다.●· 내부 인력의 퇴직 시 해당 인력의 계정을 지체 없이 변경하도록 지침에 반영하여 이행하도록 하며, 임직원의 퇴직 시 계정 말소를 효과적으로 이행하기 위해서는 퇴직 점검표에사용 계정의 말소 항목을 반영하여 계정의 말소 여부에 대해 확인을 받을 수 있다..· 다수의 개인정보취급자가 동일한 업무를 수행한다 하더라도 하나의 사용자 계정을 공유하지 않도록 개인정보 취급자 별로 (㉢)를 발급하여 사용하고, 각 개인정보 취급자별 개인정보 처리 내역에 대한 (
*)을 확보하여야 한다.· 개인정보 취급자 1명이 서로 권한이 다른 조회, 삭제의 2개 업무 수행 시 (㉤)업무용과(⑥) 업무용으로 구분하여 2개의 사용자 계정을 발급할 수 있다.
읽기/쓰기/변경 ㉡ 읽기 ㉢ 아이디
* 책임 추적성 ▣ 전체 권한 ⑥ 읽기",
      "㉠ 읽기/쓰기/변경 ㉡ 읽기 ㉢ 아이디 ",
      "책임 추적성 ㉡ 조회 ⑥ 삭제읽기/쓰기/변경 ㉡ 읽기 ㉢비밀번호 ",
      "소명 내역 ▣ 전체 권한 ⑥ 읽기쓰기/변경 ㉡ 읽기 ㉢ 아이디 소명 내역 ▣ 조회 ⑥ 삭제쓰기/변경 ㉡ 읽기 ㉢ 비밀번호 ",
      "소명 내역 ▣ 전체 권한 ⑥ 읽기"],
d : [],
h : "• 책임 추적성 : 개인정보 처리에 따른 사고 발생 시 시스템에 기록된 로그를 통해 사용자의 책임 소재를 파악할 수 있어야 한다.소명 내역 : 개인정보 처리 관련 사고 또는 문제 발생 시 관련 담당자에게 해당 이력에 대한 정당성을 증명하도록 한다.",
k : "4과목. 개인정보의 보호 조치" },


{
m : "다음은 위탁사 또는 수탁사가 수탁사의 임직원에 관한 개인정보보호 교육 시 포함될 내용을 기술하였다. 괄호 안에 들어갈 적절한 내용은?
·수탁 업무의 목적과 범위. (㉠)·수탁자 개인정보처리시스템 및 업무용 PC의 접근 권한 관리, 접근 통제, 개인정보의 암호화,접속 기록의 보관 및 점검, 악성 프로그램 방지 등 개인정보의(㉡) 확보 조치 기준·수탁 받은 개인정보 처리 업무의 안전한 확보 조치 방법·수탁 받은 개인정보 처리 업무의 목적 달성 또는 계약 해지 시 개인정보 (㉢).· 개인정보 취급자의 의무.·수탁 업무와 관련하여 개인정보 관리 현황 점검 등 감독에 관한 사항.· 수탁자가 준수하여야 할 의무를 위반한 경우 손해 배상 등에 관한 사항
57 2 58 3
정답
57
120

* ㉠ 개인정보의 수집 방법 ㉡ 기밀성 ㉢ 제공개인정보의 수집 방법 ㉡ 가용성 ㉢ 분리
* 목적 외 개인정보 처리 금지 사항 ㉡ 안전성 ㉢ 파기 4)
* 목적 외 개인정보 처리 금지 사항 ㉡ 안정성 ㉢ 분리 개인정보의 수집방법 ㉡ 무결성 ㉢ 이용"],
d : [],
h : "수집은 위탁사에서 하고 있으나 수탁사 또한 제공받은 목적 외 사용을 금지해야 하며, 개인정보보호법의 기술적인 보호 조치에 관한 고시는 "개인정보의 안전성 확보조치 기준'로 명명한다. 기밀성 가용성, 무결성은 정보보호의 3대 기본 원칙을 말하는 것이다. 또한 개인정보 수집에 대한 목적이 완료되면 반드시 법률에 근거하여 파기하거나 분리 및 보관해야 한다.",
k : "4과목. 개인정보의 보호 조치" },


{
m : "다음의 개인정보보호 교육 시 포함될 항목으로 괄호 안의 내용이 틀린 것은?
.· 개인정보보호의 중요성 (㉠ 외부 관리 계획)의 준수 및 이행위험 및 대책이 포함된 조직 보안 정책, 보안 지침 지시사항 (㉡보험 관리) 전략 ●· 개인정보처리시스템의 안전한 운영 및 사용법㉢ 하드웨어, 소프트웨어 등)●ㆍ개인정보의 안전성 확보 조치 기준●· 개인정보보호 위반을 보고해야 할 필요성.· 개인정보보호 업무의 절차, 책임, (",
      "작업 설명. 개인정보보호 관련자들의 금지 항목 개인정보보호 준수 사항 이행의 관련 절차 개인정보 유·노출 및 ㉤ 침해 신고) 등에 따른 사실 확인 및 보고, 피해 구제 등 업무 절차",
      "2,0"],
d : [],
h : "외부 관리 계획이 아니라 내부 관리 계획을 수립해야 하며, 보험 관리 전략이 아니라 위험 관리 전략을 수립해야 한다. 보험 관리는 위험 관리 전략에 따른 일부 대책이 될 수 있다.",
k : "4과목. 개인정보의 보호 조치" },


590
4과목 개인정보의 보호 조치
·
121
{
m : "다음은 개인정보의 위험도 분석 결과에 대한 보고서이다. 괄호 안에 들어갈 내용으로 틀린 것은?
개인정보 파일명
년
/ (성명)
(소속)
작성일
(작성 예시)
작성자
1. 현황 조사 1. 개인정보 파일 현황 2. 고유 식별 정보 현황 3. (㉠ DBMS) 구성도
〈목차〉
II. 기관 기준 보호 조치 현황
1. 정책 기반 보호 조치
조직도, 책임자, 역할 및 책임
내부 관리 계획 및 침해 사고 대응 계획의 수립 현황
- 외주 보안 관리 현황
- S/W 사용 정책 / ㉡ 수탁사 개인정보) 교육 현황
2. 네트워크 기반 보호 조치
- IP 접근 통제 및 서비스 포트 제한 현황
- 정보보호시스템 운영 및 모니터링 현황
네트워크 바이러스 차단 현황 / 네트워크 접속 기록 관리 및 분석 현황
네트워크 장비 및 정보보호시스템 업데이트 현황
III. 개인정보처리시스템 기준 보호 조치 현황
1. DB 및 Application 기반 보호 조치 - DB 접근 통제현황 /DB 서버 서비스 포트 제한 현황- DB 접속 기록 관리 및 모니터링 현황 - 관리자 PC 네트워크 분리 현황- DB 접근 권한 부여 현황 및 변경·말소 내역(
* DBA 개별 ID) 관리 정책 및 현황 물리적 접근 통제현황 / 보조 기억 매체 이용 관리 현황 운영 체제의 보안 패치 현황 - DB 저장매체 불용 처리 절차 및 현황 2. 웹 기반 보호 조치 - ( 개인정보 게시판 노출) 현황 및 결과 웹 서버 보호 조치 현황Ⅳ. 위험도 분석 결과
위험도 분석 점검에 의한 위험 처리) 여부 판정 결과 등
저단 60 5
122
㉢,㉣,㉤

* ㉡, ㉢, ㉣, ㉤"],
d : [],
h : "괄호 안에 내용이 모두 틀리거나 적절하지 않은 내용이며 각 항목별로 정리하면 : 네트워크 및 시스템, ㉡ : 개인정보취급자, ㉢ : 비밀번호, ",
      ". 웹 취약점 점검, 암호화가 맞는 내용이다.",
      k : "4과목. 개인정보의 보호 조치" },


{
m : "다음 개인정보 관련 소송에 대한 판례에서 관련이 없는 것은 무엇인가?
서울중앙지법 2006.4.28. 선고 2005가단240057 판결[손해 배상(기)] 항소(각공 2006.6.10.(34), 1246]
(출처: 서울중앙지방법원 2006.04.28. 선고 2005가단240057 판결 : 항소손해 배상(기)] > 종합 법률 정보 판례)
[이유]
1. 인정 사실
㉣, ㉤
가. 피고 회사는 게임 사업을 운영하며 다중 이용자 온라인 롤플레잉 게임(MMORPG: MassivelyMultiplayer Online Role Playing Game)인 (게임명 생략) 게임(이하 '이 사건 게임'이라고 한다)을 개발하여 그 이용 서비스를 제공함으로서 수익을 올리는 회사이고, 원고 1은 아이디 생략)..원고 2는 (아이디 생략)', 원고 3은 (아이디 생략)', 원고 4는 아이디 생략)', 원고 5는 아이디생략)'이라는 아이디로 이 사건 게임 서비스를 이용하고 있는 이용자들이다.
나. 피고 회사는 2005. 5. 11. 이 사건 게임 서버 및 네트워크 정기 점검 및 업데이트 작업을 실시하는 과정에서 담당 직원이 아이디/비밀번호 입력과 관련된 기능을 테스트하기 위하여 임시로 이용자들의 아이디와 비밀번호가 평문으로 로그 파일(log 주1)에 기록되도록 하였다가 테스트 종료 후 아이디/비밀번호 기록 기능을 삭제하지 않은 상태에서 서버 업데이트 작업을 마치는 바람에 2005. 5. 11. 오전 10시부터 이 사건 게임에 접속한 이용자들에 대하여 생성된 로그 파일에이용자들의 아이디와 비밀번호가 기록되게 되는 사고(이하 '이 사건 사고"라고 한다)가 발생하게 되었다.
다. 피고 회사는 2005, 5. 16, 12:00경에서야 이용자들의 아이디와 비밀번호가 로그 파일에 기록되고 있음을 알게 되었고, 즉시 이용자들의 게임 서버 접속을 차단하고 아이디와 비밀번호가 로그 파일에 기록되도록 하는 기능을 삭제하였으며, 이미 개별 컴퓨터에 생성된 로그 파일이 삭제되도록 하는 시스템 패치 작업을 실시하였다.
61 2
4과목 개인정보의 보호 조치 ·
123
라. 피고 회사는 이러한 시스템 패치 작업과 더불어 2005. 5. 16. 13:20부터 15:45까지 이용자들의 게임 서버 접속을 차단하고, 이 사건 사고 기간(2005. 5. 11, 10:00 ~ 2005, 5. 16. 12:00) 동안에 이 사건 게임에 접속하였던 모든 이용자들로 하여금 주민등록번호로 동일인 확인을 거친 후에 새로운 비밀번호로 변경한 다음에서만 이 사건 게임에 접속할 수 있도록 하는 조치를 취하였다. 마. 원고들은 이 사건 사고 기간 동안 이 사건 게임에 접속한 이용자들이다.
바. 이 사건 게임의 로그 파일은 이용자가 이용하는 컴퓨터의 하드 디스크 C 드라이버에 C:// Program Files/ (이하 생략)라는 경로를 가진 파일로 저장이 된다.
사. 피고 회사는 2005. 5. 16. 이 사건 사고와 관련하여 이 사건 게임 홈페이지에 이용자들에 대한 사과문을 게재하고, 유료 이용자들에게 1일간의 무료 사용권을 제공하는 것 이외에는 이 사건 사고와 관련하여 이용자들에게 별다른 보상 조치를 취한 것이 없다.
개인정보의 기술적 보호 조치 위반",
      "아이디, 비밀번호 암호화 정책의 위반
③ 개인정보 수집 목적 외 이용",
      "개인정보 유출의 빌미 직간접적 제공",
      "본인확인 위반"],
d : [],
h : "비밀번호의 암호화 조치를 하지 않은 것에 대해서 기술적 보호 조치를 실시하지 않은 것은 맞지만 아이디 그 자체로는 식별 정보로서 법적인 암호화 대상은 아니다.
{
m : "다음의 내용은 개인정보가 유출된 이후 해당 기관에서 회원들에게 통지한 메일 내용이다. 상세 내용 중 틀린 것은?
개인정보 유출 통지문
안녕하세요 ○○ 고객님!
최근 2015년 0월 00일에 발생한 본 기관의 회원 정보 유출에 대하여 진심으로 머리 숙여 사과드립니다. 이번 사건은 본 기관 업무용 PC가 악성 코드에 감염된 것이 발단이었으며, 그 결과 업무 폴더에 저장된 대외비와 회원 정보 파일이 해외의 공격 서버로 전송된 것을 확인하였습니다. 현재 경찰과 관련 수사 기관에 해당 내용을 즉시 신고하여 조사 중에 있습니다. 본 기관에서는 해당 내용을 철저히 파악하여 진상 규명을 하도록 하겠습니다. 수사 기관과 본 기관에서 확인한 바 중요한 개인정보는 암호화된 상태로 반출되었으나 2차 피해를 막기 위해 본 기관 및 고객님이 사용하시는 비밀번호를 반드시 변경해 주시기를 부탁드립니다. 다시 한 번 회원님께 거듭 죄송하오며, 고객님의 추가 조치 사항 및 본원의 안내를 다음과 같이 알려드립니다.
124
1. ㉠ 유출된 개인정보 내용
홈페이지 ID, 비밀번호(암호화되어 있음), 이메일, 생년월일
2. 유출 시간 : 2015년 ○○월 ○○일 ○○ 시
3. ㉡ 유출 경위
too 부서의 업무용 PC에 XX 악성 코드가 설치되어 해외의 XXXX 공격자에 의해 원격으로 PC가 장악 당함
· 이후 공격자에 의해 업무 폴더의 회원 정보를 포함한 500여개의 엑셀 파일이 압축되어 외부 서버(IP: *************)로 전송됨
4.
* 개인정보처리자의 기관) 조치 사항
해당 서버 IP는 현재 본 기관 방화벽을 통해 차단하였으며, 해당 PC는 포맷을 통해 모든 데이터를 삭제 처리하였음
현재 모든 PC에 대하여 악성 코드 탐지 솔루션 및 좀비 PC 솔루션을 통해 분석 및 전수 검사 중에 있으며, 감염된 대역의 모든 PC 네트워크 대역에 대하여 인터넷을 차단함
5. 정보 주체 (0 회원님)가 조치할 수 있는 사항
비밀번호 변경 하러 가기(클릭)",
      "구제 절차 : 아래 기관에 개인정보 피해 관련 구제 및 분쟁 해결 상담이 가능합니다.
. 개인정보 분쟁조정위원회 : (www.kopico.go.kr)
개인정보 침해신고센터 : (국번 없이) 118(privacy.kisa.or.kr)
·ⓑ 접수처
. 개인정보보호 책임자 : 고객정보실 실장 홍길동
개인정보보호 담당자 : 고객정보실 대리 이방원"],
d : [],
h : "개인정보 유출 시 정보 주체(고객)에게 해당 유출에 대한 피해 접수 및 상담을 받을 수 있도록 해당 기관의 개인정보보호 담당자의 연락처(유선, 이메일 등)를 기재해야 한다.
62 5
4과목 개인정보의 보호 조치 ·
125
63A기업의 감사 부서는 최근 ○○일 ○○시에 ○○부서의 담당자가 특정 개인정보 파일을 과도하게 조회 및 다운로드한 것을 파악하고, 이에 대하여 ○○ 부서에 소명 요청을 하였다. 감사 부서가 ○○부서 담당자의 잘못을 확인할 수 있었던 자료로 적절하지 않은 것은?
개인정보처리시스템 관리자 페이지 접속 로그㉡ 개인정보취급자 권한 부여 관리 대장㉢ 개인정보 흐름도 및 흐름표",
      "와스 서버 어플리케이션 Access 로그ⓑ DB 접근 제어 솔루션⑥ 개인정보 파일 검색 시스템
* 그룹웨어 시스템"],
d : [],
h : "개인정보 흐름도와 그룹웨어를 통해서는 개인정보 처리에 대한 오남용 여부를 직접적으로 확인할 수 없다.. 개인정보처리시스템 관리자 페이지 접속 로그 : 개별 ID의 로그인 기록 확인. 개인정보취급자 권한 부여 관리 대장 : 조회, 삭제 등의 권한 확인 개인정보 흐름도 및 흐름표 : 개별/전체 업무 절차별 개인정보의 흐름 구성도·와스 서버 어플리케이션 Access 로그 : 개별 ID, IP의 어플리케이션 접속 시간 확인·DB 접근 제어 솔루션 : 개별 ID. IP의 DB 접속 시간 확인 개인정보 파일 검색 시스템 : 특정 PC에 저장된 개인정보 파일 검색 로그 확인 그룹웨어 시스템 : 업무용 전자 결제, 사내 메일 등의 업무 시스템
전단 63 2
126
5과목
: 개인정보 관리 체계
{
m : "다음 중 정보보호 및 개인정보보호 관리 체계(ISMS-P) 인증에 대한 설명으로 틀린 것은?





* 인증 심사 기준은 KISA-ISMS, ISO/IEC27001, 012 등 국내외 표준과 정보통신망법을고려하여 국내 환경에 적합하도록 보완하여 개발한 인증 제도이다.
㉡ 개인정보 활동을 체계적으로 수행하기 위해 필요한 관리 과정과 보호 대책, 생명 주기, 법률 준수의 총 4가지 분야로 구성된다.
㉢ 인증 심사에서 발견된 결함 사항에 대해서는 신청 기관이 보완 조치를 할 수 있도록 최대30일의 조치 시간을 주며, 보완 조치가 된 후에는 인증 위원회를 개최하여 심사 결과에 대한 최종 심의를 한 후 인증 여부를 결정하게 된다.",
      "2018년 11월 7일부터 시행되는 개인정보보호 관리 체계 인증 제도는 ISMS-P이다.㉤ 개인정보보호 관리 체계의 참조 모델로서는 BS10012 규격이 있다.
③ ㉢.g"],
d : [],
h : "•㉡ : 개인정보보호 관리 체계 인증 구조는 1. 관리 체계 수립 및 운영 +2 보호 대책 요구 사항 -3. 개인정보 처리 단계별 요구 사항으로 이루어진다.·㉢ : 심사 후 결함 보완 조치 기간 : 40일, 추가적인 보완 조치 기간 : 60일 총 100일
01 4
5과목 개인정보관리 체계 ·
127
{
m : "다음 중 정보보호 및 개인정보보호 관리 체계(ISMS-P) 인증의 관리 과정(관리 체계 수립 및 운영)으로 순서가 올바른 것은?

* 위험 관리 → 관리 체계 운영·관리 체계 기반 마련 → 관리 체계 점검 및 개선",
      "관리 체계 운영위험 관리 → 관리 체계 기반 마련 → 관리 체계 점검 및 개선③ 관리 체계 운영 위험 관리 → 관리 체계 점검 및 개선 관리 체계 기반 마련
* 관리 체계 기반 마련 → 위험 관리 관리 체계 운영 관리 체계 점검 및 개선",
      "관리 체계 기반 마련 위험 관리 관리 체계 점검 및 개선 → 관리 체계 운영 -"],
d : [],
h : "● 관리 체계 기반 마련 : 경영진의 참여, 최고 책임자의 지정, 조직 구성, 범위 설정, 정책 수립원 할당. 위험 관리 : 정보 자산 식별, 현황 및 흐름 분석, 위험 평가, 보호 대책 선정. 관리 체계 운영 : 보호 대책 구현, 보호 대책 공유, 운영현황 관리. 관리 체계 점검 및 개선 : 법적 요구 사항 준수 검토, 관리 체계 점검, 관리 체계 개선
{
m : "다음 중 정보보호 및 개인정보보호 관리 체계 인증 획득으로 인한 효과에 대한 설명으로 틀린 것은?
, 자

* 조직의 개인정보보호 관리 체계에 대하여 지속적이고 체계적으로 관리할 수 있다.",
      "외부 기관의 인증 심사를 통해 객관적이고, 제3자의 입장에서 개인정보 관리에 대한 수준을 측정 받을 수 있다.
인증 기관의 심사를 통해 조직 내 보안 수준을 끌어올려 외부 공격에 빈틈없는 대응 및 처리를 할 수 있다.",
      "정보보호를 위한 기업의 노력을 대내외에 알려 신뢰도를 높일 수 있게 된다.",
      "법적 준거성에 대한 위험 요소를 제거하고, 관리할 수 있는 시발점이 될 수 있다."],
d : [],
h : "인증은 관리 체계 수립과 운영에 대한 전체적인 점검 차원으로 일부 해킹과 관련한 문제점을 찾아내 조치하도록 할 수는 있지만 해킹을 완벽하게 막을 수 있는 것은 아니며, 기업의 자율적인 노력이 요구되는 사안이라고 볼 수 있다.
저다 02 4 03 3
128
{
m : "다음 중 개인정보보호 관리 체계(ISMS-P)의 도표에 들어갈 알맞은 절차는?
1. (7)2. 보호 대책 요구 사항(64)3. 개인정보 처리 단계별 요구 사항 1.1 관리 체계 기반 마련 1.2 위험 관리 1.3 관리 체계 운영 1.4 관리 체계 점검 및 개선구분 1(2)(3)45(7)관리 체계 운영관리 체계 수립 및 운영관리 체계 운영관리 체계 수립 및 운영관리 체계 운영 21 정책, 조직, 자산 관리 2.2 인적 보안 2.3 외부자 보안 2.4 물리 보안25 (L)2.6 접근 통제 2.7 암호화 적용 2.8 (㉢)2.9 시스템 및 서비스 운영 관리 2,10 시스템 및 서비스 보안 관리 2.11 사고 예방 및 대응 2.12 재해 복구 (㉡) 인증 관리 인증 및 권한 관리 권한 관리 인증 및 권한 관리인증 관리 (㉢)정보시스템 도입정보시스템 도입 및 개발 보안정보시스템 도입정보시스템 개발 보안정보시스템 도입 및 개발 보안 3.1 개인정보 수집 시 보호 조치 3.2 개인정보 보유 및 이용시 보호 조치 3.3 (2)3.4 개인정보 파기 시 보호 조치 3.5 (0)(2) 개인정보 위탁시보호 조치 개인정보 제공시 보호 조치 개인정보 위탁시보호 조치 개인정보 제공시 보호 조치 개인정보 위탁시보호 조치 (0)정보 주체 및 처리자 권리 보호정보 주체 권리 보호정보 주체 및 처리자 권리 보호정보 주체 권리 보호정보 주체 및 처리자 권리 보호"],
d : [],
h : "ISMS-P는 크게 3가지 대분류인 * 1. 관리 체계 수립 및 운영(16) -2 보호 대책 요구 사항(64)","3개인정보 처리 단계별 요구 사항(22)'으로 구성된다.
04 2
5과목 개인정보 관리 체계·129
{
m : "다음은 DPA(Data Protection Act)를 기반으로 만들어진 개인정보의 효과적 관리를 위한 체계에 관한 표준으로 개인정보 관리를 위한 기본 체계 및 신뢰를 제공하고 컴플라이언스에 대한 평가를 위해 내외부 평가가 효과적으로 이루어지도록 하며, 조직 내 개인정보보호관리 체계에 대한 수립, 책임, 구현 및 유지를 목적으로 하는 영국 표준 규격은?

* ISO27001",
      "e-Privacy
③ BS10012",
      "KISA-ISMS",
      "P-Mark"],
d : [],
h : "BS10012는 개인정보보호 관리 체계에 대한 영국 표준 협회의 규격으로 개인정보 관리 체계의 수립. 개인정보 관리 체계의 이행과 운영, 개인정보 관리 활동에 대한 감사 활동 및 경영 검토 등 총 6개 분야의 세부 통제 항목들을 모두 만족시켜야만 인증서가 부여되는 개인정보보호 관리 체계에 대한 글로벌 표준이라고 할 수 있다.
{
m : "다음 중 개인정보 영향 평가에 대한 설명으로 옳지 않은 것은?

* "개인정보 영향 평가(이하 "영향 평가"라 한다)"란 시행령 제35조에 해당하는 개인정보 파일의 운용에 따라 정보 주체의 개인정보 침해가 우려되는 경우에 그 위험 요인의 분석과 개선 사항 도출을 위한 평가를 말한다.",
      "개인정보 영향 평가 기관의 의무 대상은 공공 기관 및 공공 기관과의 업무 공조가 필요한 민간 기관에 해당하며, 그 이외인 경우는 자율적으로 수행이 가능하다.
③ " 평가 기관"이란 공공 기관의 영향 평가를 수행하기 위하여 개인정보보호위원회가 지정한 기관을 말한다.",
      ""대상 시스템"이란 시행령 제35조에 해당하는 개인정보 파일을 구축 및 운용, 변경 또는 연계하려는 정보 시스템을 말한다.",
      "개인정보보호위원회는 영향 평가 수행 능력 심사의 세부 평가 기준에 따른 심사 결과가 총점 75점 이상인 경우 신청한 법인을 평가 기관으로 지정한다."],
d : [],
h : "민간 기관은 자율적으로 영향 평가를 시행할 수 있으며, 의무 대상에 대한 제한 조건은 없다.
05 3 06 2
저다
130
{
m : "다음 중 개인정보 영향 평가 기관의 지정 심사위원회 자격과 관련된 설명으로 틀린 것은?
보호위원회는 상임위원 2명(위원장 1. 부위원장 1)을 포함한 9명의 위원으로 한다.
위원 구성은 국무총리 및 위원장 제청, 대통령이 소속되거나 소속되었던 정당의 교섭단체추천 등으로 한다.
요구 경력은 3급 이상 공무원(개인정보보호 업무), 공공기관(또는 단체)의 임원 또는 임원으로 재직(3년 이상)하였거나 이들 기관 또는 단체로부터 추천받은 사람으로서 개인정보보호 업무를 5년 이상 담당하였던 사람이다.",
      "위원장과 부위원장은 정무직 공무원으로 임명한다.㉤ 위원의 임기는 1년으로 하되, 한 차례만 연임할 수 있다.
60.3"],
d : [],
h : "㉢ : 개인정보 보호 업무 관련 경력은 최소 3년이다..㉤ : 위원의 임기는 3년이다.
{
m : "다음 중 개인정보 영향 평가의 대상이 아닌 것은?
구축·운용 또는 변경하려는 개인정보 파일로서 5만명 이상의 정보 주체에 관한 법 제23조에 따른 민감 정보 또는 고유 식별 정보의 처리가 수반되는 개인정보 파일
구축·운용하고 있는 개인정보 파일을 해당 공공 기관 내부 또는 외부에서 구축·운용하고있는 다른 개인정보 파일과 연계하려는 경우로서 연계 결과 50만명 이상의 정보 주체에 관한 개인정보가 포함되는 개인정보 파일
구축·운용 또는 변경하려는 개인정보 파일로서 100만명 이상의 정보 주제에 관한 개인정보 파일",
      "법 제33조 제1항에 따른 개인정보 영향 평가를 받은 후 개인정보 검색 체계 등 개인정보 과일의 운용 체계를 변경하려는 경우 변경되는 개인정보 파일을 포함한 전체 개인정보 파일",
      "법 제33조 및 영 제35조에서 규정한 개인정보 영향 평가의 실시 대상이 되는 공공 기관이운영하는 개인정보 파일"],
d : [],
h : "개인정보 영향 평가를 최초 실시한 이후 해당 시스템에 변경 부분이 발생했고 이 때 다시 개인정보영향 평가를 실시해야 할 경우 개인정보 파일 중 변경된 개인정보 파일에 해당되는 시스템만 평가를 받으면 된다.
07 3 1080
5과목 개인정보관리 체계 ·
㉣
MI
131
{
m : "다음 중 정보보호 및 개인정보보호 관리 체계(ISMS-P) 인증과 개인정보 영향 평가(PIA)에 대한 비교 설명으로 틀린 것은?

* ISMS-P에서 정보보호 분야는 정보통신망법을, 개인정보보호 분야는 정보통신망법과 개인정보보호법을 따르고, PIA는 개인정보보호법을 기반으로 한다.",
      "ISMS-P의 시행 이전에 인증((구)PIMS, (구)ISMS)을 획득한 경우에는 이전 제도의 인증서 기간(3년)이 만료되기 전까지는 유효하다.
③ ISMS-P에서 정보보호 분야는 과학기술정보통신부가, 개인정보보호 분야는 개인정보보호위원회가 주무부처가 된다.",
      "개인정보 영향 평가(PIA)의 주무부처는 개인정보보호위원회가 된다.",
      "ISMS-P 인증과 PIA 평가는 상호 제도 간에 호환성이 인정되어 기업에 따라 1개 인증 또는 평가만 통과하면 상호 기준을 충족한 것으로 간주한다."],
d : [],
h : "ISMS-P와 PIA는 일부 유사한 부분이 있지만 상호 인정되는 제도가 아니다. 또한, 2018년 11월 7일부터는 기존의 ISMS와 기존의 PIMS 인증이 통합되어 ISMS-P라는 제도로 운영된다. 단, 기존 인증제도는 인증서 기간(3년)이 만료되기 전까지는 기존 인증 체계를 유지할 수 있다.
{
m : "다음 중 개인정보보호 관리 체계(ISMS-P)와 정보보호 준비도 평가(Secu-Star)에 대한 설명으로 틀린 것은?

* 개인정보보호 관리 체계와 정보보호 준비도 평가제도 모두 그 대상에 제한이 없이 자율적으로 시행된다.",
      "개인정보보호 관리 체계는 한국인터넷진흥원이 인증 기관 업무를 담당하고, 정보보호 준비도 평가는 한국정보방송통신대연합이 인증 기관 업무를 담당하고 있다.
정보보호 준비도 평가는 평가 결과에 따라 보안 등급이 5단계로(AAA, AA, A, BB, B)로 구분된다.",
      "정보보호 준비도 평가는 기반 지표와 선택 지표(개인정보보호)로 구성된다.",
      "개인정보보호 관리 체계와 정보보호 준비도 평가는 모두 등급별 부여가 가능하다."],
d : [],
h : "개인정보보호 관리 체계 인증은 등급을 부여하지 않고, 심사 기준에 따라 결함이 있는지의 여부만을 판단하며, 별도로 등급을 부여하지는 않는다.
정답 09 5 10 5
·
132
{
m : "다음의 그림은 개인정보 영향 평가 시 작성된 개인정보 흐름도이다. 표 안의 번호에 해당되는 정보로 적절하지 않은 것은?
Life-Cycle] 취급정보수집 홈페이지 문서 저장 및 이용와스서버 DB서버개인정보흐름도 파일 서버PC 제공 FTPXX기관 폐기 XX 유지보수 개인정보

* 관련된 자산(DBMS 등)에 저장되는 개인정보",
      "외부 기관에 제공되는 개인정보홈페이지를 통해 수집되는 개인정보",
      "파일 서버를 통해 다운로드 받는 정보",
      "DB 서버에 업로드 및 다운로드하는 개인정보"],
d : [],
h : "",
      ": DB 서버에 업로드 및 다운로드하는 개인정보 → DB 서버에 업로드 하는 개인정보상기 도표는 개인정보의 흐름에 대한 분석과 흐름 내에서 저장 이용 및 제공, 파기되는 개인정보의 내용을 알기 위한 도표이다. 오른쪽 표에는 왼쪽의 흐름도 절차별 번호 기준)로 처리되는 개인정보의 내용이 포함되어야 한다.
5과목 개인정보 관리 체계
· 133
11 5
12
다음은 개인정보보호 관리 체계에 대한 비교표이다. 내용 중 틀린 것은?
인증 구분(영문)인증 구분(한글)1ISMSISMS-PPIAISO 27001Secu-StarC정보보호관리 체계정보보호 및개인정보보호관리 체계개인정보영향 평가정보보안경영 시스템정보보호준비도 평가심사 기관KISA, KAIT, TTAFSI, OPAKISA, KAIT,TTA, FSINIA
* KISAKAIT. TTA.CONCERT주요 내용정보통신망법을 기반으로 하고 있으며, 법률 기준의대상자에 한해 의무적으로 이행해야 한다.ISMS 인증과 통제 항목이 일부 중복되고 있으나 ㉠개인정보의 처리 단계별 요구 사항을 다룬다는 점에서 차이가 있다.㉡ 공공 기관을 의무 대상으로 하고 있으며, 영향 평가에 대한 개인정보의 보유 기준을 두고 있다.ISO/IEC의 국제 표준 규격이며, 국내 ISMS와 많은 부분이 유사하지만 국외에 상호 인증 및 인정이 가능하다.개인정보보호를 위해 자율적으로 시행하고 있으며, 수준에 대한 등급을 부여하고 있으나 ",
      "개인정보보호에대한 항목은 보지 않는다."],
d : [],
h : "• ㉢ : KISA - ISO 27001 인증 기관
· ",
      ": 개인정보보호 ·정보보호
·ISO27001(정보보안 경영 시스템)의 인증 기관은 글로벌 인정 기관에 등록되어 있는 사설 인증 기관이 담당하고 있으며, 정보보호 준비도 평가는 개인정보보호 항목을 선택 지표로 활용할 수 있도록 하고 있다.
12 5
정남
134·개인정보관리사 CPPG
저다
{
m : "다음 중 개인정보보호 관리 체계 인증(ISMS-P) 인증에 대한 설명으로 옳지 않은 것은?

* 중소기업이 인증을 받기 위해서는 법적 요구 사항 이외에 관리 체계의 수립 및 이행, 개인정보보호 강화를 위한 보호 대책 수립, 개인정보 흐름 분석을 통한 위험 관리를 지속으로수행해야 한다.",
      "공공 기관이 대기업에 비해서 추가로 점검해야 할 항목은 '개인정보 영향 평가'와 '개인정보파일 관리'에 대한 부분이다.
③ 인증에 대한 주무부처는 과학기술정보통신부와 개인정보보호위원회가 되며, 인증 기관 및관련 업무 지원은 한국인터넷진흥원이 담당한다.",
      "해당 인증 제도는 정부에서 실시하는 개인정보 실태 점검이나 정보보호 수준 인증과 같은점검의 효과를 얻을 수 있다.",
      "해당 인증과 유사한 개인정보보호 제도로 BS10012(영국). P-Mark(일본) 등이 있다."],
d : [],
h : "개인정보 흐름 분석에 대한 예외 대상은 인증 기준에 없다.
{
m : "다음 중 개인정보보호 관리 체계에 대한 소관 부처 및 관련 법률에 대하여 잘못 짝지어진것은?
구분ISMSISMS-PPIA해설소관 부처㉠ 과학기술정보통신부방송통신위원회,행정안전부",
      "개인정보보호위원회관련 법률정보통신망법㉢ 정보통신기반보호법⑥ 개인정보보호법심사(평가) 기관KISAKISA보호위원회 지정기관39.2.0개인정보보호 관리 체계(ISMS-P)는 정보통신망법과 개인정보보호법을 근거로 하고 방통위행안부 → 개인정보보호위원회,
* 정보통신기반보호법 → 개인정보보호법, 정보통신망법
13 1
5과목 개인정보관리 체계
·
135
{
m : "다음 중 EPRIVACY와 i-Safe 인증 마크 제도에 대한 설명으로 옳은 것은?
인증 제도 관련 법률인증 대상 인증 기관심사 기준 ePRIVACY
* 개인정보보호법 인터넷 사이트 운영③ 개인정보보호협회(공공) 82개 항목생명 주기 : 37개 점검 항목· 관리 과정 : 13개 점검 항목· 보호 대책 : 32개 점검 항목(민간) ",
      "89개 항목· 생명 주기 : 36개 점검항목ㆍ관리 과정 : 12개 점검항목보호 대책 : 28개 점검항목소비자 보호 대책 : 13개 점검항목 i-Safe",
      "정보통신망법 인터넷 사이트 운영",
      "지식정보보안산업협회(공공) 105개 항목·생명 주기 : 28개 점검 항목.· 관리 과정 : 12개 점검 항목· 보호 대책 : 9개 점검 항목·시스템 보호 대책 : 56개 점검 항목(민간) 114개 항목생명 주기 : 26개 점검 항목.ㆍ관리 과정 : 12개 점검 항목· 보호 대책 : 7개 점검 항목· 시스템 보호 대책 : 56개 점검 항목·소비자 보호 대책 : 13개 점검 항목"],
d : [],
h : "해당 인증 마크는 두 개 모두 개인정보보호협회에서 주관하며, 공통으로 개인정보보호법과 정보통신망법을 근거로 한다. ePRIVACY 마크 인증은 심사 기준에서 소비자 보호 대책 항목은 존재하지 않는 (개인정보보호협회 : wwww.eprivacy.or.kr).
·
* : 개인정보보호법 → ·정보통신망법 및 개인정보보호법",
      ": 정보통신망법 정보통신망법 및 개인정보보호법
· ",
      ": 지식정보보안산업협회 개인정보보호협회
· ",
      ": (민간) 89개 항목 (민간) 76개 항목
15 3
136·개인정보관리사 CPPG
{
m : "다음 중 개인정보보호 관리 체계 구축 시의 위험 관리 단계에서 적용할 수 있는 위험 분석의 방법과 설명이 잘못 연결된 것은?
상세 내용 기준이 되는 체크 리스트를 토대로 위험을 도출하는 방법 기준이 없는 신기술 등과 같은 분야에 대해 관련 전문가를 통해 보안 진단을 분석하는 방법㉢ 상세 위험 접근법정보 자산의 가치와 취약점, 위협 등을 고려하여 위험을 분석하는 방법",
      "기준선 접근법과 상세 위험 접근법 기준선 접근법과 상세 위험 접근법 등을 복합적으로 같이 적용하는 방법 보안 요구 사항 분석 단계에서 시작하여 설계, 구현, 시험, 통합 단계 등을 거쳐 유지 보수 단계까지 평가하는 방법
* 기준선 접근법 방법론㉡ 전문가 분석 기법㉤ SDLC 기법 ㉢4 2"],
d : [],
h : "SDLC는 소프트웨어 개발의 생명 주기를 나타내는 것으로 시스템 개발과 관련된 방법론이다.
{
m : "다음 중 개인정보 영향 평가의 평가 기준이 아닌 것은?

* 해당 공공 기관에서 처리하는 개인정보의 종류와 성질, 정보 주체의 수 및 그에 따른 개인정보 침해의 가능성
법 제24조 제3항, 제25조 제6항 및 제29조에 따른 안전성 확보 조치의 수준 및 이에 따른 개인정보 침해의 가능성
③ 개인정보처리시스템의 침해 사고 분석",
      "개인정보 침해의 위험 요인별 조치 여부",
      "그 밖에 법 및 이 영에 따라 필요한 조치 또는 의무 위반 요소에 관한 사항"],
d : [],
h : "개인정보처리시스템의 침해 사고 분석 영역은 디지털 포렌식의 영역이며, 관련된 부서와 조직으로는 내부 CERT팀이나 외부 수사 기관 등과 관련이 있을 수 있다.
16 5
5과목 개인정보 관리 체계
· 137
17 3
{
m : "다음 중 정보보호산업진흥법의 제정에 따라 적용 되어지는 사항이 아닌 것은?

* 공공 기관 등은 정보보호시스템의 품질 보장을 위한 적정 수준의 대가 지급을 위해 노력해야하며, 과학기술정보통신부장관은 부당한 발주 행위가 일어나지 않도록 조치해야 한다.",
      "정보통신서비스 제공자로 하여금 정보보호 현황을 대통령령으로 정하는 바에 따라 공개할수 있도록 하였다.
관련 법률을 이행하는 기관에는 정보보호 제품 입찰 시 가산점을 주거나 정보보안 관련 또는 개인정보보호 사고 시 과징금의 50%를 경감한다.",
      "정부는 공공 기관의 경영 실적 평가 시 정보보호 실적(정보보호의 관리적, 기술적, 물리적조치 현황 및 운영 실적 등)을 반영하여 평가하도록 한다.",
      "과학기술정보통신부장관은 매년 우수 정보보호 제품 및 서비스 등을 지정하여 우선 구매등을 지원할 수 있고, 우수 정보보호 기업을 지정하여 자금 융자, 수출 및 세제지원 등을할 수 있도록 한다.
못한다."],
d : [],
h : "정보보호산업진흥법의 관련 사항을 준수했다고 해서 보안 사고 시 과징금을 경감하여 주지는
{
m : "다음 중 개인정보보호 관리 체계(ISMS-P)의 구성상 설명으로 옳지 않은 것은?

* 관리 체계 수립 및 운영은 반드시 지켜야 할 필수 사항이다.",
      "보호 대책 요구 사항은 조직 내부의 목적과 운영 상황에 따라 선택적으로 구현될 수 있다.③ 개인정보 처리 단계별 요구 사항은 법적 준거성을 기반으로 하고 있다.",
      "일반적으로 정보보호 관리 체계보다 그 범위가 전사 부서로 확대될 수 있다.
정보보호 관리 체계를 구축한 기업은 개인정보보호 관리 체계 구축 시 생명 주기만을 추가로 검토하여 구축하면 된다."],
d : [],
h : "개인정보보호 관리 체계 구축 시에는 반드시 개인정보처리시스템과 이와 관련된 조직의 자산(개인정보 DB, 개인정보처리 어플리케이션, 개인정보 부서의 취급 PC) 등이 모두 포함되어야 한다.
정답 18 3 19 5
138
{
m : "다음 중 인증 제도와 관련된 도표의 내용 중 틀린 것은?
구분항목제도 통합 전2㉢인증 기관심사 기관주무부처심사원 등급관련 법률(구)PIMS : KISA(구)ISMS: KISA, 금보원(구)PIMS: KISA(구)ISMS: KISA, KAIT, TTA, 금보원(구)PIMS : 방통위, 행안부(구)ISMS : 과학기술정보통신부심사원 보, 심사원, 선임심사원(구)PIMS : 정보통신망법, 개인정보보호법(구)ISMS : 정보통신망법(4) (2)제도 통합 후ISMS-P:KISA, 금보원ISMS-P: KISA, KAT. TTA 금보원(FSI), OPAISMS-P: 과학기술정보통신부, 개인정보보호위원회심사원 보. 심사원 선임심사원ISMS-P: 정보통신망법, 개인정보보호법③ ㉤"],
d : [],
h : "2018년 11월 7일부터는 기존의 (구)ISMS. (구)PIMS 제도가 ISMS-P 제도로 통합되었다. 그러나 신규ISMS-P 인증 제도에서 개인정보보호가 제외된 정보보호 관련 분야만 심사를 받을 경우에는 신규ISMS 인증 항목으로 심사가 진행된다. 또한, 기존의 (구)ISMS, (구)PMS에서는 심사원 등급이 3개였으나 ISMS-P로 통합된 인증 제도에서는 심사원 등급이 4개(심사원 보, 심사원 선임심사원 책임심사원)로 변경되었다. 참고로 (구)ISMS, (구)PIMS 제도는 인증서 유효 기간(3년 이 도래하는 시점까지최대 2022년까지 유효할 수 있는데 기관에 따라 인증 도래 기간은 다를 수 있다. 인증서 도래 시에는 반드시 새로운 제도인 ISMS나 ISMS-P로 갱신해야 한다.
20 4
5과목 개인정보 관리 체계·139
{
m : "다음 중 개인정보 영향 평가의 의무 대상 기관으로 맞게 연결된 것은?
'국가인권위원회법' 제3조에 따른 국가인권위원회㉡ '공공 기관의 운영에 관한 법률' 제4조에 따른 공공 기관㉢ '지방공기업법'에 따른 지방 공사 및 지방 공단",
      "'특별법'에 의하여 설립된 특수 법인㉤ '초·중등교육법', '고등교육법' 및 그 밖의 다른 법률에 따라 설치된 각급 학교"],
d : [],
h : "개인정보 영향 평가 수행 안내서 및 관련 법률에(개인정보보호법) 따라 보기의 기관이 모두 해당되며, 그 대상은 고유 식별 정보를 5만명 이상 보유하거나 내외부와 연계한 개인정보가 50만건 이상이거나 구축하여 운영 중인 개인정보가 100만명 이상 보유하고 있는 경우 의무 대상자이다.
정답 21 5
(2
㉤
140
{
m : "다음은 개인정보 영향 평가 시 개인정보 침해 요인 분석을 위한 평가 항목에 대한 기준표를 보여주고 있다. 해당 괄호 안에 내용 중 맞는 것은?
1. 대상 기관 개인정보보호 관리 체계 평가 분야 2. 대상 시스템의 개인정보보호 관리 체계 3. 개인정보 처리 단계별 보호 4. 특정 IT 기술 활용 시 개인정보보호세부 기준 1.1 대상 기관 개인정보보호 조직 1.2 개인정보보호 계획 1.3 개인정보 (
* 취급 방침)1.4 개인정보 (㉡ 파일) 관리 1.5 개인정보 위탁 및 제공시 안전 조치 1.6 개인정보 침해 대응 1.7 정보 주체 권익 보호 1.8 개인정보 처리 구역 보호 2.1 대상 시스템의 개인정보 관리 22 개인정보 처리 내용 ㉢ 백업)3.1 수집 단계 3.2 저장 및 보유 단계 3.3 이용 및 (ⓐ 연계)·제공 단계 3.4 파기 단계 4.1 CCTV 활용 4.2 RFID 활용 4.3 (ⓐ IoT 정보) 활용 4.4 위치 정보 활용 모두 맞음
㉤"],
d : [],
h : "각 항목을 정리하면 '㉠ : 처리 방침 ㉢ : 공개 ⑥:바이오 정보'가 맞는 내용이다.
22 2
5과목 개인정보 관리 체계
· 141
{
m : "다음은 공공 기관의 개인정보 수준 진단 지표(2014년 기준)에 대한 도식표이다. 괄호 안에들어갈 내용으로 틀린 것은?
□해설분야관리 체계 구축보호 대책 수립 및 시행: 위탁: 취약점 진단: 개인정보처리시스템침해 사고 대책지표1. 개인정보보호 기반 마련2. (㉠)업무에 따른 개인정보보호 활동3. 개인정보보호 (㉡) 추진4. 개인정보보호 책임자의 역할 수행5. 개인정보 이용 및 제공 절차 운영6. 개인정보 파일 관리7. 개인정보 (㉢) 수행8. (",
      ") 설치 및 운영9. 개인정보 노출 방지 및 자율 개선10. 개인정보 침해 사고 대응 절차 수립11. (ⓑ)의 안전한 이용 및 관리(2) ㉡:교육4 : 영상 정보 처리 기기
·㉢ : 취약점 진단 → 영향 평가
· 보기 ㉢은 개인정보의 영향 평가에 관한 사항으로 2015년에는 주민등록번호 점검에 대한 항목이추가되었다.
정답 23 3
142·개인정보관리사 CPPG
{
m : "다음 중 공공 기관이 개인정보 수준 진단을 수검 받을 경우와 민간 기관이 개인정보호보관리 체계(PIMS) 인증을 취득하려고 할 때 해당 지표 중 특별히 차이가 있는 항목으로 연결된 것은?
위험도 산정, 개인정보보 파일 등록",
      "위험도 산정, 개인정보 영향 평가③ 개인정보 파일 등록, 개인정보 영향 평가",
      "개인정보 파일 등록, 영상 정보 처리 기기 설치 개인정보 흐름도 분석, 영상 정보 처리 기기 설치"],
d : [],
h : "개인정보 파일 등록과 개인정보 영향 평가는 공공 기관만의 의무 사항이다.
다음 중 공공 기관이 반드시 수행해야 할 개인정보보호 관련 조치로 옳은 것은?

* 개인정보보호 사전 점검",
      "개인정보보호 사전 점검 + 개인정보 파일 등록③ 개인정보 수준 진단 + 개인정보 영향 평가 + 개인정보 파일 등록",
      "개인정보 수준 진단 + 개인정보 영향 평가 + 개인정보보호 인증 취득",
      "개인정보 수준 진단 + 개인정보 영향 평가 + 개인정보 파일 등록+정보시스템 감리"],
d : [],
h : "공공 기관의 경우 각 제도에 대한 이행 조건이 해당될 때는 모두 수행해야 한다. 예를 들어 개인정보수준 진단 및 개인정보 파일 등록은 모든 공공 기관에 해당하고, 개인정보 영향 평가는 보유하고 있는 주민등록번호가 단일 DB에 대해 5만명 이상을 보유하고 있을 때만 실시해야 한다.
24 3
25 3
5과목 개인정보 관리 체계·143
25
{
m : "다음 중 개인정보 수준 진단에 대한 내용으로 옳지 않은 것은?

* 중앙 행정 부처와 지자체 및 지방 공기업까지 대상에 해당하며, 중앙 부처 산하 기관은 50곳에 한정해 시범 실시된다.
개인정보 수준 진단은 개인정보보호법 제13조 제5항 '자율 규제의 촉진 및 지원' 법률 조항에 따라 공공 기관을 대상으로 진단을 실시하고 있다.
③ 해당 지표는 관리 체계 구축 및 운영, 보호 대책 수립 및 이행, 침해 대책 수립 및 이행 등 3개 분야의 12개 지표, 24개 항목에 대해 기관별 개인정보보호 관리 수준을 평가한다.",
      "대상 기관이 주민등록번호 처리 현황을 파악하고 있는지의 여부와 주민등록번호 관련 암호화 조치 계획을 수립하거나 이행하고 있는지 등 주민등록번호 수집 및 관리에 대한 평가항목이 신설되었다.",
      "평가 결과는 정부 업무 평가 및 기관 경영 평가에 반영된다."],
d : [],
h : "개인정보 수준 진단은 모든 공공 기관을 대상으로 매년 정부에서 그 실태를 점검하여 관리하고 있는 제도이다.
다음 중 개인정보 영향 평가에서 평가 기관의 지정 기준으로 옳지 않은 것은?
27

* 개인정보 영향 평가 업무 또는 이와 유사한 업무",
      "「전자정부법」 제2조 제13호에 따른 정보 시스템(정보보호 시스템을 포함한다)의 구축 업무 중 정보보호 컨설팅 업무(전자적 침해 행위에 대비하기 위한 정보 시스템의 분석·평가와 이에 기초한 정보보호 대책의 제시 업무)
③ 「전자정부법」 제2조 제14호에 따른 정보 시스템 감리 업무 중 정보보호 컨설팅 업무",
      "보유하고 있는 개인정보 DB가 100만명 이상이며, 개인정보 처리 시스템 업무를 수행하고 있는 경우
「정보통신망 이용 촉진 및 정보보호 등에 관한 법률」 제2조 제8호에 따른 정보보호 산업에 해당하는 업무 중 정보보호 컨설팅 업무"],
d : [],
h : "최근 5년간 위의 보기와 같이 어느 하나에 해당하는 업무 수행의 대가로 받은 금액의 합계액이 2억원 이상인 법인에 해당하며, 보기 ",
      "번은 개인정보 영향 평가의 대상 기관이나 개인정보 처리 시스템을 운영하는 일반 기관에 해당한다.
정답 26 1 27 (4)
144
{
m : "다음 중 개인정보보호 관련 인증 및 제도 구축 시 혜택으로 옳지 않은 것은?
구분인증/제도혜택개인정보 유출 사고 발생 시 과징금의 50%를 경감 받을 수 있다. 기업의 의무 사항은 아니며, 자율적으로 실시할 수 있다. (C)해설 ISMS-PSecu-Star ISMS 개인정보 수준 진단 BS10012정보보호산업진흥법 제12조에 따라 정부는 정보보호 준비도 평가를 받은 기업 평가 결과에 따라 포상 등 필요한 지원을 할 수 있으나 현재 구체적인 지원책은 검토 중에 있다. 공공 부문의 정보 시스템 기획·구축·운영 사업자, SW 개발 사업자 선정 시 평가 항목(기밀 보안)에 ISMS 인증 취득 시 만점(최대 5점)이 부여된다. 공공 기관 경영 평가에 해당 결과가 반영된다. PIMS와 상호 인증으로 같은 혜택이 부여되며, 수출입시 국제 표준 취득으로 인한 관세가 2% 이내로 인하될 수 있다. (2(4) 2BS10012는 개인정보보호에 대해 영국(BSI)의 표준이며, PIMS와 상호 인증의 효력이 없고, 수출입
시별도 혜택 또한 없다.
다음 개인정보의 그룹 중 가장 중요도가 높은 그룹은 무엇인가?
구분 (㉢)(20(㉥)㉥ 해설 조합된 개인정보 그룹 주민번호, 신용 정보, 신용 카드 번호, 신용 카드 비밀번호, 은행 및 증권사 계좌 번호 ID/Password 등 이름, 주소, 전화번호, 핸드폰 번호, 전자 메일 주소인종, 종교, 병역, 사회 단체 활동, 보건소 등록 정보 등㉡ + ㉢ 개인을 식별할 수 없는 일반 정보 상담 내용, 녹취 파일, 위치 정보, IP 정보, CCTV 영상 정보, 쇼핑몰 구매 이력, 약국 처방전 정보 등 중요도가 높다는 것은 법률에서 지정한 규정(암호화 대상)이 있거나 민감 정보(유전 정보향 등), 보존 기간 등이 지정된 사항(결제 정보 등)이 포함된 내용들이 해당된다.
정치적 성
29 3
28 5
5과목 개인정보 관리 체계 ·
29
145
다음 개인정보보호와 직접적인 관련이 있는 제도로 연결한 것 중 가장 적절하지 않은 것은?
구분 ㉠ (2) ㉧ 해설 ISMS-P. P-Mark(Japan) e-Privacy, ISO27001 BS10012. 정보 시스템 감리 2012, I-Safe ISO20000, ISO27001 ISO27001. GDPR 관련 제도 ㉤
정보 시스템 감리는 정보화 시스템 구축과 직접적인 관련이 있으며, 보안 관점보다는 개발 관점이 크다고 할 수 있다. 또한, ISO2000은 IT 서비스 관리를 위한 가용성 관점의 국제 표준이다.
다음 중 개인정보보호 관련 인증 제도에 대한 설명으로 옳지 않은 것은?
이 고시는 「정보통신망 이용 촉진 및 정보보호 등에 관한 법률」(이하 "법"이라 한다) 제47조의3 (개인정보보호 관리 체계 인증) 제2항 및 「정보통신망 이용 촉진 및 정보보호 등에 관한 법률 시행령」(이하 "영"이라 한다) 제47조 제7항 ㆍ 제48조 제52조 제53조의2 제53조의3 제53조의4 제54조의2에 따라 개인정보보호 관리 체계 인증에 관한 필요한 사항에 대하여 정하는 것을 목적으로 한다.제1조(목적) 이 고시는 「개인정보보호법」제13조 제3호 및 「정보통신망 이용 촉진 및 정보보호 등에 관한 법률」(이하 "정보통신망법"이라 한다) 제47조의3 제2항에 따른 ~ (중략) 관하여 필요한 사항을 정함을 목적으로 한다.~제3조(인증기관 등)
* 인터넷진흥원 또는 인증 기관은 다음 각 호의 업무를 수행한다.1. 인증 심사의 실시 및 인증·인증 취소(중략)~6. 인증 제도 관련 연구 및 동향 조사·분석, 그밖에 인증 제도의 운영에 필요한 사항
30 4 31 3
저다
·
30
31
146
제16조(악성 코드 감염 방지 대책)
㉠ ○○회사 또는 oo업자는 악성 코드 감염을 방지하기 위하여 다음 각 호를 포함한 대책을 수립및 운용하여야 한다. ~(중략)~
1. 악성 코드 검색 및 치료 프로그램은 최신 상태로 유지할 것
2. 악성 코드 감염에 대비하여 복구 절차를 마련할 것
제17조(홈페이지 등 공개용 웹 서버 관리 대책)
○○ 회사 또는 ○○ 업자는 공개용 웹 서버 게재된 내용에 대하여 다음 각 호의 사항을 준수하여~
야 한다. (중략)
1. 개인정보의 유출 및 위변조를 방지하기 위한 보안 조치
제6조(의무적 조정 과징금)

* 위반 기간을 고려하여 다음 각 호와 같이 과징금을 조정한다. (중략)~
임의적 가중감경 금액(제8조 관련)
1. 가중 사유 및 비율
1. 위반 전기통신사업자 및 그 소속 임원 종업원이 법 제64조 제1항 및 제3항에 따른 물품이나 서류의 제출 요구 또는 검사를 거부하거나 증거 인멸, 조작, 허위 정보 제공 등의 방법으로 조사를 방해하거나 관련 이용자에게 허위로 진술하도록 요청한 경우 100분의 30 이내 (중략)~
(4)
II. 감경 사유 및 비율
1. 위반 전기통신사업자가 개인정보보호를 위해 방송통신위원회가 인정하는 인증을 받은 경우 100분의 50 이내 (중략)~
제 1장 개인정보 수집
1.1 개인정보의 수집자
점검항목증빙자료심사평가111 개인정보 수집자의 게시 및 링크1. 개인정보를 제공하는 이용자가 사이트 운영 기업을 쉽게 알수 있도록 주소(영업소 소재지 연락처(전화번호전자우편, 사업자등록번호, 이용약관 등)을 사이트 초기 서비스 게시 혹은 링크ex 수집 주제를 알수 있는 기업(관)의 상호 혹은 대표자 성명을 개시하고 있는 초기 서비스 개시회인 등을 겹쳐심사결과"],
d : [],
h : "• 보기
*번, ",
      "번, ",
      "번은 ISMS-P 인증 제도에 해당되는 내용이다.보기 ③번은 금융기관에 해당되는 전자금융거래법의 정보 기술 부문에 대한 악성 코드 탐지 대책의 조항에 해당되는 내용으로 개인정보보호 관련 인증 제도와는 관련이 없다.· 보기 ",
      "번은 개인정보보호협회의 EPRIVACY 마크 인증 심사 기준(www.eprivacy.or.kr)에 대한 내용이다.
5과목 개인정보 관리 체계 ·
147
다음 도표에서 짝지어진 내용 중 모두 틀린 것으로만 연결된 것은?
ISMS-P㉡ PIA㉢ Secu-StarISO27001X㉡. ㉢㉡. ㉢.개인정보보호적용성 보고서국제 표준자율 인증
3㉢, ㉣",
      "해당 사항 없음"],
d : [],
h : "도표의 보기 중 ㉠을 제외하고 일부 항목의 연결이 잘못 되었으며, 보기에 맞는 내용은 다음과 같다.㉡ PIA(개인정보 영향 평가) : 개인정보보호 의무 대상 부여㉢ Secu-Star(정보보호 준비도 평가) : 개인정보보호, 자율 인증",
      "ISO27001(정보보안 경영 시스템) : 개인정보보호, 적용성 보고서, 국제 표준, 자율 인증
32 (4)
저다
32
148
{
m : "다음 중 ISMS-P에서 운영 절차에 대한 내용으로 옳지 않은 것은?
인증 기관은 인증 심사, 인증 위원회 운영, 인증서 발급 및 관리, 사후 관리, 인증 심사원관리, 인증 심사원 양성 등의 역할을 수행한다.
인증 범위는 부서별 개인정보보호 관리 체계를 수립하는 것이 바람직하나 조직의 규모와 성격에 따라 특정 서비스 범위로 한정할 수 있으며, 이러한 경우 콜 센터 등의 상담조직은 범위에 제외될 수 있다.
㉢ 인증서의 유효 기간은 3년이며, 관리 체계의 지속적인 유지 및 관리를 위한 사후 심사는1년, 3년 중 선택할 수 있다.",
      "인증 심사는 준비 단계, 심사 단계, 인증 단계, 사후 관리 단계로 구성되어 있다.ⓑ 인증에 필요한 서류에는 개인정보보호 관리 체계 내역서, 정책서, 개인정보 내부 관리계획서, 운영 명세서, 내부 감사 결과 보고서, 개인정보처리시스템 취약점 진단 결과 보고서 등이 있다.
⑥ 인증 기관은 KISA가 수행하고 있다."],
d : [],
h : "• 보기 ㉡에서 인증 범위는 특정 범위로 제한될 수 있으나 콜 센터 등의 상담 조직은 개인정보를다루는 중요한 부서로 심사 범위에서 반드시 포함하고 있다.· 보기 ㉢에서 개인정보보호 관리 체계의 인증 심사는 1년 단위로 사후 심사가 수행되어야 한다.
]}
*/
